//=============================================================================
// plugin name Ayatam_AdvancedCharacterGraphics.js
// ■ 歩行グラフィック拡張MVMZ 対応コアver 1.6.3
//
// (C)2022-2600 ayatam
//=============================================================================
//  【更新内容】
//  2023/9/6 v0.21 クロノマナエンジンに対する
//                 連携アップデートPart.4実施しました。
//                 細かい不具合の修正
//  2023/9/6 v0.20 フォロワー拡張機能がfalseの場合にメモ欄設定が存在した状態でセーブ⇒ロードを行った際、
//                 フォロワー歩行グラフィックが消失してしまう不具合を修正しました。
//  2023/9/5 v0.19 フォロワーに対する設定の一部が一定条件下で正常に動作していなかった不具合による
//                 セーブデータ読み込み不具合を修正しました。
//  2023/9/4 v0.18 セーブデータのロード時にフォロワーがマップ外へ飛ばされてしまう不具合を修正しました。
//  2023/9/4 v0.17 セーブ後のロードデータで人数変更時の情報を受け取れていなかった不具合を修正しました。
//                 一定条件下でセーブ後のデータをロードできなかった不具合を修正しました。
//  2023/8/25 v0.16 クロノマナエンジンに対する
//                  連携アップデートPart.3実施しました。
//  2023/8/9 v0.15 クロノマナエンジンに対する
//                 連携アップデートPart.2実施しました。
//  2023/6/28 v0.14 8方向移動機能が拡張機能と連動してしまっていた不具合を修正しました。
//                  ピクセル移動モード時に8方向移動を使用していない場合の挙動を修正しました。
//  2023/6/14 v0.13 データベースに直接ダミー歩行グラを指定した際の不具合を修正しました。
//  2023/6/14 v0.12 イベントのアニメ数拡張時に正しく歩行アニメが再生されない不具合の修正を行いました。
//                  イベントのマップ上、指定移動時に歩行速度を変更してしまう不具合の修正を行いました。
//  2023/6/14 v0.11 イベントに対する待機・歩く・走るモードの不具合を修正しました。
//                  自律移動のランダムに関しては、デフォルトで歩くが指定されていますので、
//                  対象を走るモードにする際は、別のイベント/または自身のイベント内にて、
//                  移動ルートの設定でスクリプトコマンド this.acgRun(true/false) を
//                  使用していただき、歩くモード/走るモードを切り替えてご使用ください。
//  2023/5/25 v0.10 クロノマナエンジンに対する
//                  連携アップデートPart.1実施しました。
//  2023/5/16 v0.09 歩行グラ検証頻度を最適化しました。
//  2023/5/8 v0.08 一定条件下で一部更新情報が不適切だったのを修正しました。
//  2023/4/8 v0.07 歩行グラの縦オフセットを調整する認識名を追加しました。
//  2023/3/21 v0.06 _fIdleの仕様の問題が大きすぎるため、削除しました。
//                  対象歩行グラフィックが存在しない際に機能をすべて停止する機能を実装しました。
//                  セーブ・ロード画面時に歩行グラフィック拡張MVMZが適応されていなかった不具合を修正しました。
//                  一定条件下で _stepAnime が含まれていない歩行グラフィックに対し、
//                  アニメーションフラグを適応してしまう不具合を修正しました。
//  2023/3/20 v0.05 セーブデータ読み込み時、差分情報ロードを失敗する不具合を修正しました。
//  2023/3/18 v0.04 v0.03新機能によるMz時のMvMz対応処理の不備の修正をしました。
//  2023/3/7 v0.03 アニメ1回再生が正常に動作していなかった不具合を修正しました。
//                 マップタッチ移動の微妙なズレを修正しました。
//                 イベント位置検索移動機能を追加しました。
//  2023/2/12 v0.02 [新機能]
//                    ・Pixel移動機能の追加。
//                    ・自動ダッシュモードを実装。
//                    ・MZにも対応しました。
//                    ・オプション認識名の実装。
//                    ・アニメ待機コマID認識名の実装。
//                    ・アニメ1回再生認識名の実装。
//                    ・アニメループ再生認識名の実装。
//                    ・アニメ逆再生認識名の実装。
//                  [仕様変更]
//                    ・歩行グラをレイヤー化 [完了]
//                      武器・防具・素体をレイヤーとして扱います。
//                    ・歩行パターン毎にアニメ数・再生速度を
//                      指定できるように仕様変更。
//                  [不具合修正]
//                    ・歩行グラアニメが一部適切に変更されなかった不具合の修正。
//                    ・フォロワーの一部歩行グラパターンが高速化する不具合の修正。
//                    ・その他細かい不具合の修正。
//  2022/6/28 v0.01 試作完成。
//=============================================================================

var Imported = Imported || {};
Imported.Ayatam_AdvancedCharacterGraphics = true;

var Ayatam = Ayatam || {};
Ayatam.ACG = Ayatam.ACG || {};

/*:
 * @target MV MZ
 * @plugindesc 歩行グラフィック拡張MVMZ v0.21
 * 歩行グラフィック拡張機能を追加。
 * @author Ayatam (Another Young Animations)
 * 
 * @help ■ 歩行グラフィック拡張MVMZ
 * 本プラグインは、MV Core ver 1.6.3 に対応。
 *                 MZ Core ver 1.5.0 に対応。
 *                             1.6.0 に対応。
 * 
 * 【利用規約】
 * ・改造はご自由に行ってください。
 * ・他サイト様の素材との競合によるエラーには基本、対応しません。
 * ・素材単体でのエラーには対応します。ただし、その責任は負いません。
 * ・アダルト・商業可。
 * 
 * 【素材を使用したゲーム等について】
 * ・作者名、サイト名、URLなどをread_meなどに分かりやすい形で記載してください。
 * 
 *   作者名:ayatam
 *   サイト名:Another Young Animations 公式サイト
 *   URL:https://ayatam.wixsite.com/index
 * 
 * =============================================================================
 *  【プラグイン使用方法】
 *  ・プラグインパラメータの各種設定をお好みの設定にし、
 *    下記仕様に基づき歩行グラフィック拡張機能を実装してください。
 *  ・本プラグインにはプラグインコマンドはありません。
 *    スクリプトコマンドのみです。
 * 
 * =============================================================================
 * 
 * =============================================================================
 * 
 *  仕様 [アクター] 編
 * 
 * =============================================================================
 * 
 * 【歩行グラフィックの仕組み】
 *  
 *  本プラグインでは、プラグインパラメータの設定に基づいて
 *  歩行グラフィック画像名に認識名を追加することで機能するようにできています。
 * 
 *  例: Actor1.png に Actor1_判別したい認識名.png のように
 *      追加するだけで対応します。
 *      必ず、ベースとなる Actor1 は歩行グラフィック画像名の先頭に
 *      設定してください。
 *      ※歩行グラフィック画像名に認識名が含まれていれば判別しますので、
 *        各認識名同士は順不同でも問題はありません。
 * 
 *  下記、各認識名の説明をお読みいただき、
 *  判別したい認識名を歩行グラフィック画像名に設定してください。
 *  ※また認識名はプラグイン設定で変更可能です。
 *    下記、説明はすべてデフォルト設定での説明になります。
 * 
 *  これからご説明する各認識名は機能毎にON/OFFの指定ができます。
 *  下記スクリプトコマンド「個別歩行グラフィックの設定 アクターメモ欄」にて
 *  アクター毎にも指定できますので、お好みで設定してください。
 * 
 * -----------------------------------------------------------------------------
 *                                 仕様書
 * -----------------------------------------------------------------------------
 * 
 * 【認識名:アニメ数の拡張 _frames〇】
 *     ・アニメ拡張認識名 _frames + アニメ数 
 *       ※未指定でシステムデフォルトの 3 を採用します。
 *         アニメ数が 3 を超える場合 / 3 未満の場合の
 *         アイドリング(待機中)として使用されるマスは、
 *         一番左のマスです。下記をご参考ください。
 * 
 *         指定例: Actor1_frames8.png
 * 
 *        【ツクール仕様のアニメ数 3 の場合の歩行グラアイドリング】
 *         <<画像名例>> Actor1.png または、Actor1_frames3.png
 *  index      0      1      2      3
 *           0 1 2  0 1 2  0 1 2  0 1 2
 *           0 1 2  0 1 2  0 1 2  0 1 2
 *           0 1 2  0 1 2  0 1 2  0 1 2
 *           0 1 2  0 1 2  0 1 2  0 1 2
 *  index      4      5      6      7
 *           0 1 2  0 1 2  0 1 2  0 1 2
 *           0 1 2  0 1 2  0 1 2  0 1 2
 *           0 1 2  0 1 2  0 1 2  0 1 2
 *           0 1 2  0 1 2  0 1 2  0 1 2
 *           ※各列の 0 1 2 は、コマIDと認識していただければ幸いです。
 * 
 *         上記の並びで歩行グラフィックが用意されています。
 *         ツクールの仕様では、真ん中の コマID:1 がアイドリングになります。
 *         ※プログラム上は、0 から始まるので、0 からコマ数 3 個で、
 *           最後が 0 1 2 の 2 になります。
 * 
 *        【アニメ拡張で 3 超え( 7 にした場合)の歩行グラアイドリング】
 *         <<画像名例>> Actor1_frames7.png
 *  index          0              1              2              3
 *           0 1 2 3 4 5 6  0 1 2 3 4 5 6  0 1 2 3 4 5 6  0 1 2 3 4 5 6
 *           0 1 2 3 4 5 6  0 1 2 3 4 5 6  0 1 2 3 4 5 6  0 1 2 3 4 5 6
 *           0 1 2 3 4 5 6  0 1 2 3 4 5 6  0 1 2 3 4 5 6  0 1 2 3 4 5 6
 *           0 1 2 3 4 5 6  0 1 2 3 4 5 6  0 1 2 3 4 5 6  0 1 2 3 4 5 6
 *  index          4              5              6              7
 *           0 1 2 3 4 5 6  0 1 2 3 4 5 6  0 1 2 3 4 5 6  0 1 2 3 4 5 6
 *           0 1 2 3 4 5 6  0 1 2 3 4 5 6  0 1 2 3 4 5 6  0 1 2 3 4 5 6
 *           0 1 2 3 4 5 6  0 1 2 3 4 5 6  0 1 2 3 4 5 6  0 1 2 3 4 5 6
 *           0 1 2 3 4 5 6  0 1 2 3 4 5 6  0 1 2 3 4 5 6  0 1 2 3 4 5 6
 * 
 *         上記の並びで歩行グラフィックを用意することになります。
 *         各indexにあるアニメ数は、3 超えの 7つなので、
 *         3 超えである場合のアイドリングに使用されるのは コマID:0 になります。
 *         3 未満も同じようにアイドリングは、コマID:0 です。
 *         3 の時のみ、上記のツクールの仕様が適応されます。
 * 
 *         また index毎で別けたい場合は、画像名の頭に $ と指定すると、
 *         一種類の歩行グラフィックとして認識しますので、
 *         その際の歩行グラフィックは以下のようになります。
 * 
 *        【$を頭に追加しアニメ拡張を 3 超え( 7 にした場合)の歩行グラアイドリング】
 *         <<画像名例>> $Actor1_frames7.png
 *  index          0
 *           0 1 2 3 4 5 6
 *           0 1 2 3 4 5 6
 *           0 1 2 3 4 5 6
 *           0 1 2 3 4 5 6
 * 
 *           上記の歩行グラフィックを用意してください。
 *           $を画像名の頭に使用した際でも、アニメ数が 3 超え 3 未満なら
 *           アイドリングに使用されるのは、コマID:0 です。
 * 
 * -----------------------------------------------------------------------------
 * 
 * 【認識名:アニメ再生速度 _fSpeed〇】
 *     ・アニメ再生速度認識名 _fSpeed + 再生速度
 *       ※未指定でシステムデフォルトの 60 を採用します。
 * 
 *         指定例: Actor1_fSpeed50.png
 * 
 * -----------------------------------------------------------------------------
 * 
 * 【認識名:アニメループ再生 _stepAnime】
 *     ・アニメループ再生認識名 _stepAnime
 *       ※未指定でアニメのループ再生をしない。
 * 
 *         指定例: Actor1_stepAnime.png
 * 
 * -----------------------------------------------------------------------------
 * 
 * 【認識名:アニメ1回再生 _fOnce】
 *     ・アニメ1回再生認識名 _fOnce
 *       この認識名が含まれる認識名は、_stepAnime と併用する仕組みになっており、
 *       必ず、一緒に _stepAnime を含めてください。
 *       歩行グラフィックのアニメーションが再生され、コマID:0 から
 *       1回目の コマID:最後尾 でアニメ再生が停止します。
 *       ※未指定で通常フラグ。
 * 
 *         指定例: Actor1_stepAnime_fOnce.png の場合
 *                 最後尾は、0 1 2 の 2 です。
 * 
 *         指定例: Actor1_frames7_stepAnime_fOnce.png の場合
 *                 最後尾は、0 1 2 3 4 5 6 の 6 です。
 * 
 *     ※下記「歩行グラフィック1回再生済みか」スクリプトにて、
 *       1回再生が終了したか状態を取得できます。
 * 
 * -----------------------------------------------------------------------------
 * 
 * 【認識名:アニメ逆再生 _revAnime】
 *     ・アニメ逆再生認識名 _revAnime
 *       アニメーションを逆から再生します。
 *       ※未指定で通常フラグ。
 * 
 *         本来のアニメーションは、
 *           0 1 2
 *           →→→ に再生しますが、
 * 
 *           _revAnime は、
 *           0 1 2
 *           ←←← に再生させます。
 * 
 *        指定例1: アニメ数7でアニメーションを利用する場合
 *                 Actor1_frames7_stepAnime_revAnime.png
 * 
 *        指定例2: アニメ数7でアニメーション1回再生を利用する場合
 *                 Actor1_frames7_stepAnime_fOnce_revAnime.png
 *                 逆再生なので終了は、0 1 2 3 4 5 6 の 0 です。
 * 
 *        指定例3: アニメ数7でアニメーションを利用しない場合
 *                 ※歩行中に逆再生します。
 *                 Actor1_frames7_revAnime.png
 * 
 * -----------------------------------------------------------------------------
 * 
 * 【認識名:歩行グラ縦中心調整 _offSetY】
 *     ・歩行グラ縦中心調整認識名 _offSetY + 調整値
 *       ※マイナス不可
 *       ※未指定で通常位置。
 * 
 *        歩行グラ画像の位置を上方向へずらすことができます。
 * 
 *        指定例1: アニメ数7で歩行グラの縦中心を70ピクセルずらす場合
 *                 Actor1_frames7_offSetY70.png
 * 
 *        指定例2: 通常歩行グラの縦中心を70ピクセルずらす場合
 *                 Actor1_offSetY70.png
 * 
 * -----------------------------------------------------------------------------
 * 
 * 【認識名:斜め移動 _dDir】
 *      斜め方向歩行グラフィックは、8方向移動機能を必須とします。
 *      他プラグインに 8方向移動機能がない場合は、
 *      本プラグインパラメータの基本設定 > 8方向移動の有無 を
 *      有効にしてください。
 *      他プラグインにある場合は、どちらかを無効にしてください。
 *      ピクセル移動も使用する際は、本プラグインの方を有効にしてください。
 *      ※またはアクター個別に指定可能です。
 * 
 *     ・斜め方向中認識名 _dDir
 *       ※8方向移動が有効且つ斜め移動中に使用される歩行グラフィックになります。
 * 
 *       斜め移動を採用する際は、必ず、
 *       斜め移動していない場合の _dDir なしの
 *       歩行グラフィックも必要です。
 *       <<画像準備例>>
 *         [斜め移動中] Actor1_dDir.png
 *         [非斜め移動中] Actor1.png
 * 
 *         また斜め方向用の歩行グラフィックは以下のように準備します。
 *         <<画像名例>> Actor1_dDir.png
 *  index      0      1      2      3
 *           0 1 2  0 1 2  0 1 2  0 1 2 ← この列が[右下方向]
 *           0 1 2  0 1 2  0 1 2  0 1 2 ← この列が[左下方向]
 *           0 1 2  0 1 2  0 1 2  0 1 2 ← この列が[右上方向]
 *           0 1 2  0 1 2  0 1 2  0 1 2 ← この列が[左上方向]
 *  index      4      5      6      7
 *           0 1 2  0 1 2  0 1 2  0 1 2 ← この列が[右下方向]
 *           0 1 2  0 1 2  0 1 2  0 1 2 ← この列が[左下方向]
 *           0 1 2  0 1 2  0 1 2  0 1 2 ← この列が[右上方向]
 *           0 1 2  0 1 2  0 1 2  0 1 2 ← この列が[左上方向]
 * 
 *         ※アニメ数はデフォルトの 3 での説明ですが、
 *           アニメ拡張で増やしても、画像名の頭に $ がついていても
 *           斜め方向の判定は変わりませんので同様にご用意してください。
 *  
 *         ※斜め移動として選択される列にすこし特徴があります。
 *           同じ左上に移動する場合でも先に入力された方向で変ります。
 *           左を押した後に上を押した場合は、左下方向の列を優先し、
 *           上を押した後に左を押した場合は、左上方向の列を優先します。
 *           他のパターンも同じです。
 * 
 *           アニメ数を それぞれ指定し、
 *           アニメ再生速度も それぞれ指定 にした場合の
 *           斜め移動を使用する際に必要な歩行グラフィックは
 *           以下の2つです。
 *           [斜め移動中] Actor1_frames5_fSpeed40_dDir.png
 *           [非斜め移動中] Actor1_frames3_fSpeed40.png
 *           ※認識名の指定順は例です。
 * 
 * -----------------------------------------------------------------------------
 * 
 * 【認識名:待機/歩く/走る _stand _walk _run】
 *       この認識名を使用する際は、
 *       本プラグインパラメータの基本設定 > 待機/歩く/走る機能 を
 *       有効にしてください。
 *       ※またはアクター個別に指定可能です。
 * 
 *     ・待機中認識名 _stand
 *       ※キャラクター操作をしていない場合に使用されます。
 * 
 *     ・歩き中認識名 _walk
 *       ※キャラクター操作をしていて、且つ歩きモード中に使用されます。
 * 
 *     ・走り中認識名 _run
 *       ※キャラクター操作をしていて、且つ走るモード中に使用されます。
 * 
 *       <<画像準備例>>
 *         [待機中] Actor1_stand.png
 *         [歩き中] Actor1_walk.png
 *         [走り中] Actor1_run.png
 * 
 *       [例] アニメ数を それぞれ指定し、
 *            アニメ再生速度も それぞれ指定 にした場合の
 *            待機/歩く/走る機能を使用する際に必要な歩行グラフィックは
 *            以下の3つです。
 *              [待機中] Actor1_frames5_fSpeed40_stand.png
 *              [歩き中] Actor1_frames3_fSpeed10_walk.png
 *              [走り中] Actor1_frames8_fSpeed80_run.png
 *              ※認識名の指定順は例です。
 * 
 *            さらに斜め移動歩行グラフィックを使用する場合は、
 *            斜め差分を以下のように用意します。
 *              [待機中/斜め移動用]   Actor1_frames5_fSpeed70_dDir_stand.png
 *              [待機中/非斜め移動用] Actor1_frames4_fSpeed40_stand.png
 *              [歩き中/斜め移動中]   Actor1_frames2_fSpeed20_dDir_walk.png
 *              [歩き中/非斜め移動中] Actor1_frames8_fSpeed10_walk.png
 *              [走り中/斜め移動中]   Actor1_frames9_fSpeed90_dDir_run.png
 *              [走り中/非斜め移動中] Actor1_frames6_fSpeed40_run.png
 *              ※認識名の指定順は例です。
 * 
 * -----------------------------------------------------------------------------
 * 
 * 【認識名:リージョン _〇〇】
 *     本プラグインパラメータの「リージョンによる歩行グラ機能」にて
 *     作成されたリージョンIDに接触した際、指定した認識名を採用します。
 *     一つも設定していない状態でリージョン機能を未使用にします。
 *     ※複数設定可ですが、リージョンIDは被らないようにしてください。
 *     ※デフォルトで リージョンID:1 を設定していますので、
 *       それを元にご説明します。
 *     例: リージョンID:1 をマップの海の部分に設定した場合、
 *         海に入ると _swim という泳ぎの歩行グラフィックに切り替えます。
 *         また海に入ってる状態でキャラクター操作をしていない場合、
 *         アニメーションを再生しません。
 * 
 *       [例] アニメ数を それぞれ指定し、
 *            アニメ再生速度も それぞれ指定 にした場合の
 *            待機/歩く/走る機能を使用し、リージョンID:1 に接触した際に
 *            必要な歩行グラフィックは以下の3つです。
 *              [待機中] Actor1_frames8_fSpeed40_stand_swim.png
 *              [歩き中] Actor1_frames5_fSpeed20_walk_swim.png
 *              [走り中] Actor1_frames6_fSpeed90_run_swim.png
 *              ※認識名の指定順は例です。
 * 
 *            さらに斜め移動歩行グラフィックを使用する場合は、
 *            斜め差分を以下のように用意します。
 *              [待機中/斜め移動用]   Actor1_frames6_fSpeed50_dDir_stand_swim.png
 *              [待機中/非斜め移動用] Actor1_frames5_fSpeed20_stand_swim.png
 *              [歩き中/斜め移動中]   Actor1_frames2_fSpeed80_dDir_walk_swim.png
 *              [歩き中/非斜め移動中] Actor1_frames9_fSpeed70_walk_swim.png
 *              [走り中/斜め移動中]   Actor1_frames2_fSpeed40_dDir_run_swim.png
 *              [走り中/非斜め移動中] Actor1_frames5_fSpeed40_run_swim.png
 *              ※認識名の指定順は例です。
 * 
 * -----------------------------------------------------------------------------
 * 
 * 【認識名:ステート _rs〇】
 *       この認識名を使用する際は、
 *       本プラグインパラメータの基本設定 > ステート機能 を
 *       有効にしてください。
 *       ※またはアクター個別に指定可能です。
 * 
 *     ・ステート認識名 _rs + ステートID
 *       本プラグインパラメータの「ステート認識リスト」または
 *       個別指定した「ステート認識リスト」にて
 *       指定されているステートにかかると
 *       ステート認識名の歩行グラフィックに切り替えます。
 *     例: ステート認識リストに 暗闇ステートの 5 が指定されていて、
 *         暗闇ステートが付与されたら、_rs5 と指定されている
 *         歩行グラ画像名のグラフィックに切り替えます。
 * 
 *       この認識名はステート付与時に限り、使用されますので
 *       ステート付与されていない場合の ステート認識名 なしの
 *       歩行グラフィックが必要です。
 *       <<画像準備例>>
 *         [ステート付与中] Actor1_rsステートID.png
 *         [ステート付与されていない場合] Actor1.png
 * 
 *       [例] アニメ数を それぞれ指定し、
 *            アニメ再生速度も それぞれ指定 にした場合の
 *            待機/歩く/走る機能を使用し、指定されているステートにかかった際に
 *            必要な歩行グラフィックは以下の3つです。
 *              [待機中] Actor1_frames8_fSpeed50_stand_rs5.png
 *              [歩き中] Actor1_frames4_fSpeed80_walk_rs5.png
 *              [走り中] Actor1_frames7_fSpeed20_run_rs5.png
 *            またリージョンID:1 に接触した際に
 *            必要な歩行グラフィックは以下の3つです。
 *              [待機中] Actor1_frames6_fSpeed30_stand_swim_rs5.png
 *              [歩き中] Actor1_frames2_fSpeed90_walk_swim_rs5.png
 *              [走り中] Actor1_frames4_fSpeed40_run_swim_rs5.png
 *              ※認識名の指定順は例です。
 * 
 *            さらに斜め移動歩行グラフィックを使用する場合は、
 *            斜め差分を以下のように用意します。
 *              [待機中/斜め移動用]   Actor1_frames9_fSpeed40_dDir_stand_swim_rs5.png
 *              [待機中/非斜め移動用] Actor1_frames10_fSpeed80_stand_swim_rs5.png
 *              [歩き中/斜め移動中]   Actor1_frames4_fSpeed10_dDir_walk_swim_rs5.png
 *              [歩き中/非斜め移動中] Actor1_frames5_fSpeed40_walk_swim_rs5.png
 *              [走り中/斜め移動中]   Actor1_frames2_fSpeed70_dDir_run_swim_rs5.png
 *              [走り中/非斜め移動中] Actor1_frames8_fSpeed40_run_swim_rs5.png
 *            リージョンID:1 に接触した際に
 *            必要な歩行グラフィックは以下のように用意します。
 *              [待機中/斜め移動用]   Actor1_frames4_fSpeed40_dDir_stand_swim_rs5.png
 *              [待機中/非斜め移動用] Actor1_frames7_fSpeed30_stand_swim_rs5.png
 *              [歩き中/斜め移動中]   Actor1_frames5_fSpeed40_dDir_walk_swim_rs5.png
 *              [歩き中/非斜め移動中] Actor1_frames4_fSpeed10_walk_swim_rs5.png
 *              [走り中/斜め移動中]   Actor1_frames5_fSpeed40_dDir_run_swim_rs5.png
 *              [走り中/非斜め移動中] Actor1_frames6_fSpeed80_run_swim_rs5.png
 *              ※認識名の指定順は例です。
 * 
 * -----------------------------------------------------------------------------
 *                  別途プラグイン「エロゲ制作キットMV」導入時
 * -----------------------------------------------------------------------------
 * 
 * 【認識名:HP / 衣装耐久値 / 衣装脱ぎ値差分 _hp〇 _dHp〇 _wHp〇】
 *     ※別途プラグイン「エロゲ制作キットMV」導入時に限り、使用できます。
 *       導入しない場合は、仕様書の説明終りです。
 *       必要差分例の方まで飛ばしてください。
 * 
 *       またこの説明は、別途プラグイン「エロゲ制作キットMV」を
 *       必要とする機能なので、他の認識名を使用しない場合で説明します。
 * 
 *     ・HP認識名 _hp + Hp割合
 *       Hp割合は、エロゲ制作キットMV側の HP割合判定設定 を使用します。
 *       例: _hp100 _hp50 _hp25 _hp0
 * 
 *     ・装備耐久値認識名 _dHp + 耐久値割合
 *       耐久値割合は、エロゲ制作キットMV側の 衣装耐久値割合判定設定 を使用します。
 *       ※エロゲ制作キットMV側で下着機能を使用している場合は、
 *         衣装を着ていなければ、下着耐久値割合判定設定 を元に判定されます。
 *       例: _dHp100 _dHp50 _dHp25 _dHp0
 * 
 *     ・装備脱ぎ認識名 _wHp + 脱ぎ割合
 *       脱ぎ割合は、エロゲ制作キットMV側の 衣装脱ぎ割合判定設定 を使用します。
 *       ※エロゲ制作キットMV側で下着機能を使用している場合は、
 *         衣装を着ていなければ、下着脱ぎ割合判定設定 を元に判定されます。
 *       例: _wHp100 _wHp50 _wHp25 _wHp0
 * 
 *     <<指定例>> Actor1_hp100_dHp100_wHp100
 *     
 *     ※また使用しないものは、省いて指定します。
 *     <<例>> 装備耐久値機能だけ使用しない場合
 *           Actor1_hp100_wHp100
 *     <<例>> 装備脱ぎ機能だけ使用しない場合
 *           Actor1_hp100_dHp100
 *     <<例>> HP判別機能だけ使用する場合
 *           Actor1_hp100
 *     <<例>> 装備耐久値機能だけ使用する場合
 *           Actor1_wHp100
 * 
 * -----------------------------------------------------------------------------
 * 
 * 【認識名:特殊ステート _sperm】
 *     ※別途プラグイン「エロゲ制作キットMV」導入時に限り、使用できます。
 * 
 *     ・精子ぶっかけ認識名 _sperm
 *       精子ぶっかけ機能は、エロゲ制作キットMV側の 精子レイヤー設定 が有効、
 *       且つ、精子レイヤー設定の精子ステートが 付与された時に使用します。
 * 
 *  上記の各認識名を使用した例がこちらになります。
 *  例: Actor1_frames6_fSpeed50_hp100_dHp100_wHp100_dDir_stand_swim_rs5_sperm.png
 *  ※認識名の指定順は例です。
 * 
 * -----------------------------------------------------------------------------
 *                                 必要差分例
 * -----------------------------------------------------------------------------
 * 
 *  各必要差分は、以下の例を参考にしてください。
 * 
 *  [例:1] 
 *   ・ベース設定の アニメ数がデフォルト・アニメ再生速度を 30 にした場合
 *   ・待機/歩く/走る機能を使用する
 *   ・斜め移動を使用する
 *   ・キャラクター操作していない
 *   ・斜め移動ではない
 *   ・リージョンによる歩行グラ機能にて指定されているリージョンに接触していない
 *   ・ステート認識リストにて指定されたステートにかかっていない
 *     Actor1_fSpeed30_stand.png
 * 
 *  [例:2] 
 *   ・ベース設定の アニメ数を 6 ・アニメ再生速度を 30 にした場合
 *   ・待機/歩く/走る機能を使用する
 *   ・斜め移動を使用する
 *   ・キャラクター操作していて、且つ、走り中
 *   ・斜め移動ではない
 *   ・リージョンによる歩行グラ機能にて指定されているリージョンに接触していない
 *   ・ステート認識リストにて指定されたステートにかかっていない
 *     Actor1_frames6_fSpeed30_run.png
 * 
 *  [例:3] 
 *   ・ベース設定の アニメ数を 6 ・アニメ再生速度を デフォルト にした場合
 *   ・待機/歩く/走る機能を使用しない
 *   ・斜め移動を使用する
 *   ・キャラクター操作していて、且つ、歩き中
 *   ・斜め移動ではない
 *   ・リージョンによる歩行グラ機能にて指定されているリージョンに接触している
 *   ・ステート認識リストにて指定されたステートにかかっていない
 *     Actor1_frames6_swim.png
 * 
 *  [例:4] 
 *   ・ベース設定の アニメ数を 6 ・アニメ再生速度を デフォルト にした場合
 *   ・待機/歩く/走る機能を使用する
 *   ・斜め移動を使用する
 *   ・キャラクター操作していて、且つ、歩き中
 *   ・斜め移動ではない
 *   ・リージョンによる歩行グラ機能にて指定されているリージョンに接触していない
 *   ・ステート認識リストにて指定されたステートにかかっている
 *     Actor1_frames6_walk_rs5.png
 * 
 *  [例:5] 
 *   ・ベース設定の アニメ数を 6 ・アニメ再生速度を デフォルト にした場合
 *   ・待機/歩く/走る機能を使用する
 *   ・斜め移動を使用する
 *   ・キャラクター操作していて、且つ、走り中
 *   ・斜め移動である
 *   ・リージョンによる歩行グラ機能にて指定されているリージョンに接触している
 *   ・ステート認識リストにて指定されたステートにかかっている
 *     Actor1_frames6_dDir_run_swim_rs5.png
 * 
 *   上記の例を元に残りの歩行グラフィックを用意してください。
 *   それでは上記の仕組みを元に歩行グラフィックの設定方法にて、
 *   実際に設定してください。
 * 
 * 
 * =============================================================================
 * 
 * =============================================================================
 *                                 設定方法
 * =============================================================================
 * 
 * 【歩行グラフィックの設定方法】
 * 
 *   ① 下記スクリプト「ベース歩行グラフィックの設定 アクターメモ欄」を行います。
 *     ※この設定は必ず、行ってください。
 * 
 *    【例:1】アクターID:1 のメモ欄に <acg base: Actor1, 2> と、
 *            記入した場合、歩行グラフィック名「Actor1.png」の
 *            index番号:2 が、ベースとして設定されます。
 * 
 *    【例:2】歩行グラフィック画像名の先頭に $ をつける場合は、
 *            indexを 0 で指定してください。
 *            アクターID:1 のメモ欄に <acg base: $Actor1, 0> と、
 *            記入した場合、歩行グラフィック名「$Actor1.png」が、
 *            ベースとして設定されます。
 *          
 *          ※このベースに指定された名前を元に各認識名を判別します。
 *            ですので、歩行グラフィック上で認識名を指定していても、
 *            ベースの部分のみを指定してください。
 * 
 *           【例:1】$Actor1_frames6_fSpeed120.png の場合、
 *                  「_frames6_fSpeed120」この箇所は、
 *                   仕様書で説明させていただいた認識名に
 *                   当たりますので、この場合のベースは、
 *                   $Actor1 になります。
 * 
 *     ※なにも記入されていない場合は、データベースで設定している
 *       歩行グラフィックがベースとして設定されますが、
 *       この場合、ベースとして扱う認識名抜きの
 *       ダミー歩行グラフィック画像が余分に必要です。
 * 
 *     ※装備機能を使用する場合は、
 *       この設定が素体歩行グラフィックとしての設定になります。
 * 
 *   ② このベース歩行グラフィックに上記でご説明しました
 *     使用する予定の認識名の状況に応じて歩行グラフィックが
 *     切り替えられますので各種歩行グラフィックをご用意してください。
 * 
 *   ③ 装備機能を使用する場合は、
 *     下記スクリプト「装備グラフィックの設定 武器/防具メモ欄」を行います。
 *     設定されていない装備品は装備時歩行グラフィックに変更されません。
 *     また本プラグインパラメータの基本設定 > 装備レイヤー順にて
 *     指定されていない装備タイプは判別対象外になります。
 * 
 *    【例:1】防具ID:3 のメモ欄に
 * 
 *         <acg characterList>
 *         1: Actor1
 *         2: Actor2
 *         </acg characterList>
 * 
 *         と記入した場合、防具ID:3 を アクターID:1 が装備したら、
 *         歩行グラフィック名「Actor1.png」の ベースindex番号が
 *         装備中に装備レイヤー順を元に表示され、
 *         防具ID:3 を アクターID:2 が装備したら、
 *         歩行グラフィック名「Actor2.png」の ベースindex番号が
 *         装備中に装備レイヤー順を元に表示されます。
 * 
 * =============================================================================
 * 
 *  仕様 [イベントの歩行グラフィック] 編
 * 
 * =============================================================================
 * 
 * 【歩行グラフィックの設定方法】
 *   ※アクターとは異なり、アニメ拡張機能と下記スクリプトコマンド
 *    「[イベント用]ベース待機/歩く/走るモードの設定 イベントのメモ欄」
 *     または、「イベント歩行グラフィックの永久変更」にて、
 *     待機/歩く/走るモードのみ使用することが可能です。
 *   ※デフォルト設定での説明になります。
 * 
 *     ・アニメ拡張認識名 _frames + アニメ数 
 *       ※未指定でシステムデフォルトの 3 を採用します。
 * 
 *     ・アニメ再生速度認識名 _fSpeed + 再生速度
 *       ※未指定でシステムデフォルトの 60 を採用します。
 * 
 *    【指定方法】〇〇_アニメ拡張認識名_アニメ再生速度認識名
 *     <<例>> 〇〇_frames6_fSpeed50.png
 *     ※認識名の順番はどちらが先でも構いません。
 * 
 * =============================================================================
 * 
 * =============================================================================
 * 
 *  スクリプトコマンド - メモ欄設定 -
 * 
 * =============================================================================
 * 
 *  ●[アクター]ベース歩行グラフィックの設定 アクターメモ欄
 *   <acg base: charaName, charaIndex>
 *   charaName  : ベース歩行グラフィック画像名
 *   charaIndex : インディックス番号
 *                ※歩行グラフィック画像名の頭に $ を
 *                  つけている大型歩行グラフィックの場合は、
 *                  0 と指定してください。
 * 
 *   ベースの歩行グラフィックとして設定されます。
 *   このベース歩行グラフィック名を元に各認識名検索します。
 * 
 *   [ベースとは]
 *    歩行グラフィック上で $Actor1_frames6_fSpeed120.png を
 *    設定したい場合、「_frames6_fSpeed120」この箇所は、
 *    仕様書で説明させていただいた認識名に当たりますので、
 *    この場合のベースは $Actor1 になります。
 * 
 *    この $Actor1 以降の認識名は、
 *    本プラグインから自動参照されます。
 * 
 *   ※装備機能を使用する場合は、
 *     この設定が素体歩行グラフィックとしての設定になります。
 * 
 *  【例:1】アクターID:1 のメモ欄に
 *          <acg base: Actor1, 3>
 *          と指定するとベース歩行グラフィックとして、
 *          歩行グラフィック画像「Actor1」の
 *          インディックス3番が設定されます。
 * 
 *  【例:2】アクターID:1 のメモ欄に
 *          <acg base: Actor1, 5>
 *          と指定するとベース歩行グラフィックとして、
 *          歩行グラフィック画像「Actor1」の
 *          インディックス5番が設定されます。
 * 
 *  【例:3】アクターID:1 のメモ欄に
 *          <acg base: $Actor1, 0>
 *          と指定するとベース歩行グラフィックとして、
 *          歩行グラフィック画像「$Actor1」にし、
 *          インディックスは 0 を指定します。
 * 
 * -----------------------------------------------------------------------------
 * 
 *  ●[武器/防具]装備グラフィックの設定 武器/防具メモ欄
 *   <acg characterList>
 *   actorId: charaName
 *   actorId: charaName
 *   actorId: charaName
 *   </acg characterList>
 *   actorId    : 装備対象アクターID
 *   charaName  : 装備時歩行グラフィック画像名
 * 
 *   ※装備時インディックス番号は、
 *     ベースのインデックス番号を引き続きます。
 * 
 *  【例:1】対象の 防具ID:3 のメモ欄に
 * 
 *         <acg characterList>
 *         1: Actor1
 *         2: Actor2
 *         </acg characterList>
 * 
 *         と記入した場合、防具ID:3 を アクターID:1 が装備したら、
 *         歩行グラフィック名「Actor1.png」の ベースのインデックス番号 が
 *         装備中に装備レイヤー順を元に表示されます。
 * 
 *         防具ID:3 を アクターID:2 が装備したら、
 *         歩行グラフィック名「Actor2.png」の ベースのインデックス番号 が
 *         装備中に装備レイヤー順を元に表示されます。
 * 
 * -----------------------------------------------------------------------------
 * 
 *  ●[アクター]個別歩行グラフィックの設定 アクターメモ欄
 *   <acg actorSet: wrg, dDir, eq, state>
 *   wrg   : true:待機/歩く/走る機能を使用する / false:待機/歩く/走る機能を使用しない
 *   dDir  : true:斜め方向グラ機能を使用する / false:斜め方向グラ機能を使用しない
 *   eq    : true:装備機能を使用する / false:装備機能を使用しない
 *   state : true:ステート機能を使用する / false:ステート機能を使用しない
 * 
 *  【例:1】アクターID:1 のメモ欄に
 *          <acg actorSet: false, false, false, true>
 *          と指定すると、
 *          ・待機/歩く/走る機能を使用しない
 *          ・斜め方向グラ機能を使用しない
 *          ・装備機能を使用しない
 *          ・ステート機能を使用する
 *          にアクターID:1 のみ変更されます。
 * 
 *  ※未指定でプラグインパラメータの設定が採用されます。
 * 
 * -----------------------------------------------------------------------------
 * 
 *  ●[アクター]個別エロゲ制作キットMV歩行グラフィックの設定 アクターメモ欄
 *   <acg actorErpgSet: hp, dHp, wHp, sperm>
 *   hp    : true:HP判別機能を使用する / false:HP判別機能を使用しない
 *   dHp   : true:装備耐久値機能を使用する / false:装備耐久値機能を使用しない
 *   wHp   : true:装備脱ぎ機能を使用する / false:装備脱ぎ機能を使用しない
 *   sperm : true:精子ぶっかけ機能を使用する / false:精子ぶっかけ機能を使用しない
 * 
 *  【例:1】アクターID:1 のメモ欄に
 *          <acg actorErpgSet: false, false, false, true>
 *          と指定すると、
 *          ・HP判別機能を使用しない
 *          ・装備耐久値機能を使用しない
 *          ・装備脱ぎ機能を使用しない
 *          ・精子ぶっかけ機能を使用する
 *          にアクターID:1 のみ変更されます。
 * 
 *  ※未指定でプラグインパラメータの設定が採用されます。
 *  ※別途プラグイン「エロゲ制作キットMV」導入時に限り、使用可能です。
 * 
 * -----------------------------------------------------------------------------
 * 
 *  ●[アクター]吹き出しの高さ調整 アクターメモ欄
 *   <acg balloonHeight: height>
 *   height : 吹き出しの高さを指定します。
 *            デフォルトでは、1.0 が指定されています。
 *            計算式は、歩行グラの1コマの高さ x height に
 *            なります。
 * 
 *  【例:1】アクターID:1 のメモ欄に
 *          <acg balloonHeight: 1.2>
 *          と指定すると標準の高さから、
 *          1.2 倍掛けますので少し位置が高くなります。
 * 
 *  【例:2】アクターID:1 のメモ欄に
 *          <acg balloonHeight: 0.1>
 *          と指定すると標準の高さから、
 *          0.1 倍掛けますのでほぼ足元の位置まで低くなります。
 * 
 *  ※未指定でツクールのデフォルト設定が採用されます。
 * 
 * -----------------------------------------------------------------------------
 * 
 *  ●[アクター]個別ステート認識リストの設定 アクターメモ欄
 *   <acg stateList>
 *   state: stateId
 *   state: stateId
 *   state: stateId
 *   no state
 *   </acg stateList>
 *   stateId : 認識させるステートID
 * 
 *  【例:1】アクターID:1 のメモ欄に
 * 
 *         <acg stateList>
 *         state: 5
 *         state: 6
 *         </acg stateList>
 * 
 *         と記入した場合、アクターID:1 の認識ステートリストが、
 *         プラグインパラメータの設定を使用せず、
 *         ステートID:5 と ステートID:6 のみを認識するようになります。
 *         
 *         また アクターID:1 だけ認識ステートリスト情報を削除したい場合、
 * 
 *         <acg stateList>
 *         no state
 *         </acg stateList>
 * 
 *         no state と記入することで、強制的に認識ステートリストを削除し、
 *         アクターID:1 はステートが付与されても一つも認識しなくなります。
 * 
 * -----------------------------------------------------------------------------
 * 
 *  ●[イベント用]ベース待機/歩く/走るモードの設定 イベントのメモ欄
 *   <acg wrg: charaName, charaIndex>
 *   charaName  : 歩行グラフィック画像名
 *   charaIndex : インディックス番号
 *                ※歩行グラフィック画像名の頭に $ を
 *                  つけている大型歩行グラフィックの場合は、
 *                  0 と指定してください。
 * 
 *   イベント用に認識名を除いたベース歩行グラフィック名を指定してください。
 * 
 *   この設定がされているイベントは、
 *   下記スクリプトコマンド「イベント移動ルート専用」のコマンドが
 *   使用可能になります。
 * 
 *   また待機/歩く/走るモードを使用しない場合、イベントの歩行グラフィックに、
 *   Actor1_frames6.png と指定するとアニメ数や再生速度も調整可能です。
 * 
 *  【例:1】イベントID:1 のメモ欄に
 *          <acg wrg: Actor1, 3>
 *          と指定するとベース歩行グラフィックとして、
 *          歩行グラフィック画像「Actor1」のインディックス3番が設定され、
 *          アニメ数・アニメ再生速度ともにツクールのデフォルトを採用し、
 *          以下の差分を状況に応じて切替えます。
 *            [イベント待機中] Actor1_stand.png
 *            [イベント歩きモード中] Actor1_walk.png
 *            [イベント走りモード中] Actor1_run.png
 *          ※歩き/走りモード切替えは、専用コマンドを使用します。
 * 
 * =============================================================================
 * 
 * =============================================================================
 * 
 *  スクリプトコマンド - ユーティリティ系 -
 * 
 * =============================================================================
 * 
 *  ●ベース歩行グラフィックの変更
 *   Ayatam.ACG.changeActorCharacter(actorId,charaName,charaIndex)
 *   actorId    : 変更対象のアクターID
 *   charaName  : 歩行グラフィック画像名を ""(ダブルクォート)で囲んで指定します。
 *   charaIndex : インディックス番号
 *                ※歩行グラフィック画像名の頭に $ を
 *                  つけている大型歩行グラフィックの場合は、
 *                  0 と指定してください。
 * 
 *  【例:1】アクターID:1 のベース歩行グラフィックを Actor2 で、
 *         インディックスを 3 に変更する場合
 *         Ayatam.ACG.changeActorCharacter(1,"Actor1",3)
 * 
 *  【例:2】アクターID:1 のベース歩行グラフィックを $Actor1 に変更する場合
 *          インデックスは 0 を指定します。
 *         Ayatam.ACG.changeActorCharacter(1,"$Actor1",0)
 * 
 * -----------------------------------------------------------------------------
 * 
 *  ●装備歩行グラフィックの変更
 *   Ayatam.ACG.changeEquipCharacter(equipType,equipId,actorId,charaName)
 *   equipType  : true: 武器 / false: 防具
 *   equipId    : equipTypeを元に変更対象の武器Id/防具Idを
 *   actorId    : この アクターID が装備したら
 *   charaName  : 歩行グラフィック画像名を ""(ダブルクォート)で囲んで指定します。
 *   charaIndex : インディックス番号は、
 *                ベースのインデックス番号を引き続きます。
 * 
 *  【例:1】防具ID:3 を アクターID:1 が装備したら、装備歩行グラフィックを
 *         Actor4 に変更する場合
 *         Ayatam.ACG.changeEquipCharacter(false,3,1,"Actor4")
 * 
 *  【例:2】武器ID:1 を アクターID:1 が装備したら、装備歩行グラフィックを
 *         Actor4 でインディックスを 2 に変更する場合
 *         Ayatam.ACG.changeEquipCharacter(true,1,1,"Actor4")
 * 
 * -----------------------------------------------------------------------------
 * 
 *  ●歩行グラフィック認識名にオプションの追加
 *   Ayatam.ACG.addOptionTag(actorId,optionName,auto)
 *   actorId    : オプション認識名を追加したいアクターId。
 *   optionName : 現在の歩行グラフィック状態に追加したい認識名を指定。
 *   auto       : 基本設定 > 歩行グラフィックの詳細設定 > アニメ1回再生認識名
 *                が含まれているオプションを指定した際、1回再生終了時に
 *                true: 自動でオプションの削除 / false: そのまま
 * 
 *  【例:1】アクターID:1 の現在の状態に "_preBattle" という認識名を追加する場合
 *          オプション名に アニメ1回再生 _fOnce が次のように含まれる場合
 *          Actor1_fOnce_preBattle.png 1回再生終了後に元の歩行グラフィックに戻ります。
 *         Ayatam.ACG.addOptionTag(1,"_preBattle")
 * 
 *  【例:2】アクターID:2 の現在の状態に "_victoryPose" という認識名を追加する場合
 *          オプション名に アニメ1回再生 _fOnce が次のように含まれない場合
 *          Actor1_victoryPose.png 自動戻り機能は終了を判別しませんので、
 *          手動でオプション削除されるまで、永続します。
 *         Ayatam.ACG.addOptionTag(2,"_victoryPose",false)
 * 
 * -----------------------------------------------------------------------------
 * 
 *  ●歩行グラフィック認識名にオプションリストの追加
 *   Ayatam.ACG.addOptionTagLists(actorId,optionLists)
 *   actorId     : オプション認識名リストを追加したいアクターId。
 *   optionLists : 現在の歩行グラフィック状態に追加したい認識名をリスト順に
 *                 指定することで、
 *                 基本設定 > 歩行グラフィックの詳細設定 > アニメ1回再生認識名が
 *                 含まれているオプション _fOnce が指定されていれば、
 *                 1回再生終了時に自動でリストの次のオプション認識名に切り替えます。
 *                 途中または終りに、_fOnce が含まれていないオプションに切り替わると、
 *                 自動切り替えは終了し、手動でオプション削除されるまで永続します。
 * 
 *  【例:1】アクターID:1 の現在の状態に 再生順番を "_preBattle" → "_battleMode"
 *          の順に歩行グラフィックを切り替えると仮定し、_preBattle には
 *          アニメ1回再生 _fOnce が含まれ、_battleMode には含まれていない設定
 *          Actor1_fOnce_preBattle.png 1回再生終了後に _battleMode へ切り替わり、
 *          手動でオプション削除されるまで永続します。
 *         Ayatam.ACG.addOptionTagLists(1,["_preBattle","_battleMode"])
 * 
 * -----------------------------------------------------------------------------
 * 
 *  ●歩行グラフィック認識名のオプション削除
 *   Ayatam.ACG.resetOptionTag(actorId)
 *   actorId    : オプション認識名を削除したいアクターId。
 * 
 *  【例:1】アクターID:1 オプション認識名を削除する場合
 *         Ayatam.ACG.resetOptionTag(1)
 * 
 *  【例:2】アクターID:2 オプション認識名を追加する場合
 *         Ayatam.ACG.resetOptionTag(2)
 * 
 * -----------------------------------------------------------------------------
 * 
 *  ●歩行グラフィック1回再生済みか？
 *   Ayatam.ACG.isPlayOnceFinished(actorId)
 *   actorId    : 1回再生済みかを確認するアクターId。
 * 
 *  【例:1】アクターID:1 は1回再生済みか
 *         Ayatam.ACG.isPlayOnceFinished(1)
 * 
 *  【例:2】アクターID:2 は1回再生済みか
 *         Ayatam.ACG.isPlayOnceFinished(2)
 * 
 *   ※イベントコマンド・フロー制御「条件分岐」のスクリプトコマンドで使用します。
 * 
 * -----------------------------------------------------------------------------
 * 
 *  ●イベント時フォロワーの移動操作
 *   Ayatam.ACG.followerDestination(followerId,mapX,mapY,newDir,run)
 *   followerId : 位置移動させたいフォロワーId。
 *                並び順がIdになっており、0 は、プレイヤー
 *                1 以降から並び順のアクターたちになります。
 *   mapX       : 移動させたいマップ上のx座標。
 *   mapY       : 移動させたいマップ上のy座標。
 *   newDir     : 移動終了後の向きを指定。
 *                0: 移動後の方向を維持
 *                2: 下向き
 *                4: 左向き
 *                6: 右向き
 *                8: 上向き
 *   run        : true: 走るモードでの移動 / false: 歩きモードでの移動
 * 
 *  【例:1】フォロワーId:1番を マップ上の x:9 y:10 に歩きで移動させ、
 *          移動終了後に下向きにする場合
 *         Ayatam.ACG.followerDestination(1,9,10,2,false)
 * 
 *  【例:2】フォロワーId:2番を マップ上の x:6 y:12 に走りで移動させ、
 *          移動終了後に上向きにする場合
 *         Ayatam.ACG.followerDestination(2,6,12,8,true)
 * 
 *  【例:3】プレイヤーを マップ上の x:6 y:12 に走りで移動させ、
 *          移動終了後に上向きにする場合
 *         Ayatam.ACG.followerDestination(0,6,12,8,true)
 * 
 *   ※イベントコマンド・上級「スクリプト」のスクリプトコマンドで使用します。
 * 
 * -----------------------------------------------------------------------------
 * 
 *  ●イベント時イベントの移動操作
 *   Ayatam.ACG.EventDestination(eventId,mapX,mapY,newDir,run)
 *   eventId    : 位置移動させたいイベントId。
 *   mapX       : 移動させたいマップ上のx座標。
 *   mapY       : 移動させたいマップ上のy座標。
 *   newDir     : 移動終了後の向きを指定。
 *                0: 移動後の方向を維持
 *                2: 下向き
 *                4: 左向き
 *                6: 右向き
 *                8: 上向き
 *   run        : true: 走るモードでの移動 / false: 歩きモードでの移動
 * 
 *   ※イベントの移動操作に関しては、特別な仕様を設けており、
 *     このスクリプトコマンドを使用した直後に、
 *     移動ルートの設定にて、ウェイトを指定すると
 *     対象のイベントが指定マップ座標に移動完了するまで、
 *     待つことができ、
 * 
 *     移動ルートの設定を使用せず、直接ウェイトを指定すると
 *     対象イベントが移動開始してからのウェイトになります。
 *     
 *     これにより、遠くへイベントを移動させたい際、
 *     プレイヤーにイベントについていくというイベントを
 *     作成することが可能になります。
 * 
 *  【例:1】イベントId:1番を マップ上の x:9 y:10 に歩きで移動させ、
 *          移動終了後に下向きにする場合
 *         Ayatam.ACG.EventDestination(1,9,10,2,false)
 * 
 *  【例:2】イベントId:2番を マップ上の x:6 y:12 に走りで移動させ、
 *          移動終了後に上向きにする場合
 *         Ayatam.ACG.EventDestination(2,6,12,8,true)
 * 
 *  【例:3】イベントId:3番を マップ上の x:6 y:12 に走りで移動させ、
 *          移動終了後に上向きにする場合
 *         Ayatam.ACG.EventDestination(3,6,12,8,true)
 * 
 *   ※イベントコマンド・上級「スクリプト」のスクリプトコマンドで使用します。
 * 
 * =============================================================================
 * 
 * =============================================================================
 * 
 *  スクリプトコマンド - イベント移動ルート専用 -
 * 
 * =============================================================================
 * 
 *  ●イベント歩行グラフィック認識名にオプションの追加
 *   this.setAcgOptionTag(optionName,auto)
 *   optionName : 現在の歩行グラフィック状態に追加したい認識名を指定。
 *   auto       : 基本設定 > 歩行グラフィックの詳細設定 > アニメ1回再生認識名
 *                が含まれているオプションを指定した際、1回再生終了時に
 *                true: 自動でオプションの削除 / false: そのまま
 * 
 *   ※待機/歩く/走る歩行グラフィック使用時、且つ、
 *     プレイヤー移動限定ですが、上記スクリプトコマンド
 *    「[イベント用]ベース待機/歩く/走るモードの設定 イベントのメモ欄」
 *     または、下記「[イベント]歩行グラフィックの永久変更」にて、
 *     待機/歩く/走るモードが有効化されているイベントに限り有効になります。
 * 
 *  【例:1】イベント移動ルートのスクリプトにて、
 *          現在の状態に "_preBattle" という認識名を追加する場合
 *          オプション名に アニメ1回再生 _fOnce が次のように含まれる場合
 *          Actor1_fOnce_preBattle.png 1回再生終了後に元の歩行グラフィックに戻ります。
 *          this.setAcgOptionTag("_preBattle")
 * 
 *  【例:2】イベント移動ルートのスクリプトにて、
 *          現在の状態に "_victoryPose" という認識名を追加する場合
 *          オプション名に アニメ1回再生 _fOnce が次のように含まれない場合
 *          Actor1_victoryPose.png 自動戻り機能は終了を判別しませんので、
 *          手動でオプション削除されるまで、永続します。
 *          this.setAcgOptionTag("_victoryPose",false)
 * 
 *   この設定は、イベント移動ルート終了後の
 *   新たに起動するイベント移動ルートにも引き継がれます。
 * 
 * -----------------------------------------------------------------------------
 * 
 *  ●イベント歩行グラフィック認識名にオプションリストの追加
 *   this.setAcgOptionTagLists(optionLists)
 *   optionLists : 現在の歩行グラフィック状態に追加したい認識名をリスト順に
 *                 指定することで、
 *                 基本設定 > 歩行グラフィックの詳細設定 > アニメ1回再生認識名
 *                 _fOnce が指定されていれば、
 *                 1回再生終了時に自動でリストの次のオプション認識名に切り替えます。
 *                 途中または終りに、_fOnce が含まれていないオプションに切り替わると、
 *                 自動切り替えは終了し、手動でオプション削除されるまで永続します。
 * 
 *   ※待機/歩く/走る歩行グラフィック使用時、且つ、
 *     プレイヤー移動限定ですが、上記スクリプトコマンド
 *    「[イベント用]ベース待機/歩く/走るモードの設定 イベントのメモ欄」
 *     または、下記「[イベント]歩行グラフィックの永久変更」にて、
 *     待機/歩く/走るモードが有効化されているイベントに限り有効になります。
 * 
 *  【例:1】イベント移動ルートのスクリプトにて、
 *          現在の状態に 再生順番を "_preBattle" → "_battleMode"
 *          の順に歩行グラフィックを切り替えると仮定し、_preBattle には
 *          アニメ1回再生 _fOnce が含まれ、_battleMode には含まれていない設定
 *          Actor1_fOnce_preBattle.png 1回再生終了後に _battleMode へ切り替わり、
 *          手動でオプション削除されるまで永続します。
 *          this.setAcgOptionTagLists(["_preBattle","_battleMode"])
 * 
 *   この設定は、イベント移動ルート終了後の
 *   新たに起動するイベント移動ルートにも引き継がれます。
 * 
 * -----------------------------------------------------------------------------
 * 
 *  ●イベント歩行グラフィック認識名のオプション削除
 *   this.resetAcgOptionTag()
 * 
 *   ※待機/歩く/走る歩行グラフィック使用時、且つ、
 *     プレイヤー移動限定ですが、上記スクリプトコマンド
 *    「[イベント用]ベース待機/歩く/走るモードの設定 イベントのメモ欄」
 *     または、下記「[イベント]歩行グラフィックの永久変更」にて、
 *     待機/歩く/走るモードが有効化されているイベントに限り有効になります。
 * 
 *  【例:1】イベント移動ルートのスクリプトにて、
 *          現在適応中のオプション認識名を削除する。
 *          this.resetAcgOptionTag()
 * 
 *   この設定は、イベント移動ルート終了後の
 *   新たに起動するイベント移動ルートにも引き継がれます。
 * 
 * -----------------------------------------------------------------------------
 * 
 *  ●イベント移動ルート時の走る/歩くグラフィック変更
 *   this.acgRun(mode)
 *   mode  : true:走るモード / false:歩くモード
 * 
 *   ※待機/歩く/走る歩行グラフィック使用時、且つ、
 *     プレイヤー移動限定ですが、上記スクリプトコマンド
 *    「[イベント用]ベース待機/歩く/走るモードの設定 イベントのメモ欄」
 *     または、下記「[イベント]歩行グラフィックの永久変更」にて、
 *     待機/歩く/走るモードが有効化されているイベントも
 *     同じように this.acgRun(mode) で切り替え可能。
 * 
 *  【例:1】イベント移動ルートのスクリプトにて、
 *          走るモードに切り替える場合
 *          this.acgRun(true)
 * 
 *  【例:2】イベント移動ルートのスクリプトにて、
 *          歩くモードに切り替える場合
 *          this.acgRun(false)
 * 
 *   この設定は、イベント移動ルート終了後の
 *   新たに起動するイベント移動ルートにも引き継がれます。
 * 
 * -----------------------------------------------------------------------------
 * 
 *  ●[アクター]歩行グラをイベント中一時的に変更する
 *   this.acgChangeCharacter(actorId,charaName,charaIndex,keep)
 *   actorId    : 変更する対象アクターID
 *   charaName  : 歩行グラフィック画像名 を
 *                ""(ダブルクォート)で囲んで指定します。
 *   charaIndex : 歩行インディックス番号
 *                ※歩行グラフィック画像名の頭に $ を
 *                  つけている大型歩行グラフィックの場合は、
 *                  0 と指定してください。
 *   keep       : プラグイン自動差分機能を使用するか使用しないかを指定
 *                true  : ベース歩行グラフィックとして一時設定します。
 *                false : 指定歩行グラフィックのままを扱います。
 * 
 *  【例:1】イベント移動ルートのスクリプトにて
 *          一時変更対象を アクターID:1 で、歩行グラフィックを
 *          Actor1.png で インディックス番号を 1 に変更し、
 *          待機/歩く/走るなどの自動差分を使用する
 *          this.acgChangeCharacter(1,"Actor1",1,true)
 * 
 *  【例:2】イベント移動ルートのスクリプトにて
 *          一時変更対象を アクターID:2 で、歩行グラフィックを
 *          Actor1.png で インディックス番号を 3 に変更し、
 *          待機/歩く/走るなどの自動差分を使用しない
 *          this.acgChangeCharacter(2,"Actor1",3,true)
 * 
 *  【仕様】この設定は、イベント移動ルート終了後の、
 *   イベントそのものを抜けるまで維持され、イベントを抜けると解除されます。
 *   そのまま下記「イベント中一時歩行グラフィックのリセット」を使用するまで、
 *   再度イベントのイベント移動ルートが起動されると維持された設定に変更されます。
 *   なので任意のタイミングでリセットをしてください。
 * 
 *  ●アクター歩行グラのイベント中一時変更情報のリセット
 *   this.acgResetCharacter(actorId)
 *   actorId    : 一時歩行グラフィックをリセットする対象アクターID
 * 
 *  【例:1】イベント移動ルートのスクリプトにて
 *          アクターID:2 の一時変更歩行グラフィックをリセットする
 *          this.acgResetCharacter(2)
 * 
 * -----------------------------------------------------------------------------
 * 
 *  ●[イベント]歩行グラフィックの永久変更
 *   this.acgChangeEventCharacter(charaName,charaIndex,enable)
 *   charaName  : 歩行グラフィック画像名 を
 *                ""(ダブルクォート)で囲んで指定します。
 *   charaIndex : 歩行インディックス番号
 *                ※歩行グラフィック画像名の頭に $ を
 *                  つけている大型歩行グラフィックの場合は、
 *                  0 と指定してください。
 *   enable     : 対象イベントの待機/歩く/走るモード機能を
 *                true  : 有効化
 *                false : 無効化
 * 
 *  【例:1】イベント移動ルートのスクリプトにて
 *          指定イベントの歩行グラフィックを
 *          Actor1.png で インディックス番号を 1 に変更し、
 *          待機/歩く/走るモード機能を有効化する
 *          this.acgChangeEventCharacter("Actor1",1,true)
 * 
 *  【例:2】イベント移動ルートのスクリプトにて
 *          指定イベントの歩行グラフィックを
 *          Actor1.png でインディックス番号を 3 に変更し、
 *          待機/歩く/走るモード機能を無効化する
 *          this.acgChangeEventCharacter("Actor1",3,false)
 * 
 * =============================================================================
 * 
 * @param GlobalSettings
 * @text 基本設定
 * @type struct<AcgGlobalSettings>
 * @default {"setup":"","useCharacterFunctions":"true","functionSw":"0","functionFollowers":"false","movableSetup":"","diagonalMovements":"false","pixelMovements":"false","pixelFollowerDistance":"2.0125","autoDashMode":"false","autoDashDuration":"60","chSettings":"","animationName":"_frames","animSpeedName":"_fSpeed","animPlayOnceName":"_fOnce","stepAnimeName":"_stepAnime","reverseAnimeName":"_revAnime","useDiagonal":"false","diagonalName":"_dDir","useWRG":"false","standName":"_stand","walkName":"_walk","runName":"_run","useEquip":"false","equipPriority":"[\"4\",\"3\",\"2\",\"1\",\"0\"]","useState":"false","stateName":"_rs","stateList":"[]","regionList":"[\"{\\\"regionId\\\":\\\"1\\\",\\\"regionName\\\":\\\"_swim\\\"}\"]","eroRpgSettings":"","useHp":"false","hpName":"_hp","useEquipDurability":"false","dHpName":"_dHp","useEquipWear":"false","wHpName":"_wHp","useSperm":"false","spermName":"_sperm"}
 * @desc 歩行グラフィック拡張機能の基本設定を行います。
 */

//=============================================================================
//  【AcgGlobalSettings】
//=============================================================================

/*~struct~AcgGlobalSettings:
 * @param setup
 * @text 歩行グラフィック機能
 * 
 * @param movableSetup
 * @text 移動機能
 * 
 * @param chSettings
 * @text 歩行グラフィックの詳細設定
 * 
 * @param eroRpgSettings
 * @text [要]エロゲ制作キットMV併用時の設定
 *
 * @param useCharacterFunctions
 * @text 拡張機能の有無
 * @parent setup
 * @type boolean
 * @on 有効
 * @off 無効
 * @default true
 * @desc 歩行グラフィック拡張機能を使用する/使用しないを指定します。全体の認識名検索機能のことになります。
 *
 * @param functionSw
 * @text 拡張機能スイッチ
 * @parent setup
 * @type switch
 * @default 0
 * @desc 拡張機能が有効時に指定スイッチで全体の歩行グラフィック拡張機能を切り替えます。なしの場合は、スイッチ操作を無効化します。
 *
 * @param functionFollowers
 * @text フォロワー拡張機能
 * @parent setup
 * @type boolean
 * @on 有効
 * @off 無効
 * @default false
 * @desc フォロワーに対しても歩行グラ拡張機能を適応するかを指定します。
 *
 * @param diagonalMovements
 * @text 8方向移動の有無
 * @parent movableSetup
 * @type boolean
 * @on 有効
 * @off 無効
 * @default false
 * @desc 8方向移動を使用するかを指定します。※他プラグインに8方向移動機能がある場合はどちらかを無効にしてください。
 *
 * @param pixelMovements
 * @text ピクセル移動の有無
 * @parent movableSetup
 * @type boolean
 * @on 有効
 * @off 無効
 * @default false
 * @desc 移動方式をピクセル単位へ変更。フォロワーにも自動適応。※他プラグインに同じ機能がある場合、どちらかを無効にしてください。
 *
 * @param pixelFollowerDistance
 * @text ピクセル移動時フォロワー追跡距離
 * @parent movableSetup
 * @type string
 * @default 2.0125
 * @desc ピクセル移動時。フォロワーの追跡距離度を指定。数値が大きいほど、間隔が開きます。最小値0.0。デフォルト:2.0125
 *
 * @param autoDashMode
 * @text 自動ダッシュモード
 * @parent movableSetup
 * @type boolean
 * @on 自動ダッシュ
 * @off デフォルト
 * @default false
 * @desc プレイヤー移動開始から指定時間で自動的にダッシュモードに切り替える機能。デフォルトのダッシュ操作で強制歩きを維持します。
 *
 * @param autoDashDuration
 * @text 自動ダッシュ開始時間
 * @parent movableSetup
 * @type number
 * @min 0
 * @default 60
 * @desc 自動ダッシュモード時。指定時間後に自動ダッシュへ切り替えます。
 *
 * @param animationName
 * @text アニメ拡張認識名
 * @parent chSettings
 * @type string
 * @default _frames
 * @desc 歩行グラ画像名に アニメ拡張認識名 + アニメ数 を追加すると対象歩行グラの再生アニメ数を変更します。例 _frames8
 *
 * @param animSpeedName
 * @text アニメ再生速度認識名
 * @parent chSettings
 * @type string
 * @default _fSpeed
 * @desc 歩行グラ画像名に アニメ再生速度認識名 + 速度 を追加すると対象歩行グラの再生速度を変更します。 未指定で 60 例 _fSpeed30
 *
 * @param animPlayOnceName
 * @text アニメ1回再生認識名
 * @parent chSettings
 * @type string
 * @default _fOnce
 * @desc 歩行グラ画像名に アニメ1回再生認識名 を追加すると対象歩行グラが自動的に一度だけ再生します。 未指定で 通常 例 _fOnce
 *
 * @param stepAnimeName
 * @text アニメループ再生認識名
 * @parent chSettings
 * @type string
 * @default _stepAnime
 * @desc 歩行グラ画像名に アニメループ再生認識名 を追加すると対象歩行グラが自動的にループ再生します。 未指定で 通常 例 _stepAnime
 *
 * @param reverseAnimeName
 * @text アニメ逆再生認識名
 * @parent chSettings
 * @type string
 * @default _revAnime
 * @desc 歩行グラ画像名に アニメ逆再生認識名 を追加すると対象歩行グラのアニメが逆再生します。 未指定で 通常 例 _revAnime
 *
 * @param charOffSetY
 * @text 歩行グラY中心位置認識名
 * @parent chSettings
 * @type string
 * @default _offSetY
 * @desc 歩行名に 歩行グラY中心位置認識名 + 調整値 を追加すると対象歩行の縦中心を上方向に調整します。 未指定で 通常 例 _offSetY70
 *
 * @param useDiagonal
 * @text 斜め方向グラ機能
 * @parent chSettings
 * @type boolean
 * @on 有効
 * @off 無効
 * @default false
 * @desc 斜め方向の歩行グラを使用するか指定します。基本設定 > 8方向移動と別にしていますので、他プラグインの8方向移動にも適応可
 *
 * @param diagonalName
 * @text 斜め方向中認識名
 * @parent chSettings
 * @type string
 * @default _dDir
 * @desc 歩行グラ画像名に 斜め方向中認識名 を追加すると斜めの歩行グラとして認識します。例 _dDir
 *
 * @param useWRG
 * @text 待機/歩く/走る機能
 * @parent chSettings
 * @type boolean
 * @on 使用する
 * @off 使用しない
 * @default false
 * @desc 待機/歩く/走るの歩行グラフィックを使用するか指定します。
 *
 * @param standName
 * @text 待機中認識名
 * @parent chSettings
 * @type string
 * @default _stand
 * @desc 歩行グラ画像名に 待機中認識名 を追加すると待機中の歩行グラとして認識します。例 _stand
 *
 * @param walkName
 * @text 歩き中認識名
 * @parent chSettings
 * @type string
 * @default _walk
 * @desc 歩行グラフィック画像名に 歩き中認識名 を追加すると非ダッシュ中の歩行グラとして認識します。例 _walk
 *
 * @param runName
 * @text 走り中認識名
 * @parent chSettings
 * @type string
 * @default _run
 * @desc 歩行グラフィック画像名に 走り中認識名 を追加するとダッシュ中の歩行グラとして認識します。例 _run
 *
 * @param useEquip
 * @text 装備機能
 * @parent chSettings
 * @type boolean
 * @on 使用する
 * @off 使用しない
 * @default false
 * @desc 装備レイヤーを使用するか指定します。対象装備のメモ欄に指定スクリプトを設定してください。
 *
 * @param equipPriority
 * @text 装備レイヤー順
 * @parent chSettings
 * @type number[]
 * @default ["4","3","2","1","0"]
 * @desc リストIDが大きいほど手前に重ねます。素体は必ず一番後ろに表示されます。※武器:0 盾:1 頭:2 身体:3 装飾品:4 データベース上の設定を採用します。
 *
 * @param useState
 * @text ステート機能
 * @parent chSettings
 * @type boolean
 * @on 使用する
 * @off 使用しない
 * @default false
 * @desc ステート付与時の歩行グラフィックを使用するか指定します。
 *
 * @param stateName
 * @text ステート認識名
 * @parent chSettings
 * @type string
 * @default _rs
 * @desc 歩行グラフィック画像名に ステート認識名 を追加するとステートの歩行グラとして認識します。例 _rs4
 *
 * @param stateList
 * @text ステート認識リスト
 * @parent chSettings
 * @type state[]
 * @default []
 * @desc 認識するステートIDを指定します。認識優先度はリスト順。※ここに指定されていないステートは認識しません。
 *
 * @param regionList
 * @text リージョンによる歩行グラ機能
 * @parent chSettings
 * @type struct<RegionCharacterName>[]
 * @default ["{\"regionId\":\"1\",\"regionName\":\"_swim\",\"regionAnime\":\"false\"}"]
 * @desc リージョンID毎に歩行グラの変更設定を作成します。リージョンIDは被らないように設定してください。使用しない場合、設定不要。
 *
 * @param useHp
 * @text HP判別機能
 * @parent eroRpgSettings
 * @type boolean
 * @on 使用する
 * @off 使用しない
 * @default false
 * @desc HP差分の歩行グラフィックを使用するか指定します。
 *
 * @param hpName
 * @text HP認識名
 * @parent eroRpgSettings
 * @type string
 * @default _hp
 * @desc 歩行グラフィック画像名に HP認識名 を追加するとHP差分の歩行グラとして認識します。例 _hp100 _hp50...etc
 *
 * @param useEquipDurability
 * @text 装備耐久値機能
 * @parent eroRpgSettings
 * @type boolean
 * @on 使用する
 * @off 使用しない
 * @default false
 * @desc 装備品の耐久値差分の歩行グラフィックを使用するか指定します。
 *
 * @param dHpName
 * @text 装備耐久値認識名
 * @parent eroRpgSettings
 * @type string
 * @default _dHp
 * @desc 歩行グラフィック画像名に 装備耐久値認識名 を追加すると装備耐久値差分の歩行グラとして認識します。例 _dHp100 _dHp50...etc
 *
 * @param useEquipWear
 * @text 装備脱ぎ機能
 * @parent eroRpgSettings
 * @type boolean
 * @on 使用する
 * @off 使用しない
 * @default false
 * @desc 装備品の脱ぎ差分の歩行グラフィックを使用するか指定します。
 *
 * @param wHpName
 * @text 装備脱ぎ認識名
 * @parent eroRpgSettings
 * @type string
 * @default _wHp
 * @desc 歩行グラフィック画像名に 装備脱ぎ認識名 を追加すると装備脱ぎ差分の歩行グラとして認識します。例 _wHp100 _wHp50...etc
 *
 * @param useSperm
 * @text 精子ぶっかけ機能
 * @parent eroRpgSettings
 * @type boolean
 * @on 使用する
 * @off 使用しない
 * @default false
 * @desc エロゲ制作キット側の精子レイヤー設定が有効、且つ、精子ステートが付与された時の歩行グラを使用するか指定します。
 *
 * @param spermName
 * @text 精子ぶっかけ認識名
 * @parent eroRpgSettings
 * @type string
 * @default _sperm
 * @desc 歩行グラフィック画像名に 精子ぶっかけ認識名 を追加すると精子ぶっかけ認識名の歩行グラとして認識します。例 _sperm
 */

/*~struct~RegionCharacterName:
 * @param regionId
 * @text リージョンID
 * @type number
 * @min 0
 * @default 0
 * @desc 歩行グラフィック変更対象リージョンIDを指定します。0で無効
 * 
 * @param regionName
 * @text 認識名
 * @type string
 * @default _regionName
 * @desc 歩行グラフィック画像名に 追加する認識名を指定します。この認識名が追加されている歩行グラ画像が紐づけされます。
 */

//=============================================================================
//
// - プラグイン本体 - ここから下は変更禁止 -
//
//=============================================================================

//=============================================================================
// プラグイン 初期化
//=============================================================================

//プラグイン名の登録
var AyatamAdvancedCharacterGraphicsName = document.currentScript.src.match(/^.*\/(.+)\.js$/)[1];

//プラグインパラメータを登録
Ayatam.ACG.Parameters = PluginManager.parameters(AyatamAdvancedCharacterGraphicsName);
//プラグインパラメータの文字列を配列に変換
Ayatam.ACG.Parameters = JSON.parse(JSON.stringify(Ayatam.ACG.Parameters,(key,value)=>{
    try{return JSON.parse(value);} catch (e) {}
    return value;
    }
));
//基本設定のショートカット
Ayatam.ACG.GlobalSettings = Ayatam.ACG.Parameters.GlobalSettings;

//Game_Pixelの定義
var $gamePixel = null;

//キャッシュ上限の解放
if(Utils.RPGMAKER_NAME === "MV") ImageCache.limit = ImageCache.limit < 1000000 * 1000 * 1000 ? 1000000 * 1000 * 1000 : ImageCache.limit;

//=============================================================================
// Ayatam.ACG - スクリプトコマンド
//=============================================================================
// ● ベース歩行グラフィックの変更
//--------------------------------------------------------------------------
Ayatam.ACG.changeActorCharacter = function(actorId,charaName,charaIndex) {
    if(actorId < 0) return;
    $gameActors.actor(actorId).setAcgBaseCharacter(charaName,charaIndex);
};
//--------------------------------------------------------------------------
// ● 装備歩行グラフィックの変更
//--------------------------------------------------------------------------
Ayatam.ACG.changeEquipCharacter = function(equipType,equipId,actorId,charaName) {
    if(equipId < 0) return;
    if(actorId < 0) return;
    if(equipType) {
        $dataWeapons[equipId].acgCharacterList[actorId] = { name: charaName };
    }else{
        $dataArmors[equipId].acgCharacterList[actorId] = { name: charaName };
    };
    $gameMap._needsRefresh = true;
};
//--------------------------------------------------------------------------
// ● 歩行グラフィック認識名にオプションリストの追加
//--------------------------------------------------------------------------
Ayatam.ACG.addOptionTagLists = function(actorId,optionLists) {
    if(actorId < 0) return;
    $gameActors.actor(actorId).setAcgOptionTagLists(optionLists);
};
//--------------------------------------------------------------------------
// ● 歩行グラフィック認識名にオプションの追加
//--------------------------------------------------------------------------
Ayatam.ACG.addOptionTag = function(actorId,optionName,auto = true) {
    if(actorId < 0) return;
    $gameActors.actor(actorId).setAcgOptionTag(optionName,auto);
};
//--------------------------------------------------------------------------
// ● 歩行グラフィック認識名にオプションの削除
//--------------------------------------------------------------------------
Ayatam.ACG.resetOptionTag = function(actorId) {
    if(actorId < 0) return;
    $gameActors.actor(actorId).resetAcgOptionTag();
};
//--------------------------------------------------------------------------
// ● 歩行グラ1回再生済みか
//--------------------------------------------------------------------------
Ayatam.ACG.isPlayOnceFinished = function(actorId) {
    if(actorId < 0) return;
    return $gameActors.actor(actorId).isPlayOnceFinished();
};
//--------------------------------------------------------------------------
// ● 指定フォロワーの移動
//--------------------------------------------------------------------------
Ayatam.ACG.followerDestination = function(followerId,x,y,dir,run = false) {
    if(followerId < 0) return;
    $gameTemp.setAcgFollowerDestination(followerId,x,y,dir,run);
};
//--------------------------------------------------------------------------
// ● 指定イベントの移動
//--------------------------------------------------------------------------
Ayatam.ACG.EventDestination = function(eventId,x,y,dir,run = false) {
    if(eventId < 0) return;
    $gameTemp.setAcgEventDestination(eventId,x,y,dir,run);
};
//--------------------------------------------------------------------------
// ● 防具の設定を読み込む
//--------------------------------------------------------------------------
Ayatam.ACG.getAcgItemsNote = function() {
    $dataWeapons.forEach(weapon => {
        if(weapon) {
          this.getAcgOjectsNote(weapon);  
        };
    });
    $dataArmors.forEach(armor => {
        if(armor) {
          this.getAcgOjectsNote(armor);  
        };
    });
};

Ayatam.ACG.getAcgOjectsNote = function(obj) {
    if(obj.acgNoteLoaded !== undefined) return;
    obj.acgNoteLoaded = true;
    obj.acgCharacterList = [];
    var lists = obj.note.split(/[\r\n]+/);
    var checkCharacterInfo = false;
    lists.forEach(note => {
        if(note !== "") {
            if(note !== "") {
                //装備時の歩行グラフィック設定
                if(note.match(/<acg characterList>/i)) checkCharacterInfo = true;
                if(note.match(/<\/acg characterList>/i)) checkCharacterInfo = false;
                if(checkCharacterInfo) {
                    if(note.match(/(.*): (.*)/i)) {
                        var result = note.match(/(.*): (.*)/i);
                        var actorId = JSON.parse(JSON.stringify(result[1],(key,value)=>{
                            try{return JSON.parse(value);} catch (e) {}
                            return value;
                            }
                        ));
                        var charaName = JSON.parse(JSON.stringify(result[2],(key,value)=>{
                            try{return JSON.parse(value);} catch (e) {}
                            return value;
                            }
                        ));
                        obj.acgCharacterList[actorId] = { name: charaName };
                    };
                };
            };
        };
    });
};
//=============================================================================
// フォルダ画像読み込み
//=============================================================================
Ayatam.ACG.hasExt = function(filename,ext) {
    if(!!filename.match(ext)) {
        return filename.replace(ext, '');
    };
    return false;
};

Ayatam.ACG.getImgPath = function() {
    var path = require('path');
    var fullPath = path.dirname(process.mainModule.filename);
    return path.join(fullPath, 'img/');
};

Ayatam.ACG.loadImgFile = function() {
    this._loadedCharacters = [];
    if(this._imgFullPath === undefined) this._imgFullPath = this.getImgPath();
    var fs = require('fs');
    if(Utils.RPGMAKER_NAME === "MV") {
        var ext = Decrypter.hasEncryptedImages ? '.rpgmvp' : '.png';
    }else if(Utils.RPGMAKER_NAME === "MZ"){
        var ext = Utils.hasEncryptedImages() ? '.png_' : '.png';
    };
    var dir = this._imgFullPath + 'characters/';
    var list = fs.readdirSync(dir);
    if(list.length <= 0) return;
    list.forEach(file => {
        if(file) {
            var fullPath = dir + file;
            var original = this.hasExt(file,ext);
            if(!fs.statSync(fullPath).isDirectory() && original) {
                ImageManager.loadCharacter(original);
                this._loadedCharacters.push(original);
            };
        };
    });
};

Ayatam.ACG.loadedCharacters = function() {
    return this._loadedCharacters;
};

Ayatam.ACG.findCharacter = function(charaName) {
    var result = [];
    if(this.loadedCharacters()) {
        if(this.loadedCharacters().length > 0) {
            this.loadedCharacters().forEach(chara => {
                if(chara) {
                    if(chara.includes(charaName)) {
                        result.push(chara);
                    };
                };
            });
        };
    };
    return result;
};

Ayatam.ACG.excludeCharacterNames = function() {
    return [Ayatam.ACG.GlobalSettings.animationName,Ayatam.ACG.GlobalSettings.animSpeedName,Ayatam.ACG.GlobalSettings.animPlayOnceName,Ayatam.ACG.GlobalSettings.stepAnimeName,Ayatam.ACG.GlobalSettings.reverseAnimeName,Ayatam.ACG.GlobalSettings.charOffSetY];
};

Ayatam.ACG.getFitCharacter = function(charaName,findLists = []) {
    findLists = findLists.map(function(a) { return a === null ? a = "" : a === undefined ? a = "" : a; });
    var foundCharacter = this.findCharacter(charaName);
    var excludeNames = this.excludeCharacterNames();
    var checkNames = [].concat(charaName,findLists,excludeNames);
    var result = "";
    var options = findLists.join().replace(/,/g,"");
    if(foundCharacter.length <= 0) return charaName;
    if(findLists.length > 0) {
        foundCharacter = foundCharacter.filter(name => (findLists.every(el => name.includes(el)) && (excludeNames.some(el => name.includes(el)) || excludeNames.every(el => !name.includes(el)))));
        for(var i = 0; i < foundCharacter.length; ++i) {
            if(foundCharacter[i]) {
                var original = foundCharacter[i];
                checkNames.forEach(erase => {
                    if(erase) {
                        foundCharacter[i] = foundCharacter[i].replace(erase,"").replace(/\d/g,"");
                    };
                });
                if(!foundCharacter[i]) {
                    result = original;
                    break;
                };
            };
        };
    };
    if(result === "") {
        result = charaName + options;
        var notFoundOpt = options.replace(/_/g," _");
        if(notFoundOpt) {
            console.error('歩行グラフィック拡張MVMZ : Error :\n「' + charaName + '」に対する状態差分「' + notFoundOpt + ' 」が含まれる歩行グラフィックを見つけることができませんでした。\nimg/characters/ に対象差分の歩行グラフィックをご用意ください。\n歩行グラフィック拡張MVMZの機能をすべて停止しました。\nご用意いただいたらゲームを起動し直してください。');
        }else{
            console.error('歩行グラフィック拡張MVMZ : Error :\n認識名の指定があるものまたは無いもののどちらからも\n「' + charaName + '」の名前が含まれる歩行グラフィックを見つけることができませんでした。\nimg/characters/ に対象歩行グラフィックをご用意ください。\n歩行グラフィック拡張MVMZの機能をすべて停止しました。\nご用意いただいたらゲームを起動し直してください。');
        };
        require('nw.gui').Window.get().showDevTools();
        AudioManager.playSe({ "name": "Computer", "volume": 70, "pitch": 100, "pan": 0 });
        this._cancelUpdate = true;
    };
    return String(result);
};

Ayatam.ACG.cancelUpdate = function() {
    if(this._cancelUpdate === undefined || this._cancelUpdate === null) this._cancelUpdate = false;
    return this._cancelUpdate;
};

if(Ayatam.ACG.GlobalSettings.pixelMovements) {
    //=============================================================================
    // Game_Pixel - ピクセル移動のオブジェクト
    //=============================================================================
    class Game_Pixel {
        constructor() {
            this.initialize.apply(this, arguments);
        }
        //--------------------------------------------------------------------------
        // ● オブジェクト初期化
        //--------------------------------------------------------------------------
        initialize() {
            this._followDistance = Ayatam.ACG.GlobalSettings.pixelFollowerDistance;
            if(this._followDistance instanceof String) this._followDistance = 1.8125;
        }
        //--------------------------------------------------------------------------
        // ● コサイン
        //-------------------------------------------------------------------------
        cos(org,pos) {
            var orgNormalize = org.velocity === 0.0 ? this.pixelPosByVelDir(1.0 , org.dir) : this.pixelPos((1.0 / org.velocity) * org.x,(1.0 / org.velocity) * org.y);
            var posNormalize = pos.velocity === 0.0 ? this.pixelPosByVelDir(1.0 , pos.dir) : this.pixelPos((1.0 / pos.velocity) * pos.x,(1.0 / pos.velocity) * pos.y);
            return orgNormalize.x * posNormalize.x + orgNormalize.y * posNormalize.y;
        };
        //--------------------------------------------------------------------------
        // ● クロス
        //-------------------------------------------------------------------------
        cross(org,pos) {
            var orgNormalize = org.velocity === 0.0 ? this.pixelPosByVelDir(1.0 , org.dir) : this.pixelPos((1.0 / org.velocity) * org.x,(1.0 / org.velocity) * org.y);
            return orgNormalize.x * pos.y - orgNormalize.y * pos.x;
        };
        //--------------------------------------------------------------------------
        // ● 建造物回避
        //-------------------------------------------------------------------------
        perp(org,vel) {
            var orgNormalize = org.velocity === 0.0 ? this.pixelPosByVelDir(0.0 , org.dir + Math.PI / 2.0) : this.pixelPos(-org.y,org.x);
            return orgNormalize.velocity === 0.0 ? this.pixelPosByVelDir(vel , orgNormalize.dir) : this.pixelPos((vel / orgNormalize.velocity) * orgNormalize.x,(vel / orgNormalize.velocity) * orgNormalize.y);
        };
        //--------------------------------------------------------------------------
        // ● フォロワー距離
        //-------------------------------------------------------------------------
        followDistance() {
            return this._followDistance;
        };
        //--------------------------------------------------------------------------
        // ● フォロワー追跡
        //-------------------------------------------------------------------------
        followRoot(org,vel) {
            return org.velocity === 0.0 ? this.pixelPosByVelDir(vel , org.dir) : this.pixelPos((vel / org.velocity) * org.x,(vel / org.velocity) * org.y);
        };
        //--------------------------------------------------------------------------
        // ● 半径を方向に変換
        //--------------------------------------------------------------------------
        radToDir(radius) {
            return (radius < Math.PI / 4.0 * -3.0 ? 4 : radius < Math.PI / 4.0 * -1.0 ? 8 : radius < Math.PI / 4.0 *  1.0 ? 6 : radius < Math.PI / 4.0 *  3.0 ? 2 : 4);
        }
        //--------------------------------------------------------------------------
        // ● 方向を半径に変換
        //--------------------------------------------------------------------------
        pixelDir(dir) {
            var x = dir % 3 === 0 ? 1.0 : (dir % 3 === 1 ? -1.0 : 0.0);
            var y = dir / 3 <= 1 ? 1.0 : (dir / 3 > 2 ? -1.0 : 0.0);
            return Math.atan2(y, x);
        }
        //--------------------------------------------------------------------------
        // ● Pixel位置計算
        //--------------------------------------------------------------------------
        pixelPos(rx, ry, velocity = undefined, dir = undefined) {
            velocity = Math.sqrt(Math.pow(rx, 2) + Math.pow(ry, 2));
            if(velocity !== 0.0 || dir === undefined ) { dir = Math.atan2(ry,rx) };
            return { x: rx , y: ry , velocity: velocity , dir: dir };
        }
        //--------------------------------------------------------------------------
        // ● Pixel強制移動計算
        //--------------------------------------------------------------------------
        pixelForceMov(rx,ry,dir) {
            var vel = Math.sqrt(Math.pow(rx, 2) + Math.pow(ry, 2));
            return { x: rx , y: ry , velocity: vel , dir: dir };
        }
        //--------------------------------------------------------------------------
        // ● x座標を元にリロード
        //--------------------------------------------------------------------------
        reloadX(org, newX) {
            org.x = newX;
            org.velocity = Math.sqrt(Math.pow(org.x, 2) + Math.pow(org.y, 2));
            if(org.velocity !== 0.0) { org.dir = Math.atan2(org.y,org.x) };
            return org;
        }
        //--------------------------------------------------------------------------
        // ● y座標を元にリロード
        //--------------------------------------------------------------------------
        reloadY(org, newY) {
            org.y = newY;
            org.velocity = Math.sqrt(Math.pow(org.x, 2) + Math.pow(org.y, 2));
            if(org.velocity !== 0.0) { org.dir = Math.atan2(org.y,org.x) };
            return org;
        }
        //--------------------------------------------------------------------------
        // ● velocityを元にリロード
        //--------------------------------------------------------------------------
        reloadVelocity(org, newVel) {
            org.velocity = newVel;
            org.x = org.velocity * Math.cos(org.dir);
            org.y = org.velocity * Math.sin(org.dir);
            return this.pixelPos(org.x,org.y);
        }
        //--------------------------------------------------------------------------
        // ● 座標調整
        //--------------------------------------------------------------------------
        pixelPosByVelDir(vel,dir) {
            var x = vel * Math.cos(dir);
            var y = vel * Math.sin(dir);
            return this.pixelPos(x,y,vel,dir);
        }
        //--------------------------------------------------------------------------
        // ● マップ上の移動制限
        //--------------------------------------------------------------------------
        isMapPassable(org,pos) {
            var mapX = $gameMap.roundX(org.x + pos.x);
            var mapY = $gameMap.roundY(org.y + pos.y);
            return this.pixelPos(mapX, mapY);
        }
        //--------------------------------------------------------------------------
        // ● 対象との距離
        //--------------------------------------------------------------------------
        findDistance(tar,pos) {
            var mapX = $gameMap.deltaX(tar.x, pos.x);
            var mapY = $gameMap.deltaX(tar.y, pos.y);
            return this.pixelPos(mapX, mapY);
        }
    }
    //=============================================================================
    // Game_System - ピクセル移動のオブジェクト作成
    //=============================================================================
    var _Ayatam_Acg_Game_System_prototype_initialize = Game_System.prototype.initialize;
    Game_System.prototype.initialize = function() {
        _Ayatam_Acg_Game_System_prototype_initialize.call(this);
        if($gamePixel === null) $gamePixel = new Game_Pixel();
    };
    //=============================================================================
    // Game_CharacterBase - ピクセル移動処理の追加
    //=============================================================================
    var _Ayatam_Acg_Game_CharacterBase_prototype_initialize = Game_CharacterBase.prototype.initialize;
    Game_CharacterBase.prototype.initialize = function() {
        _Ayatam_Acg_Game_CharacterBase_prototype_initialize.call(this);
        this.initAcgPixelMovements();
    };

    Game_CharacterBase.prototype.initAcgPixelMovements = function() {
        this._acgPixelPos = this.getPixelPos();
        this._acgVelDir = this.getPixelDir();
        this._acgPixelStepDistance = 0.0;
        this._movePixelPos = undefined;
        this._lastPixelPos = this.getPixelPos();
    };

    Game_CharacterBase.prototype.getPixelPos = function() {
        return $gamePixel.pixelPos(this._realX + 0.5,this._realY + 0.5);
    };

    Game_CharacterBase.prototype.setPixelPosition = function(currentPos) {
        this._realX = currentPos.x - 0.5;
        this._realY = currentPos.y - 0.5;
        this._x = Math.round(this._realX);
        this._y = Math.round(this._realY);
    };

    Game_CharacterBase.prototype.getPixelDir = function() {
        return $gamePixel.pixelPosByVelDir(0.0,$gamePixel.pixelDir(this.direction()));
    };

    Game_CharacterBase.prototype.setPixelDirection = function(currentDir) {
        if(Ayatam.ACG.GlobalSettings.diagonalMovements) {
            if(Input.dir8 !== 0 && this.acgCanPixelDirectionUpdate()) this.setDirection($gamePixel.radToDir(currentDir.dir));
        }else{
            if(Input.dir4 !== 0 && this.acgCanPixelDirectionUpdate()) this.setDirection($gamePixel.radToDir(currentDir.dir));
        };
    };

    Game_CharacterBase.prototype.acgCanPixelDirectionUpdate = function() {
        return true;
    };

    var _Ayatam_Acg_Game_CharacterBase_prototype_isThrough = Game_CharacterBase.prototype.isThrough;
    Game_CharacterBase.prototype.isThrough = function() {
        return _Ayatam_Acg_Game_CharacterBase_prototype_isThrough.call(this) || this.isDebugThrough();
    };

    Game_CharacterBase.prototype.updatePixelPos = function() {
        if(!this.isMoving()) {
            this.updateStop();
        }else{
            this.resetStopCount();
        };
        this.updateAnimation();
        this.updateBushDepth();
        this.updateFaceLadder();
    };

    Game_CharacterBase.prototype.updateBushDepth = function() {
        this._bushDepth = (this.isNormalPriority() && !this.isObjectCharacter() && this.isOnBush() && !this.isJumping()) ? 12 : 0;
    };

    Game_CharacterBase.prototype.updateFaceLadder = function() {
        if(this.isOnLadder()) {
            this.setDirection(8);
        };
    };

    Game_CharacterBase.prototype.updateLastPixelPosition = function() {
        this._acgPixelPos = this.getPixelPos();
        this._lastPixelPos = Object.assign(this._acgPixelPos);
    };

    Game_CharacterBase.prototype.updateTouchPixelPosition = function() {
        if(this.constructor === Game_Player) {
            if($gameTemp.isDestinationValid()) {
                var direction = this.direction();
                if($gameTemp.isAcgFollowerDestinationValid(0)) $gameTemp.acgClearFollowerDestination(0);
                var x = $gameTemp.destinationX();
                var y = $gameTemp.destinationY();
                direction = this.findDirectionTo(x, y);
                this.setMovementSuccess(this.canPass(this._x, this._y, direction));
                if(this.isMovementSucceeded()) {
                    if (direction > 0) {
                        x = $gameMap.roundXWithDirection(this._x, direction) + 0.5;
                        y = $gameMap.roundYWithDirection(this._y, direction) + 0.5;
                        direction = $gamePixel.pixelDir(direction);
                        this._movePixelPos = $gamePixel.pixelForceMov(x,y,direction);
                        this.setDirection($gamePixel.radToDir(this._movePixelPos.dir));
                    }else{
                        this.setDirection(direction);
                        this.checkEventTriggerTouchFront(direction);
                    };
                }else{
                    this.setDirection(direction);
                    this.checkEventTriggerTouchFront(direction);
                };
            };
            if($gameTemp.isAcgFollowerDestinationValid(0)) {
                var direction = this.direction();
                var x = $gameTemp.acgFollowerDestinationX(0);
                var y = $gameTemp.acgFollowerDestinationY(0);
                direction = this.findDirectionTo(x,y);
                this.setMovementSuccess(this.canPass(this._x, this._y, direction));
                if(this.isMovementSucceeded()) {
                    if (direction > 0) {
                        x = $gameMap.roundXWithDirection(this._x, direction) + 0.5;
                        y = $gameMap.roundYWithDirection(this._y, direction) + 0.5;
                        direction = $gamePixel.pixelDir(direction);
                        this._movePixelPos = $gamePixel.pixelForceMov(x,y,direction);
                        this.setDirection($gamePixel.radToDir(this._movePixelPos.dir));
                    }else{
                        if($gameTemp.acgFollowerNewDirection(0) > 0) this.setDirection($gameTemp.acgFollowerNewDirection(0));
                        $gameTemp.acgClearFollowerDestination(0);
                    };
                }else{
                    if($gameTemp.acgFollowerNewDirection(0) > 0) this.setDirection($gameTemp.acgFollowerNewDirection(0));
                    $gameTemp.acgClearFollowerDestination(0);
                };
            };
        }else if(this.constructor === Game_Follower) {
            if($gameTemp.isAcgFollowerDestinationValid(this.acgMemberIndex())) {
                var direction = this.direction();
                var x = $gameTemp.acgFollowerDestinationX(this.acgMemberIndex());
                var y = $gameTemp.acgFollowerDestinationY(this.acgMemberIndex());
                direction = this.findDirectionTo(x,y);
                this.setMovementSuccess(this.canPass(this._x, this._y, direction));
                if(this.isMovementSucceeded()) {
                    if (direction > 0) {
                        x = $gameMap.roundXWithDirection(this._x, direction) + 0.5;
                        y = $gameMap.roundYWithDirection(this._y, direction) + 0.5;
                        direction = $gamePixel.pixelDir(direction);
                        this._movePixelPos = $gamePixel.pixelForceMov(x,y,direction);
                        this.setDirection($gamePixel.radToDir(this._movePixelPos.dir));
                    }else{
                        this._movePixelPos = undefined;
                        if($gameTemp.isAcgFollowerDestinationValid(this.acgMemberIndex())) {
                            if($gameTemp.acgFollowerNewDirection(this.acgMemberIndex()) > 0) this.setDirection($gameTemp.acgFollowerNewDirection(this.acgMemberIndex()));
                            $gameTemp.acgClearFollowerDestination(this.acgMemberIndex());
                        };
                    };
                }else{
                    this._movePixelPos = undefined;
                    if($gameTemp.isAcgFollowerDestinationValid(this.acgMemberIndex())) {
                        if($gameTemp.acgFollowerNewDirection(this.acgMemberIndex()) > 0) this.setDirection($gameTemp.acgFollowerNewDirection(this.acgMemberIndex()));
                        $gameTemp.acgClearFollowerDestination(this.acgMemberIndex());
                    };
                };
            }else{
                if(!$gameTemp.isAcgFollowerDestinationValid(0)) {//gamePlayerの追跡中断
                    if(this.acgPixelFollowAble()) {
                        var followTarget = this.acgMemberIndex() - 1 > 0 ? $gamePlayer.followers().follower(this.acgMemberIndex() - 2) : $gamePlayer;
                        var preChaseCharacter =  followTarget.getPixelPos();
                        var targetPos = $gamePixel.findDistance(preChaseCharacter,this._acgPixelPos);
                        if(!$gamePlayer.followers().areGathering()) {
                            var distanceTo = $gamePixel.findDistance(preChaseCharacter,$gamePixel.isMapPassable(this._acgPixelPos,this._acgVelDir));
                            var canChase = distanceTo.velocity > $gamePixel.followDistance();
                            if(canChase) {
                                if(Ayatam.ACG.GlobalSettings.diagonalMovements) {
                                    var sendfollowPos = $gamePixel.findDistance(preChaseCharacter,$gamePixel.followRoot(targetPos,1.0));
                                    this._movePixelPos = targetPos.velocity > 1.0 ? sendfollowPos : undefined; 
                                    if(this._movePixelPos) this.setDirection($gamePixel.radToDir(targetPos.dir));
                                }else{
                                    var x = Math.floor(preChaseCharacter.x);
                                    var y = Math.floor(preChaseCharacter.y);
                                    direction = this.findDirectionTo(x,y);
                                    this.setMovementSuccess(this.canPass(this._x, this._y, direction));
                                    if(this.isMovementSucceeded()) {
                                        if (direction > 0) {
                                            x = $gameMap.roundXWithDirection(this._x, direction) + 0.5;
                                            y = $gameMap.roundYWithDirection(this._y, direction) + 0.5;
                                            direction = $gamePixel.pixelDir(direction);
                                            this._movePixelPos = $gamePixel.pixelForceMov(x,y,direction);
                                            this.setDirection($gamePixel.radToDir(this._movePixelPos.dir));
                                        }else{
                                            this._movePixelPos = preChaseCharacter;
                                            if(this._movePixelPos) this.setDirection($gamePixel.radToDir(targetPos.dir));
                                        };
                                    }else{
                                        this.setDirection(direction);
                                    };
                                };
                            };
                        }else{
                            var direction = this.direction();
                            var x = Math.floor(preChaseCharacter.x);
                            var y = Math.floor(preChaseCharacter.y);
                            direction = this.findDirectionTo(x,y);
                            this.setMovementSuccess(this.canPass(this._x, this._y, direction));
                            if(this.isMovementSucceeded()) {
                                if (direction > 0) {
                                    x = $gameMap.roundXWithDirection(this._x, direction) + 0.5;
                                    y = $gameMap.roundYWithDirection(this._y, direction) + 0.5;
                                    direction = $gamePixel.pixelDir(direction);
                                    this._movePixelPos = $gamePixel.pixelForceMov(x,y,direction);
                                    this.setDirection($gamePixel.radToDir(this._movePixelPos.dir));
                                }else{
                                    this._movePixelPos = preChaseCharacter;
                                    if(this._movePixelPos) this.setDirection($gamePixel.radToDir(targetPos.dir));
                                };
                            }else{
                                this.setDirection(direction);
                            };
                        };
                    };
                };
            };
        };
        if(this._movePixelPos) {
            if($gamePixel.findDistance(this._movePixelPos,this._acgPixelPos).velocity < 1.0 / 96.0) {
                this._movePixelPos = undefined;
            };
        };
    };

    Game_CharacterBase.prototype.updatePixelVelocity = function() {
        if(this.constructor === Game_Player) {
            if(Input.dir8 !== 0 && !$gameTemp.isAcgFollowerDestinationValid(0)) {
                $gameTemp.clearDestination();
                this._movePixelPos = undefined;
                this.updateInputVelocity();
            }else{
                this.updateMovePixelPos();
            };
        }else{
            this.updateMovePixelPos();
        };
    };

    Game_CharacterBase.prototype.updateMovePixelPos = function() {
        var velocity = 0.0;
        var dir = this._acgVelDir.dir;
        if(this._movePixelPos) {
            var realPixelPos = $gamePixel.findDistance(this._movePixelPos,this._acgPixelPos);
            velocity = Math.min(this.distancePerFrame(), realPixelPos.velocity);
            dir = realPixelPos.dir;
        };
        this._acgVelDir = $gamePixel.pixelPosByVelDir(velocity,dir);
    };

    Game_CharacterBase.prototype.updateInputVelocity = function() {
        var velocity = 0.0;
        var dir = 0.0;
        velocity = this.distancePerFrame();
        if(Ayatam.ACG.GlobalSettings.diagonalMovements && Input.dir8 !== 0) {
            if(Input.acgLeftStick.velocity > 0) {
                velocity = Input.acgLeftStick.velocity * this.distancePerFrame();
                dir = Input.acgLeftStick.dir;
            }else{
                dir = $gamePixel.pixelDir(Input.dir8);
            };
        }else if(!Ayatam.ACG.GlobalSettings.diagonalMovements && Input.dir4 !== 0) {
            if(Input.acgLeftStick.velocity > 0) {
                velocity = Input.acgLeftStick.velocity * this.distancePerFrame();
                dir = $gamePixel.pixelDir(Input.dir4);
            }else{
                dir = $gamePixel.pixelDir(Input.dir4);
            };
        };
        this._acgVelDir = $gamePixel.pixelPosByVelDir(velocity,dir);
        this.checkEventTriggerTouchFront($gamePixel.radToDir(this._acgVelDir.dir));
    };

    Game_CharacterBase.prototype.updatePixelPosition = function() {
        if(this.constructor === Game_Player) {
            this.getPixelPosition();
        }else if(this.constructor === Game_Follower) {
            if(!this.isVisible()) {
                this._acgPixelPos = $gamePlayer.getPixelPos();
                return;
            };
            this.getPixelPosition();
        };
    };

    Game_CharacterBase.prototype.getPixelPosition = function() {
        var lastVelDir = Object.assign(this._acgVelDir); 
        var orgVelDir = Object.assign(this._acgVelDir);
        var orgPixelDir = this._acgVelDir.dir;
        while (orgVelDir.velocity > 0.0) {
            var orgVel = Math.min(orgVelDir.velocity, 1.0 / 16.0);
            var newPixelPos = $gamePixel.pixelPosByVelDir(orgVel,orgPixelDir);
            this._acgVelDir = newPixelPos;
            this.findCollisions();
            this._acgPixelPos = $gamePixel.isMapPassable(this._acgPixelPos,this._acgVelDir);
            orgVelDir = $gamePixel.reloadVelocity(orgVelDir,Math.max(0.0, orgVelDir.velocity - orgVel));
        };
        this._acgVelDir = lastVelDir;
    };

    Game_CharacterBase.prototype.findCollisions = function() {
        this.findAnyCharacter();
        this.findAnyTiles();
    };

    Game_CharacterBase.prototype.findAnyTiles = function() {
        if(this._acgVelDir.velocity === 0.0) {
            return;
        };
        if(!this.isThrough()) {
            var findCorner = [3, 1, 7, 9];
            findCorner.forEach(corner => {
                if(corner) {
                    this.getBlockedCorner(corner);
                };
            });
        };
        if(this._acgVelDir.x != 0.0) {
            var dir = this._acgVelDir.x < 0.0 ? 4 : 6;
            var movPos = $gamePixel.isMapPassable(this._acgPixelPos,this._acgVelDir);
            var x = Math.floor(movPos.x);
            var y = Math.floor(movPos.y);
            var edgePos = $gamePlayer.edgePos(x,y,dir);
            if(edgePos) {
                if(Math.abs(edgePos.x - movPos.x) < 0.5) {
                    this._acgVelDir = $gamePixel.reloadX(this._acgVelDir, 0.0);
                    this._acgPixelPos = $gamePixel.reloadX(this._acgPixelPos, Math.floor(this._acgPixelPos.x) + 0.5);
                    //x方向通行禁止歩行グラ枠
                };
            };
        };
        if(this._acgVelDir.y != 0.0) {
            var dir = this._acgVelDir.y < 0.0 ? 8 : 2;
            var movPos = $gamePixel.isMapPassable(this._acgPixelPos,this._acgVelDir);
            var x = Math.floor(movPos.x);
            var y = Math.floor(movPos.y);
            var edgePos = $gamePlayer.edgePos(x,y,dir);
            if(edgePos) {
                if(Math.abs(edgePos.y - movPos.y) < 0.5) {
                    this._acgVelDir = $gamePixel.reloadY(this._acgVelDir, 0.0);
                    this._acgPixelPos = $gamePixel.reloadY(this._acgPixelPos, Math.floor(this._acgPixelPos.y) + 0.5);
                    //y方向通行禁止歩行グラ枠
                };
            };
        };
    };

    Game_CharacterBase.prototype.edgePos = function(x,y,dir) {
        if(this.isEdge(x,y,dir)) {
            return dir === 6 ? $gamePixel.pixelPos(x + 1.0 ,y + 0.5) : dir === 2 ? $gamePixel.pixelPos(x + 0.5 ,y + 1.0) : dir === 4 ? $gamePixel.pixelPos(x ,y + 0.5) : dir === 8 ? $gamePixel.pixelPos(x + 0.5 ,y) : undefined
        };
        return undefined;
    };

    Game_CharacterBase.prototype.getBlockedCorner = function(dir) {
        var posX = Math.floor($gamePixel.isMapPassable(this._acgPixelPos,this._acgVelDir).x);
        var posY = Math.floor($gamePixel.isMapPassable(this._acgPixelPos,this._acgVelDir).y);
        var characterDir = $gamePixel.pixelDir(dir);
        var offset = $gamePixel.pixelPosByVelDir(0.75,characterDir);
        var movePos = $gamePixel.isMapPassable($gamePixel.isMapPassable(this._acgPixelPos,this._acgVelDir),offset);
        var movX = Math.floor(movePos.x);
        var movY = Math.floor(movePos.y);
        if(posX !== movX && posY !== movY) {
            var corPos = $gamePlayer.cornerPos(posX,posY,dir);
            if(corPos) {
                var realPos = $gamePixel.findDistance(corPos,$gamePixel.isMapPassable(this._acgPixelPos,this._acgVelDir));
                if(realPos.velocity < 0.5 - (this._acgVelDir.velocity / 2.0)) {
                    this._acgVelDir = this.evalVelDir(corPos);
                    if(this.getCollisionCharacters().length !== 0) {
                        this._acgVelDir = $gamePixel.pixelPosByVelDir(0.0,0.0);
                    };
                };
            };
        };
    };

    Game_CharacterBase.prototype.cornerPos = function(x,y,dir) {
        if(this.isCorner(x,y,dir)) {
            return dir === 3 ? $gamePixel.pixelPos(x + 1.0, y + 1.0) : dir === 1 ? $gamePixel.pixelPos(x, y + 1.0) : dir === 7 ? $gamePixel.pixelPos(x, y) : dir === 9 ? $gamePixel.pixelPos(x + 1.0, y) : undefined;
        };
        return undefined;
    };

    Game_CharacterBase.prototype.isCorner = function(x,y,dir) {
        var horDir = this.horizontalDirection(dir);
        var verDir = this.verticalDirection(dir);
        var mapX = $gameMap.roundXWithDirection(x, horDir);
        var mapY = $gameMap.roundYWithDirection(y, verDir);
        return !this.isEdge(x,y,horDir) && !this.isEdge(x,y,verDir) && this.isEdge(x, mapY, horDir) && this.isEdge(mapX, y, verDir);
    };

    Game_CharacterBase.prototype.horizontalDirection = function(dir) {
        var horDir = dir % 3;
        return horDir === 0 ? 6 : horDir === 1 ? 4 : 5;
    };

    Game_CharacterBase.prototype.verticalDirection = function(dir) {
        var verDir = Math.ceil(dir / 3);
        return verDir === 1 ? 2 : verDir === 3 ? 8 : 5;
    };

    Game_CharacterBase.prototype.isEdge = function(x,y,dir) {
        var edgeX = $gameMap.roundXWithDirection(x, dir);
        var edgeY = $gameMap.roundYWithDirection(y, dir);
        var revDir = this.reverseDir(dir);
        if($gameMap.isValid(edgeX, edgeY)) {
            if(!this.isThrough()) {
                return !this.isMapPassable(x, y, dir) || !this.isMapPassable(edgeX, edgeY, revDir);
            };
            return false;
        };
        return true;
    };

    Game_CharacterBase.prototype.findAnyCharacter = function() {
        if(this.isThrough() || this._acgVelDir.velocity === 0.0) {
            return;
        };
        var collisionCharacters = this.getCollisionCharacters();
        if(collisionCharacters.length > 1) {
            this._acgVelDir = $gamePixel.pixelPosByVelDir(0.0,0.0);
        }else if(collisionCharacters.length > 0) {
            var character = collisionCharacters[0];
            this._acgVelDir = this.evalVelDir(character.getPixelPos());
        };
    };

    Game_CharacterBase.prototype.evalVelDir = function(pos) {
        var evalVelDir = $gamePixel.findDistance(pos,this._acgPixelPos);
        var evalVelDirVelocity = $gamePixel.cross(evalVelDir,this._acgVelDir);
        return $gamePixel.perp(evalVelDir,evalVelDirVelocity);
    };

    Game_CharacterBase.prototype.getCollisionCharacters = function() {
        var allCharacters = [];
        var collisionCharacters = [];
        if(!this.isThrough()) {
            allCharacters = [].concat($gamePlayer.followers()._data,$gameMap.events(),$gameMap.vehicles());
            if(allCharacters.length > 0) {
                allCharacters.forEach(character => {
                    if(character) {
                        if(this.collisionRules(character)) {
                            collisionCharacters.push(character);
                        };
                    };
                });
            };
        };
        return collisionCharacters;
    };

    Game_CharacterBase.prototype.collisionRules = function(character) {
        if(this.constructor === Game_Player) {
            return !this.isThrough() && !character.isThrough() && (this.isAccessbleEvent(character) || this.isAccessbleVehicle(character)) && this.getCollisionDistance(character);
        }else if(this.constructor === Game_Follower) {
            return !this.isThrough() && !character.isThrough() && this.isAccessbleEvent(character) && this.getCollisionDistance(character);
        }else{
            return !this.isThrough() && !character.isThrough() && this.getCollisionDistance(character);
        };
    };

    Game_CharacterBase.prototype.isAccessbleEvent = function(character) {
        return character instanceof Game_Event && character.isNormalPriority();
    };

    Game_CharacterBase.prototype.isAccessbleVehicle = function(character) {
        return character instanceof Game_Vehicle && (this.isInBoat() && character.isShip() || this.isInShip() && character.isBoat());
    }; 

    Game_CharacterBase.prototype.getCollisionDistance = function(character) {
        var targetPos = character.getPixelPos();
        var currentPos = $gamePixel.findDistance(targetPos,this._acgPixelPos);
        var isInMapPos = $gamePixel.findDistance(targetPos,$gamePixel.isMapPassable(this._acgPixelPos,this._acgVelDir));
        var result = $gamePixel.cos(currentPos,this._acgVelDir) > Math.cos(Math.PI * 3.0 / 4.0) && isInMapPos.velocity < 1.0 - (this._acgVelDir.velocity / 2.0);
        return result;
    };

    Game_CharacterBase.prototype.updatePixelCharacter = function() {
        if(this.constructor === Game_Player) {
            this.setPixelPosition(this._acgPixelPos);
            this.setPixelDirection(this._acgVelDir);
        }else if(this.constructor === Game_Follower) {
            var followTarget = this.acgMemberIndex() - 1 > 0 ? $gamePlayer.followers().follower(this.acgMemberIndex() - 2) : $gamePlayer;
            var preChaseCharacter =  followTarget.getPixelPos();
            var targetPos = $gamePixel.findDistance(preChaseCharacter,this._acgPixelPos);
            this.setPixelPosition(this._acgPixelPos);
            this.setPixelDirection(targetPos);
        };
    };

    Game_CharacterBase.prototype.updatePixelSteps = function() {
        this._acgPixelStepDistance += $gamePixel.findDistance(this._lastPixelPos,this._acgPixelPos).velocity;
        if(this._acgPixelStepDistance > 1.0) {
            this._acgPixelStepDistance -= 1.0;
            if(this.canEncounter()) {
                this._encounterCount -= this.encounterProgressValue();
            };
            this.increaseSteps();
            $gameParty.onPlayerWalk();
        };
    };

    Game_CharacterBase.prototype.updatePixelCoordinate = function() {
        if(!this.canMove() || !this.isMoving()) {
            if($gameTemp.isDestinationValid()) {
                $gameTemp.clearDestination();
            };
            this._movePixelPos = undefined;
        };
    };
    //=============================================================================
    // Game_Player - Pixel起動
    //=============================================================================
    var _Ayatam_Acg_Game_Player_prototype_isThrough = Game_Player.prototype.isThrough;
    Game_Player.prototype.isThrough = function() {
        return this._vehicleGettingOn || this._vehicleGettingOff || _Ayatam_Acg_Game_Player_prototype_isThrough.call(this);
    };

    var _Ayatam_Acg_Game_Player_prototype_isMoving = Game_Player.prototype.isMoving;
    Game_Player.prototype.isMoving = function() {
        if(this.isMoveRouteForcing() || this._vehicleGettingOn || this._vehicleGettingOff) {
            return _Ayatam_Acg_Game_Player_prototype_isMoving.call(this);
        }else if(this.canPixelMove()) {
            return $gamePixel.findDistance(this._lastPixelPos,this._acgPixelPos).velocity > 1.0 / 256.0;
        };
        return false;
    };

    Game_Player.prototype.canPixelMove = function() {
        return (this.canMove() || $gameTemp.isAcgFollowerDestinationValid(0)) && !this.isJumping() && !(this.isMoveRouteForcing() || this._vehicleGettingOn || this._vehicleGettingOff);
    };

    Game_Player.prototype.updatePixelDash = function() {
        this._dashing = this.canMove() && !this.isInVehicle() && !$gameMap.isDashDisabled() && (this.isDashButtonPressed() || $gameTemp.isDestinationValid());
    };

    var _Ayatam_Acg_Game_Player_prototype_checkEventTriggerHere = Game_Player.prototype.checkEventTriggerHere;
    Game_Player.prototype.checkEventTriggerHere = function(triggers) {
        if(this.canPixelMove()) {
            if (this.canStartLocalEvents()) {
                var frontPos = $gamePixel.isMapPassable(this._acgPixelPos,$gamePixel.pixelPosByVelDir(1.0,this._acgVelDir.dir));
                var x = Math.floor(frontPos.x);
                var y = Math.floor(frontPos.y);
                this.startMapEvent(x, y, triggers, false);
            };
            return;
        };
        _Ayatam_Acg_Game_Player_prototype_checkEventTriggerHere.call(this,triggers);
    };
    
    var _Ayatam_Acg_Game_Player_prototype_updateVehicleGetOff = Game_Player.prototype.updateVehicleGetOff;
    Game_Player.prototype.updateVehicleGetOff = function() {
        if(this.isMoving()) return;
        _Ayatam_Acg_Game_Player_prototype_updateVehicleGetOff.call(this);
    };
    //=============================================================================
    // Game_Follower - Pixel接触
    //=============================================================================
    Game_Follower.prototype.canPixelMove = function() {
        return (($gamePlayer.canPixelMove() || $gameTemp.isAcgFollowerDestinationValid(this.acgMemberIndex())) || $gamePlayer.followers().areGathering()) && !(this.isMoveRouteForcing() || $gamePlayer._vehicleGettingOn || $gamePlayer._vehicleGettingOff);
    };
    
    var _Ayatam_Acg_Game_Follower_prototype_isMoving = Game_Follower.prototype.isMoving;
    Game_Follower.prototype.isMoving = function() {
        if(this.isMoveRouteForcing() || $gamePlayer._vehicleGettingOn || $gamePlayer._vehicleGettingOff) {
            return _Ayatam_Acg_Game_Follower_prototype_isMoving.call(this);
        }else if(this.canPixelMove()) {
            return $gamePixel.findDistance(this._lastPixelPos,this._acgPixelPos).velocity > 1.0 / 256.0;
        };
        return false;
    };

    var _Ayatam_Acg_Game_Follower_prototype_isThrough = Game_Follower.prototype.isThrough;
    Game_Follower.prototype.isThrough = function() {
        if(this.canPixelMove()) {
            return !this.isVisible() || $gamePlayer.isThrough();
        };
        return _Ayatam_Acg_Game_Follower_prototype_isThrough.call(this);
    };

    Game_Follower.prototype.updateFollowerPixelMovements = function() {
        this.updateLastPixelPosition();
        this.updateTouchPixelPosition();
        this.updatePixelVelocity();
        this.updatePixelPosition();
        this.ownerIsThrough();
        this.updatePixelCharacter();
    };

    Game_Follower.prototype.ownerIsThrough = function() {
        if($gamePlayer.isThrough()) {
            this.setThrough(true);
        }else if(!this._movePixelPos) {
            this.setThrough(false);
        }else if(this.isThrough()) {
            var condition = $gamePixel.findDistance(this._movePixelPos,this._acgPixelPos).velocity > 0.125;
            this.setThrough(condition);
        }else{
            var condition = $gamePixel.findDistance(this._movePixelPos,this._acgPixelPos).velocity > 2.000;
            this.setThrough(condition);
        };
    };
    //=============================================================================
    // Game_Event - Pixel接触
    //=============================================================================
    Game_Event.prototype.isAccessableTriggerEvent = function() {
        var Triggers = [1, 2];
        return this.isTriggerIn(Triggers);
    };
    //=============================================================================
    // Game_map - Pixel変換
    //=============================================================================
    var _Ayatam_Acg_Game_Map_prototype_canvasToMapX = Game_Map.prototype.canvasToMapX;
    Game_Map.prototype.canvasToMapX = function(x) {
        x = Math.floor(x);
        return _Ayatam_Acg_Game_Map_prototype_canvasToMapX.call(this,x);
    };

    var _Ayatam_Acg_Game_Map_prototype_canvasToMapY = Game_Map.prototype.canvasToMapY;
    Game_Map.prototype.canvasToMapY = function(y) {
        y = Math.floor(y);
        return _Ayatam_Acg_Game_Map_prototype_canvasToMapY.call(this,y);
    };
    //=============================================================================
    // Input - ゲームパッドスティックの入力量計算
    //=============================================================================
    var _Ayatam_Acg_Input_initialize = Input.initialize;
    Input.initialize = function() {
        _Ayatam_Acg_Input_initialize.call(this);
        this.acgLeftStick = { dir: 0.0 , velocity: 0.0 };
        this.acgRightStick = { dir: 0.0 , velocity: 0.0 };
        this.acgStickThreshold = 0.2;
    };

    var _Ayatam_Acg_Input_update = Input.update;
    Input.update = function() {
        _Ayatam_Acg_Input_update.call(this);
        this.acgUpdateSticks();
    };

    Input.acgUpdateSticks = function() {
        var axis = [0.0,0.0,0.0,0.0];
        if(navigator.getGamepads && navigator.getGamepads()) {
            var gamepads = navigator.getGamepads();
            if(gamepads) {
                for(var i = 0; i < gamepads.length; ++i) {
                    var gamepad = gamepads[i];
                    if(gamepad && gamepad.connected) {
                        axis = gamepad.axes;
                    };
                };
            };
        };
        var leftVel = Math.sqrt(Math.pow(axis[0], 2) + Math.pow(axis[1], 2));
        var rightVel = Math.sqrt(Math.pow(axis[2], 2) + Math.pow(axis[3], 2));
        this.acgLeftStick.dir = Math.atan2(axis[1], axis[0]);
        this.acgLeftStick.velocity = leftVel < this.acgStickThreshold ? 0.0 : leftVel > 1.0 ? 1.0 : leftVel;
        this.acgRightStick.dir = Math.atan2(axis[3], axis[2]);
        this.acgRightStick.velocity = rightVel < this.acgStickThreshold ? 0.0 : rightVel > 1.0 ? 1.0 : rightVel;
    };
};
//=============================================================================
// Game_CharacterBase - 歩行グラフィック拡張のセットアップ
//=============================================================================
Game_CharacterBase.prototype.canPixelMove = function() {
    return false;
};

var _Ayatam_Acg_Game_CharacterBase_prototype_update = Game_CharacterBase.prototype.update;
Game_CharacterBase.prototype.update = function() {
    this.acgEventRooting = this.isMoveRouteForcing() ? true : false;
    if(this.canPixelMove()) {
        this.updatePixelPos();
        return;
    };
    _Ayatam_Acg_Game_CharacterBase_prototype_update.call(this);
};

var _Ayatam_Acg_Game_CharacterBase_prototype_straighten = Game_CharacterBase.prototype.straighten;
Game_CharacterBase.prototype.straighten = function() {
    if(this.canEnableAcgCharacter() && this.isAcgAdvanacedCharacter()) {
        if (this.hasWalkAnime() || this.hasStepAnime()) {
            this.resetPattern();
        }
        this._animationCount = 0;
        return;
    };
    _Ayatam_Acg_Game_CharacterBase_prototype_straighten.call(this);
};

Game_CharacterBase.prototype.acgPixelFollowAble = function() {
    return true;
};

Game_CharacterBase.prototype.setAcgEventRunMode = function(mode) {
    this.acgEventRun = mode;
};

Game_CharacterBase.prototype.isAcgEventRunMode = function() {
    if(this.acgEventRun === undefined) this.acgEventRun = false;
    return this.acgEventRun;
};

Game_CharacterBase.prototype.isAcgEventRooting = function() {
    if(this.acgEventRooting === undefined) this.acgEventRooting = false;
    return this.acgEventRooting;
};

Game_CharacterBase.prototype.isAcgEventRootEnded = function() {
    if(this.acgEventRootEnded === undefined) this.acgEventRootEnded = false;
    return this.acgEventRootEnded;
};

Game_CharacterBase.prototype.isAcgEventRootTurning = function() {
    if(this.acgEventRootTurning === undefined) this.acgEventRootTurning = false;
    return this.acgEventRootTurning;
};

Game_CharacterBase.prototype.canEnableAcgCharacter = function() {
    if(Ayatam.ACG.GlobalSettings.useCharacterFunctions) {
        if(Ayatam.ACG.GlobalSettings.functionSw > 0) {
            if(!$gameSwithes.value(Ayatam.ACG.GlobalSettings.functionSw)) return false;
        }; 
        if(!Ayatam.ACG.GlobalSettings.functionFollowers) {
            if(this instanceof Game_Follower) {
                return false;
            }else{
                return true;
            };
        }else{
            return true;
        };
    };
    return false;
};

Game_CharacterBase.prototype.isAcgAdvanacedCharacter = function() {
    if(this._characterName.includes(this.getAcgAnimationName())) return true;
    if(this._characterName.includes(this.getAcgAnimSpeedName())) return true;
    if(this._characterName.includes(this.getAcgPlayOnceName())) return true;
    if(this._characterName.includes(this.getAcgStepAnimeName())) return true;
    if(this._characterName.includes(this.getAcgReverseAnimeName())) return true;
    if(this._characterName.includes(this.getAcgOffsetYName())) return true;
    return false;
};

Game_CharacterBase.prototype.getAcgAnimationName = function() {
    return Ayatam.ACG.GlobalSettings.animationName;
};

Game_CharacterBase.prototype.getAcgAnimSpeedName = function() {
    return Ayatam.ACG.GlobalSettings.animSpeedName;
};

Game_CharacterBase.prototype.getAcgPlayOnceName = function() {
    return Ayatam.ACG.GlobalSettings.animPlayOnceName;
};

Game_CharacterBase.prototype.getAcgStepAnimeName = function() {
    return Ayatam.ACG.GlobalSettings.stepAnimeName;
};

Game_CharacterBase.prototype.getAcgReverseAnimeName = function() {
    return Ayatam.ACG.GlobalSettings.reverseAnimeName;
};

Game_CharacterBase.prototype.getAcgOffsetYName = function() {
    return Ayatam.ACG.GlobalSettings.charOffSetY;
};

Game_CharacterBase.prototype.getAcgAnimations = function() {
    var getAnimation = this._characterName.match(eval('/' + this.getAcgAnimationName() + '(.*)/i'));
    if(getAnimation !== null) {
        getAnimation = getAnimation[1].match(/^(\d+)/i)[1];
        getAnimation = Number(getAnimation);
        return getAnimation;
    }else{
        return 3;
    };
};

var _Ayatam_Acg_Game_CharacterBase_prototype_setImage = Game_CharacterBase.prototype.setImage;
Game_CharacterBase.prototype.setImage = function(characterName, characterIndex) {
    _Ayatam_Acg_Game_CharacterBase_prototype_setImage.call(this,characterName,characterIndex);
    this.acgResetAnimation();
};

Game_CharacterBase.prototype.acgGetCharOffsetY = function() {
    var getOffsetY = this._characterName.match(eval('/' + this.getAcgOffsetYName() + '(.*)/i'));
    if(getOffsetY !== null) {
        getOffsetY = getOffsetY[1].match(/^(\d+)/i)[1];
        getOffsetY = Number(getOffsetY);
        return getOffsetY;
    }else{
        return 0;
    };
};

var _Ayatam_Acg_Game_CharacterBase_prototype_setStepAnime = Game_CharacterBase.prototype.setStepAnime;
Game_CharacterBase.prototype.setStepAnime = function(stepAnime) {
    if(this._stepAnime === stepAnime) return;
    var stepA = _Ayatam_Acg_Game_CharacterBase_prototype_setStepAnime.call(this,stepAnime) !== undefined ? _Ayatam_Acg_Game_CharacterBase_prototype_setStepAnime.call(this,stepAnime) : stepAnime;
    this._stepAnime = this._characterName.includes(this.getAcgStepAnimeName()) ? true : stepA;
};

Game_CharacterBase.prototype.acgResetAnimation = function() {
    if(!this.canEnableAcgCharacter()) return;
    if(!this.isAcgAdvanacedCharacter()) return;
    this._acgOffsetY = this.acgGetCharOffsetY();
    this._animationCount = 0;
    this._pattern = this._characterName.includes(this.getAcgReverseAnimeName()) ? this.maxPattern()-1 : 0;
    this.setStepAnime(this._characterName.includes(this.getAcgStepAnimeName()));
};

Game_CharacterBase.prototype.getAcgAnimSpeed = function() {
    var getAnimation = this._characterName.match(eval('/' + this.getAcgAnimSpeedName() + '(.*)/i'));
    if(getAnimation !== null) {
        getAnimation = getAnimation[1].match(/^(\d+)/i)[1];
        getAnimation = Number(getAnimation);
        return getAnimation;
    }else{
        return 60;
    };
};

var _Ayatam_Acg_Game_CharacterBase_prototype_maxPattern = Game_CharacterBase.prototype.maxPattern;
Game_CharacterBase.prototype.maxPattern = function() {
    if(this.canEnableAcgCharacter()) {
        return this.isAcgAdvanacedCharacter() ? this.getAcgAnimations() : _Ayatam_Acg_Game_CharacterBase_prototype_maxPattern.call(this);
    }else{
        return _Ayatam_Acg_Game_CharacterBase_prototype_maxPattern.call(this);
    };
};

var _Ayatam_Acg_Game_CharacterBase_prototype_animationWait = Game_CharacterBase.prototype.animationWait;
Game_CharacterBase.prototype.animationWait = function() {
    if(this.canEnableAcgCharacter() && this.isAcgAdvanacedCharacter()) {
        var rSpeed = this.realMoveSpeed();
        var animation = this.maxPattern();
        var time = this.getAcgAnimSpeed();
        return Math.floor((8-rSpeed) * (time / (4*animation)));
    }else{
        return _Ayatam_Acg_Game_CharacterBase_prototype_animationWait.call(this);
    };
};

var _Ayatam_Acg_Game_CharacterBase_prototype_isOriginalPattern = Game_CharacterBase.prototype.isOriginalPattern;
Game_CharacterBase.prototype.isOriginalPattern = function() {
    if(this.canEnableAcgCharacter() && this.isAcgAdvanacedCharacter()) {
        if(this.getAcgAnimations() > 3) {
            return this.pattern() === 0;
        }else{
            if(this.getAcgAnimations() < 3) {
                return this.pattern() === 0;
            }else{
                return _Ayatam_Acg_Game_CharacterBase_prototype_isOriginalPattern.call(this);
            };
        };
    }else{
        return _Ayatam_Acg_Game_CharacterBase_prototype_isOriginalPattern.call(this);
    };
};

var _Ayatam_Acg_Game_CharacterBase_prototype_resetPattern = Game_CharacterBase.prototype.resetPattern;
Game_CharacterBase.prototype.resetPattern = function() {
    if(this.canEnableAcgCharacter() && this.isAcgAdvanacedCharacter()) {
        if(this.getAcgAnimations() > 3) {
            this.setPattern(0);
        }else{
            if(this.getAcgAnimations() < 3) {
                this.setPattern(0);
            }else{
                _Ayatam_Acg_Game_CharacterBase_prototype_resetPattern.call(this);
            };
        };
    }else{
        _Ayatam_Acg_Game_CharacterBase_prototype_resetPattern.call(this);
    };
};

var _Ayatam_Acg_Game_CharacterBase_prototype_pattern = Game_CharacterBase.prototype.pattern;
Game_CharacterBase.prototype.pattern = function() {
    if(this.canEnableAcgCharacter() && this.isAcgAdvanacedCharacter()) {
        return this._pattern < this.getAcgAnimations() ? this._pattern : this.getAcgAnimations();
    };
    return _Ayatam_Acg_Game_CharacterBase_prototype_pattern.call(this);
};

var _Ayatam_Acg_Game_CharacterBase_prototype_updateAnimationCount = Game_CharacterBase.prototype.updateAnimationCount;
Game_CharacterBase.prototype.updateAnimationCount = function() {
    if(this.canEnableAcgCharacter() && this.isAcgAdvanacedCharacter()) {
        if(this._characterName.includes(this.getAcgPlayOnceName())) {
            this._animationCount++;
            return;
        };
    };
    _Ayatam_Acg_Game_CharacterBase_prototype_updateAnimationCount.call(this);
};

var _Ayatam_Acg_Game_CharacterBase_prototype_updatePattern = Game_CharacterBase.prototype.updatePattern;
Game_CharacterBase.prototype.updatePattern = function() {
    if(this.canEnableAcgCharacter() && this.isAcgAdvanacedCharacter()) {
        if(!this.hasStepAnime() && this._stopCount > 0) {
            this.resetPattern();
            return;
        };
        if(this._characterName.includes(this.getAcgPlayOnceName())) {
            if(this._characterName.includes(this.getAcgReverseAnimeName())) {
                this._pattern = this._pattern === 0 ? 0 : (this._pattern - 1) % this.maxPattern();
            }else{
                this._pattern = this._pattern === (this.maxPattern()-1) ? (this.maxPattern()-1) : (this._pattern + 1) % this.maxPattern();
            };
            return;
        }else{
            if(this._characterName.includes(this.getAcgReverseAnimeName())) {
                this._pattern = (this._pattern - 1) % this.maxPattern() === -1 ? this.maxPattern()-1 : (this._pattern - 1) % this.maxPattern();
                return;
            };
        };
    };
    _Ayatam_Acg_Game_CharacterBase_prototype_updatePattern.call(this);
};

Game_CharacterBase.prototype.isPlayOnceFinished = function() {
    if(this.canEnableAcgCharacter() && this.isAcgAdvanacedCharacter()) {
        if(this._characterName.includes(this.getAcgPlayOnceName())) return this._characterName.includes(this.getAcgReverseAnimeName()) ? this._pattern === 0 : this._pattern === (this.maxPattern()-1);
    };
    return false;
};
//=============================================================================
// Game_Character - 歩行グラフィック拡張のセットアップ
//=============================================================================
var _Ayatam_Acg_Game_Character_prototype_processMoveCommand = Game_Character.prototype.processMoveCommand;
Game_Character.prototype.processMoveCommand = function(command) {
    var gc = Game_Character;
    this.acgEventRootEnded = false;
    switch (command.code) {
    case gc.ROUTE_END:
        this.acgEventRootEnded = true;
        break;
    case gc.ROUTE_MOVE_DOWN:
        this.acgEventRootTurning = false;
        break;
    case gc.ROUTE_MOVE_LEFT:
        this.acgEventRootTurning = false;
        break;
    case gc.ROUTE_MOVE_RIGHT:
        this.acgEventRootTurning = false;
        break;
    case gc.ROUTE_MOVE_UP:
        this.acgEventRootTurning = false;
        break;
    case gc.ROUTE_MOVE_LOWER_L:
        this.acgEventRootTurning = false;
        break;
    case gc.ROUTE_MOVE_LOWER_R:
        this.acgEventRootTurning = false;
        break;
    case gc.ROUTE_MOVE_UPPER_L:
        this.acgEventRootTurning = false;
        break;
    case gc.ROUTE_MOVE_UPPER_R:
        this.acgEventRootTurning = false;
        break;
    case gc.ROUTE_MOVE_RANDOM:
        this.acgEventRootTurning = false;
        break;
    case gc.ROUTE_MOVE_TOWARD:
        this.acgEventRootTurning = false;
        break;
    case gc.ROUTE_MOVE_AWAY:
        this.acgEventRootTurning = false;
        break;
    case gc.ROUTE_MOVE_FORWARD:
        this.acgEventRootTurning = false;
        break;
    case gc.ROUTE_MOVE_BACKWARD:
        this.acgEventRootTurning = false;
        break;
    case gc.ROUTE_JUMP:
        this.acgEventRootTurning = false;
        break;
    case gc.ROUTE_WAIT:
        this.acgEventRootTurning = this.isMoving() ? false : true;
        break;
    case gc.ROUTE_TURN_DOWN:
        this.acgEventRootTurning = true;
        break;
    case gc.ROUTE_TURN_LEFT:
        this.acgEventRootTurning = true;
        break;
    case gc.ROUTE_TURN_RIGHT:
        this.acgEventRootTurning = true;
        break;
    case gc.ROUTE_TURN_UP:
        this.acgEventRootTurning = true;
        break;
    case gc.ROUTE_TURN_90D_R:
        this.acgEventRootTurning = true;
        break;
    case gc.ROUTE_TURN_90D_L:
        this.acgEventRootTurning = true;
        break;
    case gc.ROUTE_TURN_180D:
        this.acgEventRootTurning = true;
        break;
    case gc.ROUTE_TURN_90D_R_L:
        this.acgEventRootTurning = true;
        break;
    case gc.ROUTE_TURN_RANDOM:
        this.acgEventRootTurning = true;
        break;
    case gc.ROUTE_TURN_TOWARD:
        this.acgEventRootTurning = true;
        break;
    case gc.ROUTE_TURN_AWAY:
        this.acgEventRootTurning = true;
        break;
    };
    _Ayatam_Acg_Game_Character_prototype_processMoveCommand.call(this,command);
    this._pixelRouteCommand = command;
};

Game_Character.prototype.getAcgOptionTag = function() {
    if(!this.acgCharacterOptionTag) this.acgCharacterOptionTag = "";
    return this.acgCharacterOptionTag;
};

Game_Character.prototype.setAcgOptionTag = function(tag,flag = true) {
    this.acgCharacterOptionTag = String(tag);
    this.acgAutoCharacterOptionTagEraser = flag;
};

Game_Character.prototype.checkAcgOptionTagLists = function() {
    if(this.getAcgOptionTagLists().length > 0) {
        this.setAcgOptionTag(this.acgCharacterOptionTagLists.shift(),true)
    }else{
        this.resetAcgOptionTag();
    };
};

Game_Character.prototype.resetAcgOptionTagLists = function() {
    this.acgCharacterOptionTagLists = [];
};

Game_Character.prototype.resetAcgOptionTag = function() {
    this.resetAcgOptionTagLists();
    this.acgCharacterOptionTag = "";
    this.acgAutoCharacterOptionTagEraser = false;
};

Game_Character.prototype.setAcgOptionTagLists = function(tagList) {
    this.resetAcgOptionTag();
    this.acgCharacterOptionTagLists = tagList;
    if(this.acgCharacterOptionTagLists.length > 0) {
        this.setAcgOptionTag(this.acgCharacterOptionTagLists.shift(),true)
    };
};

Game_Character.prototype.resetAcgOptionTagLists = function() {
    this.acgCharacterOptionTagLists = [];
};

Game_Character.prototype.getAcgOptionTagLists = function() {
    if(this.acgCharacterOptionTagLists === undefined) this.resetAcgOptionTagLists();
    return this.acgCharacterOptionTagLists;
};

Game_Character.prototype.getAcgAutoOptionTagEraser = function() {
    return this.acgAutoCharacterOptionTagEraser;
};

Game_Character.prototype.acgRun = function(mode) {
    this.setAcgEventRunMode(mode);
};

Game_Character.prototype.acgChangeCharacter = function(actorId,charaName,charaIndex,keep) {
    if(actorId < 0) return;
    $gameActors.actor(actorId).setAcgRoutTempCharacter(charaName,charaIndex,keep);
};

Game_Character.prototype.acgResetCharacter = function(actorId) {
    if(actorId < 0) return;
    $gameActors.actor(actorId).setAcgRoutTempCharacter("",0,false);
};
//=============================================================================
// Game_Actor - 歩行グラフィック拡張のセットアップ
//=============================================================================
var _Ayatam_Acg_Game_Actor_prototype_setup = Game_Actor.prototype.setup;
Game_Actor.prototype.setup = function(actorId) {
    _Ayatam_Acg_Game_Actor_prototype_setup.call(this,actorId);
    this.createAcgRoutSetup();
    this.getAcgCharacterNote();
};

Game_Actor.prototype.createAcgRoutSetup = function() {
    this.acgTempCharacter = { name: "" , index: 0 , keep: false }; 
};

Game_Actor.prototype.setAcgRoutTempCharacter = function(charaName,charaIndex,keep) {
    this.acgTempCharacter.name = charaName;
    this.acgTempCharacter.index = charaIndex;
    this.acgTempCharacter.keep = keep;
};

Game_Actor.prototype.getAcgRoutTempCharacter = function() {
    return this.acgTempCharacter;
};

Game_Actor.prototype.getAcgCharacterNote = function() {
    if(this.acgNoteLoaded) return;
    this.acgNoteLoaded = true;
    this.acgBalloonHeight = 1.0;
    var lists = $dataActors[this.actorId()].note.split(/[\r\n]+/);
    var wrgMode = Ayatam.ACG.GlobalSettings.useWRG;
    var dDirMode = Ayatam.ACG.GlobalSettings.useDiagonal;
    var eqMode = Ayatam.ACG.GlobalSettings.useEquip;
    var stateMode = Ayatam.ACG.GlobalSettings.useState;
    this.acgActorSet = { wrg: wrgMode , dDir: dDirMode , eq: eqMode , state: stateMode };
    var useHp = Imported.Ayatam_EroRpgKit ? Ayatam.ACG.GlobalSettings.useHp : false;
    var useDhp = Imported.Ayatam_EroRpgKit ? Ayatam.ACG.GlobalSettings.useEquipDurability : false;
    var useWhp = Imported.Ayatam_EroRpgKit ? Ayatam.ACG.GlobalSettings.useEquipWear : false;
    var useSperm = Imported.Ayatam_EroRpgKit ? Ayatam.ACG.GlobalSettings.useSperm : false;
    this.acgActorEroRpgKitSet = { hp: useHp , dHp: useDhp , wHp: useWhp , sperm: useSperm };
    this.acgBaseCharacter = { name: "", index: 0 };
    this.acgStateList = [];
    var noStateList = false;
    var checkStateInfo = false;
    lists.forEach(note => {
        if(note !== "") {
            //個別歩行グラフィックの設定
            if(note.match(/<acg actorSet: (.*), (.*), (.*), (.*)>/i)) {
                var result = note.match(/<acg actorSet: (.*), (.*), (.*), (.*)>/i);
                var wrg = JSON.parse(JSON.stringify(result[1],(key,value)=>{
                    try{return JSON.parse(value);} catch (e) {}
                    return value;
                    }
                ));
                var dDir = JSON.parse(JSON.stringify(result[2],(key,value)=>{
                    try{return JSON.parse(value);} catch (e) {}
                    return value;
                    }
                ));
                var eq = JSON.parse(JSON.stringify(result[3],(key,value)=>{
                    try{return JSON.parse(value);} catch (e) {}
                    return value;
                    }
                ));
                var state = JSON.parse(JSON.stringify(result[4],(key,value)=>{
                    try{return JSON.parse(value);} catch (e) {}
                    return value;
                    }
                ));
                this.acgActorSet.wrg = wrg;
                this.acgActorSet.dDir = dDir;
                this.acgActorSet.eq = eq;
                this.acgActorSet.state = state;
            };
            //個別エロゲ制作キットMV歩行グラフィックの設定
            if(Imported.Ayatam_EroRpgKit) {
                if(note.match(/<acg actorErpgSet: (.*), (.*), (.*), (.*)>/i)) {
                    var result = note.match(/<acg actorErpgSet: (.*), (.*), (.*), (.*)>/i);
                    var hp = JSON.parse(JSON.stringify(result[1],(key,value)=>{
                        try{return JSON.parse(value);} catch (e) {}
                        return value;
                        }
                    ));
                    var dHp = JSON.parse(JSON.stringify(result[2],(key,value)=>{
                        try{return JSON.parse(value);} catch (e) {}
                        return value;
                        }
                    ));
                    var wHp = JSON.parse(JSON.stringify(result[3],(key,value)=>{
                        try{return JSON.parse(value);} catch (e) {}
                        return value;
                        }
                    ));
                    var sperm = JSON.parse(JSON.stringify(result[4],(key,value)=>{
                        try{return JSON.parse(value);} catch (e) {}
                        return value;
                        }
                    ));
                    this.acgActorEroRpgKitSet.hp = hp;
                    this.acgActorEroRpgKitSet.dHp = dHp;
                    this.acgActorEroRpgKitSet.wHp = wHp;
                    this.acgActorEroRpgKitSet.sperm = sperm;
                };
            };
            //ベース歩行グラフィックの設定
            if(note.match(/<acg base: (.*), (.*)>/i)) {
                var result = note.match(/<acg base: (.*), (.*)>/i);
                this.acgBaseCharacter.name = JSON.parse(JSON.stringify(result[1],(key,value)=>{
                    try{return JSON.parse(value);} catch (e) {}
                    return value;
                    }
                ));
                this.acgBaseCharacter.index = JSON.parse(JSON.stringify(result[2],(key,value)=>{
                    try{return JSON.parse(value);} catch (e) {}
                    return value;
                    }
                ));
            };
            //待機中アニメーションの設定
            if(note.match(/<acg balloonHeight: (.*)>/i)) {
                var result = note.match(/<acg balloonHeight: (.*)>/i);
                this.acgBalloonHeight = JSON.parse(JSON.stringify(result[1],(key,value)=>{
                    try{return JSON.parse(value);} catch (e) {}
                    return value;
                    }
                ));
            };
            //個別ステート時の歩行グラフィック設定
            if(note.match(/<acg stateList>/i)) checkStateInfo = true;
            if(note.match(/<\/acg stateList>/i)) checkStateInfo = false;
            if(checkStateInfo) {
                if(note.match(/state: (.*)/i)) {
                    var result = note.match(/state: (.*)/i);
                    var stateId = JSON.parse(JSON.stringify(result[1],(key,value)=>{
                        try{return JSON.parse(value);} catch (e) {}
                        return value;
                        }
                    ));
                    this.acgStateList.push(stateId);
                };
                if(note.match(/no state/i)) {
                    noStateList = true;
                };
            };
        };
    });
    if(!noStateList) {
        if(this.acgStateList.length <= 0) this.acgStateList = Ayatam.ACG.GlobalSettings.stateList;
    }else{
        this.acgStateList = [];
    };
};

Game_Actor.prototype.isPlayOnceFinished = function() {
    if(this.acgCharacterPlayOnce === undefined) return false;
    return this.acgCharacterPlayOnce;
};

Game_Actor.prototype.setPlayOnceFinished = function(finished) {
    this.acgCharacterPlayOnce = finished;
};

Game_Actor.prototype.getAcgOptionTag = function() {
    if(!this.acgCharacterOptionTag) this.acgCharacterOptionTag = "";
    return this.acgCharacterOptionTag;
};

Game_Actor.prototype.setAcgOptionTag = function(tag,flag = true) {
    this.acgCharacterOptionTag = String(tag);
    this.acgAutoCharacterOptionTagEraser = flag;
};

Game_Actor.prototype.setAcgOptionTagLists = function(tagList) {
    this.resetAcgOptionTag();
    this.acgCharacterOptionTagLists = tagList;
    if(this.acgCharacterOptionTagLists.length > 0) {
        this.setAcgOptionTag(this.acgCharacterOptionTagLists.shift(),true)
    };
};

Game_Actor.prototype.resetAcgOptionTagLists = function() {
    this.acgCharacterOptionTagLists = [];
};

Game_Actor.prototype.getAcgOptionTagLists = function() {
    if(this.acgCharacterOptionTagLists === undefined) this.resetAcgOptionTagLists();
    return this.acgCharacterOptionTagLists;
};

Game_Actor.prototype.checkAcgOptionTagLists = function() {
    if(this.getAcgOptionTagLists().length > 0) {
        if(this.acgCharacterOptionTagLists.length > 0) {
            this.setAcgOptionTag(this.acgCharacterOptionTagLists.shift(),true)
        };
    }else{
        this.resetAcgOptionTag();
    };
};

Game_Actor.prototype.resetAcgOptionTag = function() {
    this.resetAcgOptionTagLists();
    this.acgCharacterOptionTag = "";
    this.acgAutoCharacterOptionTagEraser = false;
};

Game_Actor.prototype.getAcgAutoOptionTagEraser = function() {
    return this.acgAutoCharacterOptionTagEraser;
};

Game_Actor.prototype.getAcgBalloonHeight = function() {
    if(this.acgBalloonHeight === undefined) return 1.0;
    return this.acgBalloonHeight;
};

Game_Actor.prototype.getAcgActorSet = function() {
    return this.acgActorSet;
};

Game_Actor.prototype.getAcgActorEroRpgSet = function() {
    return this.acgActorEroRpgKitSet;
};

Game_Actor.prototype.getAcgStateList = function() {
    return this.acgStateList;
};

Game_Actor.prototype.getAcgBaseCharacter = function() {
    return this.acgBaseCharacter;
};

Game_Actor.prototype.setAcgBaseCharacter = function(charaName,charaIndex) {
    this.acgBaseCharacter.name = charaName;
    this.acgBaseCharacter.index = charaIndex;
};
//=============================================================================
// Game_Party - 歩行グラフィック拡張のセットアップ
//=============================================================================
var _Ayatam_Acg_Game_Party_prototype_initialize = Game_Party.prototype.initialize;
Game_Party.prototype.initialize = function() {
    _Ayatam_Acg_Game_Party_prototype_initialize.call(this);
    this.createAcgRegionList();
    Ayatam.ACG.getAcgItemsNote();
    Ayatam.ACG.loadImgFile();
};

Game_Party.prototype.createAcgRegionList = function() {
    this.acgRegionList = [];
    if(Ayatam.ACG.GlobalSettings.regionList.length <= 0) return;
    Ayatam.ACG.GlobalSettings.regionList.forEach(region => {
        if(region) {
            this.acgRegionList[region.regionId] = region.regionName;
        };
    });
};

Game_Party.prototype.getAcgRegionList = function() {
    return this.acgRegionList;
};
//=============================================================================
// Game_Player - 歩行グラフィック拡張のセットアップ
//=============================================================================
var _Ayatam_Acg_Game_Player_prototype_initialize = Game_Player.prototype.initialize;
Game_Player.prototype.initialize = function() {
    _Ayatam_Acg_Game_Player_prototype_initialize.call(this);
    this.setupAcgAutoDashMode();
};

Game_Player.prototype.setupAcgAutoDashMode = function() {
    this.acgDashMode = Ayatam.ACG.GlobalSettings.autoDashMode;
    this.acgAutoDashDuration = Ayatam.ACG.GlobalSettings.autoDashDuration;
    this.acgCurrentDashStarter = 0;
};

Game_Player.prototype.isAcgAutoDashMode = function() {
    return this.acgDashMode;
};

var _Ayatam_Acg_Game_Player_prototype_isDashButtonPressed = Game_Player.prototype.isDashButtonPressed
Game_Player.prototype.isDashButtonPressed = function() {
    if(this.isAcgAutoDashMode()) {
        var shift = Input.isPressed('shift');
        var isMoving = Ayatam.ACG.GlobalSettings.diagonalMovements ? Input.dir8 !== 0 : Input.dir4 !== 0;
        if(isMoving) {
            if(this.acgCurrentDashStarter < this.acgAutoDashDuration) {
                if(this.canPixelMove()) this.acgCurrentDashStarter++;
                if(shift) this.acgCurrentDashStarter = 0;
                return false
            }else if(this.acgCurrentDashStarter >= this.acgAutoDashDuration) {
                if(this.canPixelMove()) this.acgCurrentDashStarter = this.acgAutoDashDuration;
                if(shift) this.acgCurrentDashStarter = 0;
                return true;
            };
        }else{
            this.acgCurrentDashStarter = 0;
            return false;
        };
    }else{
        return _Ayatam_Acg_Game_Player_prototype_isDashButtonPressed.call(this);
    };
};

var _Ayatam_Acg_Game_Player_prototype_updateDashing = Game_Player.prototype.updateDashing;
Game_Player.prototype.updateDashing = function() {
    if(this.isAcgAutoDashMode()) {
        if(this.acgCurrentDashStarter < this.acgAutoDashDuration) {
            this.acgCurrentDashStarter++;
        }else if(this.acgCurrentDashStarter >= this.acgAutoDashDuration) {
            this.acgCurrentDashStarter = this.acgAutoDashDuration;
        };
    };
    _Ayatam_Acg_Game_Player_prototype_updateDashing.call(this);
};

var _Ayatam_Acg_Game_Player_prototype_isDashing = Game_Player.prototype.isDashing;
Game_Player.prototype.isDashing = function() {
    if($gameTemp.isAcgFollowerDestinationValid(0)) {
        return $gameTemp.acgFollowerNeedRun(0);
    }else{
        return _Ayatam_Acg_Game_Player_prototype_isDashing.call(this);
    };
};

var _Ayatam_Acg_Game_Player_prototype_realMoveSpeed = Game_Player.prototype.realMoveSpeed;
Game_Player.prototype.realMoveSpeed = function() {
    if($gameTemp.isAcgFollowerDestinationValid(0)) {
        return $gameTemp.acgFollowerNeedRun(0) ? this._moveSpeed + 1 : this._moveSpeed;
    }else{
        return _Ayatam_Acg_Game_Player_prototype_realMoveSpeed.call(this);
    };
};

if(Ayatam.ACG.GlobalSettings.diagonalMovements) {
    var _Ayatam_Acg_Game_Player_prototype_getInputDirection = Game_Player.prototype.getInputDirection;
    Game_Player.prototype.getInputDirection = function() {
        return $gameTemp.isAcgFollowerDestinationValid(0) ? 0 : Ayatam.ACG.GlobalSettings.diagonalMovements ? Input.dir8 : _Ayatam_Acg_Game_Player_prototype_getInputDirection.call(this);
    };
    
    var _Ayatam_Acg_Game_Player_prototype_moveStraight = Game_Player.prototype.moveStraight;
    Game_Player.prototype.moveStraight = function(d) {
        if(Ayatam.ACG.GlobalSettings.diagonalMovements) {
            switch (d) {
                case 1:
                    this.moveDiagonally(4, 2);
                    break;
                case 3:
                    this.moveDiagonally(6, 2);
                    break;
                case 7:
                    this.moveDiagonally(4, 8);
                    break;
                case 9:
                    this.moveDiagonally(6, 8);
                    break;
                default:
                    _Ayatam_Acg_Game_Player_prototype_moveStraight.call(this,d);
                    break;
            };
        }else{
            _Ayatam_Acg_Game_Player_prototype_moveStraight.call(this,d);
        };
    };
};

var _Ayatam_Acg_Game_Player_prototype_update = Game_Player.prototype.update;
Game_Player.prototype.update = function(sceneActive) {
    if(this.canPixelMove()) {
        var lastScrolledX = this.scrolledX();
        var lastScrolledY = this.scrolledY();
        var wasMoving = this.isMoving();
        this.updateLastPixelPosition();
        this.updateTouchPixelPosition();
        this.updatePixelVelocity();
        this.updatePixelPosition();
        this.updatePixelCharacter();
        this.updatePixelDash();
        Game_Character.prototype.update.call(this);
        this.updateScroll(lastScrolledX, lastScrolledY);
        this.updatePixelSteps();
        this.updateVehicle();
        this._followers.update();
        if (!this.isMoving()) {
            if(Utils.RPGMAKER_NAME === "MV") {
                this.updateNonmoving(wasMoving);
            }else if(Utils.RPGMAKER_NAME === "MZ") {
                this.updateNonmoving(wasMoving, sceneActive);
            };
        }
        this.updatePixelCoordinate();
        return;
    }else{
        this.acgMoveByInput();
    };
    _Ayatam_Acg_Game_Player_prototype_update.call(this,sceneActive);
};

Game_Player.prototype.acgMoveByInput = function() {
    if(!this.isMoving()) {
        var direction = 0;
        if($gameTemp.isAcgFollowerDestinationValid(0)) {
            var x = $gameTemp.acgFollowerDestinationX(0);
            var y = $gameTemp.acgFollowerDestinationY(0);
            direction = this.findDirectionTo(x,y);
            this.setMovementSuccess(this.canPass(this._x, this._y, direction));
            if(this.isMovementSucceeded()) {
                if(direction > 0) {
                    this.executeMove(direction);
                }else{
                    if($gameTemp.acgFollowerNewDirection(0) > 0) this.setDirection($gameTemp.acgFollowerNewDirection(0));
                    $gameTemp.acgClearFollowerDestination(0);
                };
            }else{
                if($gameTemp.acgFollowerNewDirection(0) > 0) this.setDirection($gameTemp.acgFollowerNewDirection(0));
                $gameTemp.acgClearFollowerDestination(0);
            };
        };
    };
};

var _Ayatam_Acg_Game_Player_prototype_refresh = Game_Player.prototype.refresh;
Game_Player.prototype.refresh = function() {
    if(this.canEnableAcgCharacter()) {
        if($gameParty.leader()) {
            if(this._characterName === "" || $gameParty.leader().getAcgBaseCharacter().name === ""　|| !this._characterName.includes($gameParty.leader().getAcgBaseCharacter().name)) {
                if($gameParty.leader().getAcgBaseCharacter().name === "") {
                    $gameParty.leader().setAcgBaseCharacter($gameParty.leader().characterName(),$gameParty.leader().characterIndex());
                    if($gameParty.leader().getAcgActorSet().wrg) {
                        this._characterName = Ayatam.ACG.getFitCharacter($gameParty.leader().characterName(),[Ayatam.ACG.GlobalSettings.standName]);
                    }else{
                        this._characterName = $gameParty.leader().characterName();
                    };
                    this._characterIndex = $gameParty.leader().characterIndex();
                }else{
                    if($gameParty.leader().getAcgActorSet().wrg) {
                        this._characterName = Ayatam.ACG.getFitCharacter($gameParty.leader().getAcgBaseCharacter().name,[Ayatam.ACG.GlobalSettings.standName]);
                    }else{
                        this._characterName = Ayatam.ACG.getFitCharacter($gameParty.leader().getAcgBaseCharacter().name,[""]);
                    };
                    this._characterIndex = $gameParty.leader().getAcgBaseCharacter().index;
                };
            };
        };
        this.setImage(this._characterName, this._characterIndex);
        this._followers.refresh();
        return;
    };
    _Ayatam_Acg_Game_Player_prototype_refresh.call(this);
};
//=============================================================================
// Game_Follower - 歩行グラフィック拡張のセットアップ
//=============================================================================
Game_Follower.prototype.isMoveRouteForcing = function() {
    return $gamePlayer.isMoveRouteForcing();
};

Game_Follower.prototype.acgMemberIndex = function() {
    return this._memberIndex;
};

Game_Follower.prototype.canMove = function() {
    return $gamePlayer.canMove();
};

Game_Follower.prototype.isDashing = function() {
    if($gameTemp.isAcgFollowerDestinationValid(this.acgMemberIndex())) {
        return $gameTemp.acgFollowerNeedRun(this.acgMemberIndex());
    }else{
        return $gamePlayer.isDashing();
    };
};

Game_Follower.prototype.realMoveSpeed = function() {
    if($gameTemp.isAcgFollowerDestinationValid(this.acgMemberIndex())) {
        return $gameTemp.acgFollowerNeedRun(this.acgMemberIndex()) ? this._moveSpeed + 1 : this._moveSpeed;
    }else{
        return this._moveSpeed;
    };
};

var _Ayatam_Acg_Game_Follower_prototype_update = Game_Follower.prototype.update;
Game_Follower.prototype.update = function() {
    if(Ayatam.ACG.GlobalSettings.pixelMovements) {
        if(this.canPixelMove()) this.updateFollowerPixelMovements();
    }else{
        this.acgMoveByInput();
    };
    _Ayatam_Acg_Game_Follower_prototype_update.call(this);
    if($gameTemp.isAcgFollowerDestinationValid(this.acgMemberIndex())) this.setMoveSpeed(4);
};

Game_Follower.prototype.acgMoveByInput = function() {
    if(!this.isMoving()) {
        var direction = 0;
        if($gameTemp.isAcgFollowerDestinationValid(this.acgMemberIndex())) {
            var x = $gameTemp.acgFollowerDestinationX(this.acgMemberIndex());
            var y = $gameTemp.acgFollowerDestinationY(this.acgMemberIndex());
            direction = this.findDirectionTo(x,y);
            this.setMovementSuccess(this.canPass(this._x, this._y, direction));
            if(this.isMovementSucceeded()) {
                if(direction > 0) {
                    this.executeMove(direction);
                }else{
                    if($gameTemp.acgFollowerNewDirection(this.acgMemberIndex()) > 0) this.setDirection($gameTemp.acgFollowerNewDirection(this.acgMemberIndex()));
                    $gameTemp.acgClearFollowerDestination(this.acgMemberIndex());
                };
            }else{
                if($gameTemp.acgFollowerNewDirection(this.acgMemberIndex()) > 0) this.setDirection($gameTemp.acgFollowerNewDirection(this.acgMemberIndex()));
                $gameTemp.acgClearFollowerDestination(this.acgMemberIndex());
            };
        };
    };
};

Game_Follower.prototype.executeMove = function(direction) {
    this.moveStraight(direction);
};

var _Ayatam_Acg_Game_Follower_prototype_chaseCharacter = Game_Follower.prototype.chaseCharacter
Game_Follower.prototype.chaseCharacter = function(character) {
    if($gameTemp.isAcgFollowerDestinationValid(this.acgMemberIndex()-1)) return;
    if($gameTemp.isAcgFollowerDestinationValid(this.acgMemberIndex())) return;
    _Ayatam_Acg_Game_Follower_prototype_chaseCharacter.call(this,character);
};

var _Ayatam_Acg_Game_Follower_prototype_refresh = Game_Follower.prototype.refresh;
Game_Follower.prototype.refresh = function() {
    if(this.canEnableAcgCharacter() && Ayatam.ACG.GlobalSettings.functionFollowers) {
        if(this.actor()) {
            if(this._characterName === "" || this.actor().getAcgBaseCharacter().name === "" || !this._characterName.includes(this.actor().getAcgBaseCharacter().name)) {
                if(this.actor().getAcgBaseCharacter().name === "") {
                    this.actor().setAcgBaseCharacter(this.actor().characterName(),this.actor().characterIndex());
                    if(this.actor().getAcgActorSet().wrg) {
                        this._characterName = Ayatam.ACG.getFitCharacter(this.actor().characterName(),[Ayatam.ACG.GlobalSettings.standName]);
                    }else{
                        this._characterName = this.actor().characterName();
                    };
                    this._characterIndex = this.actor().characterIndex();
                }else{
                    if(this.actor().getAcgActorSet().wrg) {
                        this._characterName = Ayatam.ACG.getFitCharacter(this.actor().getAcgBaseCharacter().name,[Ayatam.ACG.GlobalSettings.standName]);
                    }else{
                        this._characterName = Ayatam.ACG.getFitCharacter(this.actor().getAcgBaseCharacter().name,[""]);
                    };
                    this._characterIndex = this.actor().getAcgBaseCharacter().index;
                };
            };
        };
        this.setImage(this._characterName, this._characterIndex);
        return;
    };
    _Ayatam_Acg_Game_Follower_prototype_refresh.call(this);
};
//=============================================================================
// Game_Followers - 歩行グラフィック拡張のセットアップ
//=============================================================================
var _Ayatam_Acg_Game_Followers_prototype_gather = Game_Followers.prototype.gather;
Game_Followers.prototype.gather = function() {
    _Ayatam_Acg_Game_Followers_prototype_gather.call(this);
    this.visibleFollowers().forEach(follower => {
        if(follower) {
            if($gameTemp.isAcgFollowerDestinationValid(follower.acgMemberIndex())) $gameTemp.acgClearFollowerDestination(follower.acgMemberIndex());
        };
    });
};
//=============================================================================
// Game_Event - 歩行グラフィック拡張のセットアップ
//=============================================================================
var _Ayatam_Acg_Game_Event_prototype_initialize = Game_Event.prototype.initialize;
Game_Event.prototype.initialize = function(mapId, eventId) {
    _Ayatam_Acg_Game_Event_prototype_initialize.call(this,mapId,eventId);
    this.isWrgCharacter();
};

Game_Event.prototype.isWrgCharacter = function() {
    this.acgWrgCharacter = { name: "" , index: 0 , enableWrg: false };
    if(this.event().note.match(/<acg wrg: (.*), (.*)>/i)) {
        var result = this.event().note.match(/<acg wrg: (.*), (.*)>/i);
        this.acgWrgCharacter.name = JSON.parse(JSON.stringify(result[1],(key,value)=>{
            try{return JSON.parse(value);} catch (e) {}
            return value;
            }
        ));
        this.acgWrgCharacter.index = JSON.parse(JSON.stringify(result[2],(key,value)=>{
            try{return JSON.parse(value);} catch (e) {}
            return value;
            }
        ));
        this.acgWrgCharacter.enableWrg = true;
    };
};

Game_Event.prototype.getAcgWrgCharacter = function() {
    return this.acgWrgCharacter;
};

Game_Event.prototype.acgChangeEventCharacter = function(charaName,charaIndex,enable) {
    this.acgWrgCharacter.name = charaName;
    this.acgWrgCharacter.index = charaIndex;
    this.acgWrgCharacter.enableWrg = enable;
};

Game_Event.prototype.isDashing = function() {
    if($gameTemp.isAcgEventDestinationValid(this.eventId())) {
        return $gameTemp.acgEventNeedRun(this.eventId());
    }else{
        return Game_CharacterBase.prototype.isDashing.call(this);
    };
};

Game_Event.prototype.realMoveSpeed = function() {
    if($gameTemp.isAcgEventDestinationValid(this.eventId())) {
        return $gameTemp.acgEventNeedRun(this.eventId()) ? this._moveSpeed + 1 : Game_CharacterBase.prototype.realMoveSpeed.call(this);
    }else{
        return Game_CharacterBase.prototype.realMoveSpeed.call(this);
    };
};

var _Ayatam_Acg_Game_Event_prototype_update = Game_Event.prototype.update;
Game_Event.prototype.update = function() {
    this.acgMoveByInput();
    _Ayatam_Acg_Game_Event_prototype_update.call(this);
};

Game_Event.prototype.acgMoveByInput = function() {
    if(!this.isMoving()) {
        var direction = 0;
        if($gameTemp.isAcgEventDestinationValid(this.eventId())) {
            var x = $gameTemp.acgEventDestinationX(this.eventId());
            var y = $gameTemp.acgEventDestinationY(this.eventId());
            direction = this.findDirectionTo(x,y);
            this.setMovementSuccess(this.canPass(this._x, this._y, direction));
            if(this.isMovementSucceeded()) {
                if(direction > 0) {
                    this.executeMove(direction);
                }else{
                    if($gameTemp.acgEventNewDirection(this.eventId()) > 0) this.setDirection($gameTemp.acgEventNewDirection(this.eventId()));
                    $gameTemp.acgClearEventDestination(this.eventId());
                };
            }else{
                if($gameTemp.acgEventNewDirection(this.eventId()) > 0) this.setDirection($gameTemp.acgEventNewDirection(this.eventId()));
                $gameTemp.acgClearEventDestination(this.eventId());
            };
        };
    };
};

Game_Event.prototype.executeMove = function(direction) {
    this.moveStraight(direction);
};
//=============================================================================
// Game_Temp - 歩行グラフィック拡張のセットアップ
//=============================================================================
var _Ayatam_Acg_Game_Temp_prototype_initialize = Game_Temp.prototype.initialize;
Game_Temp.prototype.initialize = function() {
    _Ayatam_Acg_Game_Temp_prototype_initialize.call(this);
    this._acgFollowerDestinationX = [];
    this._acgFollowerDestinationY = [];
    this._acgFollowerDirections = [];
    this._acgFollowerNeedRun = [];
    this._acgEventDestinationX = [];
    this._acgEventDestinationY = [];
    this._acgEventDirections = [];
    this._acgEventNeedRun = [];
};

var _Ayatam_Acg_Game_Temp_prototype_setDestination = Game_Temp.prototype.setDestination;
Game_Temp.prototype.setDestination = function(x, y) {
    if(this.isAcgFollowerDestinationValid(0)) this.acgClearFollowerDestination(0);
    _Ayatam_Acg_Game_Temp_prototype_setDestination.call(this,x,y);
};

Game_Temp.prototype.isAcgFollowerDestinationValid = function(followerIndex) {
    return this._acgFollowerDestinationX[followerIndex] !== undefined;
};

Game_Temp.prototype.acgClearFollowerDestination = function(followerIndex) {
    this._acgFollowerDestinationX[followerIndex] = undefined;
    this._acgFollowerDestinationY[followerIndex] = undefined;
    this._acgFollowerDirections[followerIndex] = undefined;
    this._acgFollowerNeedRun[followerIndex] = undefined;
};

Game_Temp.prototype.acgClearAllFollowerDestination = function() {
    this._acgFollowerDestinationX = [];
    this._acgFollowerDestinationY = [];
    this._acgFollowerDirections = [];
    this._acgFollowerNeedRun = [];
};

Game_Temp.prototype.setAcgFollowerDestination = function(followerIndex, x, y, dir, run = false) {
    this._acgFollowerDestinationX[followerIndex] = x;
    this._acgFollowerDestinationY[followerIndex] = y;
    this._acgFollowerDirections[followerIndex] = dir;
    this._acgFollowerNeedRun[followerIndex] = run;
};

Game_Temp.prototype.acgFollowerDestinationX = function(followerIndex) {
    return this._acgFollowerDestinationX[followerIndex];
};

Game_Temp.prototype.acgFollowerDestinationY = function(followerIndex) {
    return this._acgFollowerDestinationY[followerIndex];
};

Game_Temp.prototype.acgFollowerNewDirection = function(followerIndex) {
    return this._acgFollowerDirections[followerIndex];
};

Game_Temp.prototype.acgFollowerNeedRun = function(followerIndex) {
    return this._acgFollowerNeedRun[followerIndex];
};

Game_Temp.prototype.isAcgEventDestinationValid = function(eventId) {
    return this._acgEventDestinationX[eventId] !== undefined;
};

Game_Temp.prototype.acgClearEventDestination = function(eventId) {
    this._acgEventDestinationX[eventId] = undefined;
    this._acgEventDestinationY[eventId] = undefined;
    this._acgEventDirections[eventId] = undefined;
    this._acgEventNeedRun[eventId] = undefined;
};

Game_Temp.prototype.acgClearAllEventDestination = function() {
    this._acgEventDestinationX = [];
    this._acgEventDestinationY = [];
    this._acgEventDirections = [];
    this._acgEventNeedRun = [];
};

Game_Temp.prototype.setAcgEventDestination = function(eventId, x, y, dir, run = false) {
    this._acgEventDestinationX[eventId] = x;
    this._acgEventDestinationY[eventId] = y;
    this._acgEventDirections[eventId] = dir;
    this._acgEventNeedRun[eventId] = run;
};

Game_Temp.prototype.acgEventDestinationX = function(eventId) {
    return this._acgEventDestinationX[eventId];
};

Game_Temp.prototype.acgEventDestinationY = function(eventId) {
    return this._acgEventDestinationY[eventId];
};

Game_Temp.prototype.acgEventNewDirection = function(eventId) {
    return this._acgEventDirections[eventId];
};

Game_Temp.prototype.acgEventNeedRun = function(eventId) {
    return this._acgEventNeedRun[eventId];
};
//=============================================================================
// Sprite_Character - 歩行グラフィック拡張のセットアップ
//=============================================================================
var _Ayatam_Acg_Sprite_Character_prototype_initialize = Sprite_Character.prototype.initialize;
Sprite_Character.prototype.initialize = function(character) {
    _Ayatam_Acg_Sprite_Character_prototype_initialize.call(this,character);
    this.initAcgCharacter();
    this.setupAcgCharacter();
};

var _Ayatam_Acg_Sprite_Character_prototype_setCharacter = Sprite_Character.prototype.setCharacter;
Sprite_Character.prototype.setCharacter = function(character) {
    _Ayatam_Acg_Sprite_Character_prototype_setCharacter.call(this,character);
    this._acgLayerFlag = false;
    this._acgIsBigChara = false;
    if(this._character instanceof Game_Player) {
        if(this._character.canEnableAcgCharacter()) {
            this._acgLayerFlag = $gameParty.leader().getAcgActorSet().eq;
        };
    }else if(this._character instanceof Game_Follower && Ayatam.ACG.GlobalSettings.functionFollowers) {
        if(this._character.canEnableAcgCharacter()) {
            if(this._character.actor()) this._acgLayerFlag = this._character.actor().getAcgActorSet().eq;
        };
    };
};

Sprite_Character.prototype.initializeLayer = function() {
    this.acgCharaLayer = new Sprite();
    this.acgCharaPics = [];
    this.addChild(this.acgCharaLayer);
};

var _Ayatam_Acg_Sprite_Character_prototype_setCharacterBitmap = Sprite_Character.prototype.setCharacterBitmap;
Sprite_Character.prototype.setCharacterBitmap = function() {
    if(this._acgLayerFlag) {
        if(this.acgCharaLayer === undefined) this.initializeLayer();
        this.acgCharaLayer.removeChild(this.acgCharaPics[0]);
        this._acgIsBigChara = ImageManager.isBigCharacter(this._characterName);
        if(this.acgCharaPics[0] === undefined) this.acgCharaPics[0] = new Sprite();
        this.acgCharaPics[0].bitmap = ImageManager.loadCharacter(this._characterName);
        this.acgCharaPics[0].z = 0;
        this.acgCharaPics[0].anchor.x = 0.5;
        this.acgCharaPics[0].anchor.y = 1;
        this.acgCharaLayer.addChild(this.acgCharaPics[0]);
        this.acgCharaLayer.children.sort(function (a, b) { return a.z - b.z });
    }else{
        _Ayatam_Acg_Sprite_Character_prototype_setCharacterBitmap.call(this);
    };
};

var _Ayatam_Acg_Sprite_Character_prototype_updateBalloon = Sprite_Character.prototype.updateBalloon;
Sprite_Character.prototype.updateBalloon = function() {
    if(this._character instanceof Game_Player || this._character instanceof Game_Follower) {
        this.setupBalloon();
        if (this._balloonSprite) {
            this._balloonSprite.x = this.x;
            if(this._acgLayerFlag) {
                this._balloonSprite.y = this.y - (this.acgCharaPics[0]._frame.height * this.acgActor.getAcgBalloonHeight());
            }else if(this.acgActor) {
                this._balloonSprite.y = this.y - (this.height * this.acgActor.getAcgBalloonHeight());
            }else{
                this._balloonSprite.y = this.y - this.height;
            };
            if (!this._balloonSprite.isPlaying()) {
                this.endBalloon();
            }
        }
    }else{
        _Ayatam_Acg_Sprite_Character_prototype_updateBalloon.call(this);
    };
};

Sprite_Character.prototype.setLayerBitmap = function(layerId,charaName) {
    if(!this._acgLayerFlag) return;
    if(layerId <= 0) return;//素体の上書きを阻止
    if(this.acgCharaLayer === undefined) this.initializeLayer();
    this.acgCharaPics[layerId] = new Sprite();
    this.acgCharaPics[layerId].bitmap = ImageManager.loadCharacter(charaName);
    this.acgCharaPics[layerId].z = layerId;
    this.acgCharaPics[layerId].anchor.x = 0.5;
    this.acgCharaPics[layerId].anchor.y = 1;
    var sx = this.acgCharaPics[0]._frame.x;
    var sy = this.acgCharaPics[0]._frame.y;
    var sw = this.acgCharaPics[0]._frame.width;
    var sh = this.acgCharaPics[0]._frame.height;
    this.acgCharaPics[layerId].setFrame(sx,sy,sw,sh);
    this.acgCharaLayer.addChild(this.acgCharaPics[layerId]);
    this.acgCharaLayer.children.sort(function (a, b) { return a.z - b.z });
};

Sprite_Character.prototype.resetLayerBitmap = function(layerId) {
    if(!this._acgLayerFlag) return;
    if(layerId <= 0) return;//素体の上書きを阻止
    if(this.acgCharaLayer === undefined) return;
    if(this.acgCharaPics === undefined) return;
    if(this.acgCharaPics[layerId] === undefined) return;
    if(this.acgCharaPics[layerId].bitmap !== undefined) {
        this.acgCharaLayer.removeChild(this.acgCharaPics[layerId]);
        this.acgCharaPics[layerId] = new Sprite();
    };
};

var _Ayatam_Acg_Sprite_Character_prototype_createHalfBodySprites = Sprite_Character.prototype.createHalfBodySprites;
Sprite_Character.prototype.createHalfBodySprites = function() {
    if(this._acgLayerFlag) {
        if (!this._acgLayerUpperBody) {
            this._acgLayerUpperBody = [];
            var index = 0;
            if(this.acgCharaPics.length > 0) {
                this.acgCharaPics.forEach(chara => {
                    if(chara) {
                        this._acgLayerUpperBody[index] = new Sprite();
                        this._acgLayerUpperBody[index].anchor.x = 0.5;
                        this._acgLayerUpperBody[index].anchor.y = 1;
                        this._acgLayerUpperBody[index].z = index;
                        this.acgCharaLayer.addChild(this._acgLayerUpperBody[index]);
                        index++;
                    };
                });
            };
        }
        if (!this._acgLayerlowerBody) {
            this._acgLayerlowerBody = [];
            var index = 0;
            if(this.acgCharaPics.length > 0) {
                this.acgCharaPics.forEach(chara => {
                    if(chara) {
                        this._acgLayerlowerBody[index] = new Sprite();
                        this._acgLayerlowerBody[index].anchor.x = 0.5;
                        this._acgLayerlowerBody[index].anchor.y = 1;
                        this._acgLayerlowerBody[index].opacity = 128;
                        this._acgLayerlowerBody[index].z = index;
                        this.acgCharaLayer.addChild(this._acgLayerlowerBody[index]);
                        index++;
                    };
                });
            };
        }
    }else{
        _Ayatam_Acg_Sprite_Character_prototype_createHalfBodySprites.call(this);
    };
};

var _Ayatam_Acg_Sprite_Character_prototype_updatePosition = Sprite_Character.prototype.updatePosition;
Sprite_Character.prototype.updatePosition = function() {
    if(this._character._acgOffsetY) {
        this.x = this._character.screenX();
        this.y = this._character.screenY() + this._character._acgOffsetY;
        this.z = this._character.screenZ();
    }else{
        _Ayatam_Acg_Sprite_Character_prototype_updatePosition.call(this);
    };
};

var _Ayatam_Acg_Sprite_Character_prototype_updateCharacterFrame = Sprite_Character.prototype.updateCharacterFrame;
Sprite_Character.prototype.updateCharacterFrame = function() {
    if(this._acgLayerFlag) {
        var pw = this.patternWidth();
        var ph = this.patternHeight();
        var sx = (this.characterBlockX() + this.characterPatternX()) * pw;
        var sy = (this.characterBlockY() + this.characterPatternY()) * ph;
        this.updateHalfBodySprites();
        if (this._bushDepth > 0) {
            var d = this._bushDepth;
            if(this._acgLayerUpperBody.length > 0) {
                this._acgLayerUpperBody.forEach(upBody => {
                    if(upBody){
                        upBody.setFrame(sx, sy, pw, ph - d);
                    };
                });
            };
            if(this._acgLayerlowerBody.length > 0) {
                this._acgLayerlowerBody.forEach(loBody => {
                    if(loBody) {
                        loBody.setFrame(sx, sy + ph - d, pw, d);
                    };
                });
            };
            this.acgCharaPics.forEach(chara => {
                if(chara) {
                    chara.setFrame(sx, sy, 0, ph);
                };
            });
        } else {
            this.acgCharaPics.forEach(chara => {
                if(chara) {
                    chara.setFrame(sx, sy, pw, ph);
                };
            });
        }
    }else{
        _Ayatam_Acg_Sprite_Character_prototype_updateCharacterFrame.call(this);
    };
};

var _Ayatam_Acg_Sprite_Character_prototype_updateHalfBodySprites = Sprite_Character.prototype.updateHalfBodySprites;
Sprite_Character.prototype.updateHalfBodySprites = function() {
    if(this._acgLayerFlag) {
        if (this._bushDepth > 0) {
            this.createHalfBodySprites();
            if(this.acgCharaPics.length > 0) {
                var index = 0;
                this.acgCharaPics.forEach(chara => {
                    if(chara) {
                        if(this._acgLayerUpperBody[index]) {
                            this._acgLayerUpperBody[index].bitmap = chara.bitmap;
                            this._acgLayerUpperBody[index].visible = true;
                            this._acgLayerUpperBody[index].y = - this._bushDepth;
                            this._acgLayerUpperBody[index].setBlendColor(this.getBlendColor());
                            this._acgLayerUpperBody[index].setColorTone(this.getColorTone());
                        };
                        if(this._acgLayerlowerBody[index]) {
                            this._acgLayerlowerBody[index].bitmap = chara.bitmap;
                            this._acgLayerlowerBody[index].visible = true;
                            this._acgLayerlowerBody[index].setBlendColor(this.getBlendColor());
                            this._acgLayerlowerBody[index].setColorTone(this.getColorTone());
                        };
                        index++;
                    };
                });
            };
        } else if (this.acgCharaPics) {
            if(this.acgCharaPics.length > 0) {
                if(this._acgLayerUpperBody) {
                    if(this._acgLayerUpperBody.length > 0) {
                        this._acgLayerUpperBody.forEach(upBody => {
                            if(upBody) {
                                upBody.visible = false;
                            };
                        });
                    };
                };
                if(this._acgLayerlowerBody) {
                    if(this._acgLayerlowerBody.length > 0) {
                        this._acgLayerlowerBody.forEach(loBody => {
                            if(loBody) {
                                loBody.visible = false;
                            };
                        });
                    };
                };
            };
        }
    }else{
        _Ayatam_Acg_Sprite_Character_prototype_updateHalfBodySprites.call(this);
    };
};

Sprite_Character.prototype.initAcgCharacter = function() {
    if(this._character instanceof Game_Vehicle) return;
    if(this._character instanceof Game_Follower && !Ayatam.ACG.GlobalSettings.functionFollowers) return;
    if(!this._character.canEnableAcgCharacter()) return;
    this.acgDefaultCharacterName = "";
    this.acgDefaultCharacterIndex = 0;
    this.acgLoaded = false;
    if(this._character instanceof Game_Event) {//イベント
        if(!this._character.getAcgWrgCharacter().enableWrg) return;
        if(this._character.getAcgWrgCharacter().name !== "") {
            this.acgDefaultCharacterName = this._character.getAcgWrgCharacter().name;
            this.acgDefaultCharacterIndex = this._character.getAcgWrgCharacter().index;
        }else{
            this.acgDefaultCharacterName = this._character.characterName();
            this.acgDefaultCharacterIndex = this._character.characterIndex();
        };
    }else{//イベント以外
        this.acgActor = this._character instanceof Game_Player ? $gameParty.leader() : this._character.actor();
        if(this.acgActor === undefined) return;
        if(this.acgActor.getAcgBaseCharacter().name !== "") {
            this.acgDefaultCharacterName = this.acgActor.getAcgBaseCharacter().name;
            this.acgDefaultCharacterIndex = this.acgActor.getAcgBaseCharacter().index;
        }else{
            this.acgDefaultCharacterName = this._character.characterName();
            this.acgDefaultCharacterIndex = this._character.characterIndex();
        };
    };
};

Sprite_Character.prototype.setupAcgCharacter = function() {
    if(this._character instanceof Game_Vehicle) return;
    if(this._character instanceof Game_Follower && !Ayatam.ACG.GlobalSettings.functionFollowers) return;
    if(!this._character.canEnableAcgCharacter()) return;
    if(this._character instanceof Game_Event) {
        if(!this._character.getAcgWrgCharacter().enableWrg) return;
        this.acgStand = this._character.getAcgWrgCharacter().enableWrg ? Ayatam.ACG.GlobalSettings.standName : "";
        this.acgWalk = this._character.getAcgWrgCharacter().enableWrg ? Ayatam.ACG.GlobalSettings.walkName : "";
        this.acgRun = this._character.getAcgWrgCharacter().enableWrg ? Ayatam.ACG.GlobalSettings.runName : "";
    }else{
        if(this.acgActor === undefined) return;
        this.acgStand = this.acgActor.getAcgActorSet().wrg ? Ayatam.ACG.GlobalSettings.standName : "";
        this.acgWalk = this.acgActor.getAcgActorSet().wrg ? Ayatam.ACG.GlobalSettings.walkName : "";
        this.acgRun = this.acgActor.getAcgActorSet().wrg ? Ayatam.ACG.GlobalSettings.runName : "";
        this.acgDiagonal = this.acgActor.getAcgActorSet().dDir ? Ayatam.ACG.GlobalSettings.diagonalName : "";
        this.acgEquipMode = false;
        this.acgEquipLayers = [];
    };
};

var _Ayatam_Acg_Sprite_Character_prototype_characterBlockX = Sprite_Character.prototype.characterBlockX;
Sprite_Character.prototype.characterBlockX = function() {
    if(this._character instanceof Game_Player || this._character instanceof Game_Follower) {
        if(this._isBigCharacter || this._acgIsBigChara) {
            return 0;
        }else{
            var index = this._character.characterIndex();
            return index % 4 * this._character.getAcgAnimations();
        };
    }else{
        return _Ayatam_Acg_Sprite_Character_prototype_characterBlockX.call(this);
    };
};

var _Ayatam_Acg_Sprite_Character_prototype_characterBlockY = Sprite_Character.prototype.characterBlockY;
Sprite_Character.prototype.characterBlockY = function() {
    if(this._character instanceof Game_Player || this._character instanceof Game_Follower) {
        if (this._isBigCharacter || this._acgIsBigChara) {
            return 0;
        } else {
            var index = this._character.characterIndex();
            return Math.floor(index / 4) * 4;
        };
    }else{
        return _Ayatam_Acg_Sprite_Character_prototype_characterBlockY.call(this);
    };
};

var _Ayatam_Acg_Sprite_Character_prototype_patternWidth = Sprite_Character.prototype.patternWidth;
Sprite_Character.prototype.patternWidth = function() {
    var pw = 0;    
    if(this._acgLayerFlag) {
        if(this._tileId > 0) {
            pw = $gameMap.tileWidth();
        }else if(this._acgIsBigChara) {
            if(this.acgCharaPics[0] !== undefined) {
                pw = this.acgCharaPics[0].bitmap.width / 3;
            };
        }else{
            if(this.acgCharaPics[0] !== undefined) {
                pw = this.acgCharaPics[0].bitmap.width / 12;
            };
        };
    }else{
        pw = _Ayatam_Acg_Sprite_Character_prototype_patternWidth.call(this);
    };
    if(this._character.getAcgAnimations() > 3) {
        return ((pw*3) / this._character.getAcgAnimations());
    }else{
        return pw;
    };
};

var _Ayatam_Acg_Sprite_Character_prototype_patternHeight = Sprite_Character.prototype.patternHeight;
Sprite_Character.prototype.patternHeight = function() {
    if(this._acgLayerFlag) {
        if(this._tileId > 0) {
            return $gameMap.tileHeight();
        }else if(this._acgIsBigChara) {
            if(this.acgCharaPics === undefined) {
                return 0;
            }else{
                if(this.acgCharaPics[0] === undefined) {
                    return 0;
                }else{
                    return this.acgCharaPics[0].bitmap.height / 4;
                };
            };
        }else{
            if(this.acgCharaPics === undefined) {
                return 0;
            }else{
                if(this.acgCharaPics[0] === undefined) {
                    return 0;
                }else{
                    return this.acgCharaPics[0].bitmap.height / 8;
                };
            };
        };
    }else{
        return _Ayatam_Acg_Sprite_Character_prototype_patternHeight.call(this);
    };
};

var _Ayatam_Acg_Sprite_Character_prototype_update = Sprite_Character.prototype.update;
Sprite_Character.prototype.update = function() {
    _Ayatam_Acg_Sprite_Character_prototype_update.call(this);
    if(this.acgCheckForUpdate()) this.executeAcg();
};

Sprite_Character.prototype.acgCheckForEventReset = function() {
    var result = false;
    if(this._character.getAcgWrgCharacter().name !== "") {
        if(this._character.characterName() !== this._character.getAcgWrgCharacter().name) {
            if(!result) result = true;
        };
        if(this._character.characterIndex() !== this._character.getAcgWrgCharacter().index) {
            if(!result) result = true;
        };
    };
    if(result) {
        var characterName = this._character.getAcgWrgCharacter().name;
        var characterIndex = this._character.getAcgWrgCharacter().index;
        this._character.setImage(characterName,characterIndex);
        this._character.acgChangeEventCharacter("",0,false);
        this.acgDefaultCharacterName = "";
        this.acgDefaultCharacterIndex = 0;
    };
};

Sprite_Character.prototype.isEventRunning = function() {
    return $gameMap.isEventRunning();
};

Sprite_Character.prototype.acgCheckForUpdate = function() {
    if(Ayatam.ACG.cancelUpdate()) return false;
    var result = false;
    if(!this._character) return result;
    if(this._character instanceof Game_Event) {
        if(!this._character.getAcgWrgCharacter().enableWrg) {
            this.acgCheckForEventReset();
            return result;
        };
        if(!this.acgLoaded) {
            if(!result) result = true;
        };
        if($gameMap._needsRefresh) {
            if(!result) result = true;
        };
        if(this.acgEventRunning !== this.isEventRunning()) {
            if(!result) result = true;
            this.acgEventRunning = this.isEventRunning();
        };
        if(this._character.getAcgWrgCharacter().name !== "") {
            if(this.acgDefaultCharacterName !== this._character.getAcgWrgCharacter().name) {
                if(!result) result = true;
                this.acgDefaultCharacterName = this._character.getAcgWrgCharacter().name;
            };
            if(this.acgDefaultCharacterIndex !== this._character.getAcgWrgCharacter().index) {
                if(!result) result = true;
                this.acgDefaultCharacterIndex = this._character.getAcgWrgCharacter().index;
            };
        };
        if($gameTemp.isAcgEventDestinationValid(this._character.eventId())) {
            if(this._character.canPass(this._character._x,this._character._y,this._character._direction)) {
                if(!result && this._character.isMoving()) result = true;
            }else{
                if(!result) result = true;
            };
            if(!this.acgCheckEventDestinationFinished) this.acgCheckEventDestinationFinished = true;
        }else{
            if(this.acgCheckEventDestinationFinished) {
                if(!result) result = true;
                this.acgCheckEventDestinationFinished = false;
            }else{
                if(this.acgIsMoving !== this._character.isMoving()) {
                    if(this._character.canPass(this._character._x,this._character._y,this._character._direction)) {
                        if(!result && this._character.isMoving()) result = true;
                    }else{
                        if(!result) result = true;
                    };
                    this.acgIsMoving = this._character.isMoving();
                };
            };
        };
        if(this.acgEventRooting !== this._character.isAcgEventRooting()) {
            if(!result) result = true;
            this.acgEventRooting = this._character.isAcgEventRooting();
        };
        if(this.acgEventTurning !== this._character.isAcgEventRootTurning()) {
            if(!result) result = true;
            this.acgEventTurning = this._character.isAcgEventRootTurning();
        };
        if(this.acgEventRunMode !== this._character.isAcgEventRunMode()) {
            if(!result) result = true;
            this.acgEventRunMode = this._character.isAcgEventRunMode();
        };
        if(this.acgEventEnded !== this._character.isAcgEventRootEnded()) {
            if(!result) result = true;
            this.acgEventEnded = this._character.isAcgEventRootEnded();
        };
        if(this.acgOptionTag !== this._character.getAcgOptionTag()) {
            if(!result) result = true;
            this.acgOptionTag = this._character.getAcgOptionTag();
        };
        if(this.acgCharaOncePlayed !== this._character.isPlayOnceFinished()) {
            if(this._character.getAcgAutoOptionTagEraser()) {
                if(this._character.isPlayOnceFinished()) {
                    this._character.checkAcgOptionTagLists();
                };
            };
            this.acgCharaOncePlayed = this._character.isPlayOnceFinished();
        };
        if(this.acgCheckNoDetectionDir !== this.acgNoDetectionDir()) {
            if(!result) result = true;
            this.acgCheckNoDetectionDir = this.acgNoDetectionDir();
        };
    }else if(this._character instanceof Game_Player){
        if(this.acgActor === undefined) return result;
        if(this.acgActor !== $gameParty.leader()) {
            this.acgActor = $gameParty.leader();
        };
        if(!this.acgLoaded) {
            if(!result) result = true;
        };
        if(this.acgActor.getAcgBaseCharacter().name !== "") {
            if(this.acgDefaultCharacterName !== this.acgActor.getAcgBaseCharacter().name) {
                if(!result) result = true;
                this.acgDefaultCharacterName = this.acgActor.getAcgBaseCharacter().name;
            };
            if(this.acgDefaultCharacterIndex !== this.acgActor.getAcgBaseCharacter().index) {
                if(!result) result = true;
                this.acgDefaultCharacterIndex = this.acgActor.getAcgBaseCharacter().index;
            };
        };
        if(this.acgCheckLastInput !== Input.dir8) {
            if(Input.dir8 !== 0) this.acgLastInput = Input.dir8;
            this.acgCheckLastInput = Input.dir8;
        };
        if(this.acgActor.getAcgActorSet().wrg) {
            var hasMoving = Input.dir8 !== 0 && $gamePlayer.canPass($gamePlayer.x,$gamePlayer.y,$gamePlayer.direction()) && !this.acgNoDetectionDir();
            var followerMap = $gameTemp.isAcgFollowerDestinationValid(0);
            if(this.acgMovement !== hasMoving) {
                if(!result) result = true;
                this.acgMovement = hasMoving;
            };
            if(this.acgDashing !== this._character.isDashing()) {
                if(!result) result = true;
                this.acgDashing = this._character.isDashing();
            };
            if(this.acgFollowerMapTouch !== followerMap) {
                if(!result) result = true;
                this.acgFollowerMapTouch = followerMap;
            };
        };
        if(this.acgActor.getAcgActorSet().dDir) {
            if(this.acgCheckDiagonal !== [1,3,7,9].includes(Input.dir8)) {
                if(!result) result = true;
                this.acgCheckDiagonal = [1,3,7,9].includes(Input.dir8);
            };
        };
        if(this.acgActor.getAcgActorSet().eq) {
            if(this.acgEquips !== this.acgActor._equips) {
                if(!result) result = true;
                this.acgEquips = this.acgActor._equips;
            };
        };
        if(this.acgActor.getAcgActorSet().state || this.acgActor.getAcgActorEroRpgSet().sperm) {
            if(this.acgStates !== this.acgActor._states) {
                if(!result) result = true;
                this.acgStates = this.acgActor._states;
            };
        };
        if(this.acgIsMoving !== this._character.isMoving()) {
            if(!result) result = true;
            this.acgIsMoving = this._character.isMoving()
        };
        if(this.acgEventRunning !== this.isEventRunning()) {
            if(!result) result = true;
            this.acgEventRunning = this.isEventRunning();
        };
        if(this.acgOptionTag !== this.acgActor.getAcgOptionTag()) {
            if(!result) result = true;
            this.acgOptionTag = this.acgActor.getAcgOptionTag();
        };
        if(this.acgCharaOncePlayed !== this._character.isPlayOnceFinished()) {
            this.acgActor.setPlayOnceFinished(this._character.isPlayOnceFinished());
            if(this.acgActor.getAcgAutoOptionTagEraser()) {
                if(this.acgActor.isPlayOnceFinished()) {
                    this.acgActor.checkAcgOptionTagLists();
                };
            };
            this.acgCharaOncePlayed = this._character.isPlayOnceFinished();
        };
        if(this.acgEventRooting !== this._character.isAcgEventRooting()) {
            if(!result) result = true;
            this.acgEventRooting = this._character.isAcgEventRooting();
        };
        if(this.acgEventTurning !== this._character.isAcgEventRootTurning()) {
            if(!result) result = true;
            this.acgEventTurning = this._character.isAcgEventRootTurning();
        };
        if(this.acgEventRunMode !== this._character.isAcgEventRunMode()) {
            if(!result) result = true;
            this.acgEventRunMode = this._character.isAcgEventRunMode();
        };
        if(this.acgEventEnded !== this._character.isAcgEventRootEnded()) {
            if(!result) result = true;
            this.acgEventEnded = this._character.isAcgEventRootEnded();
        };
        if(this.acgTempActorName !== this.acgActor.getAcgRoutTempCharacter().name) {
            if(!result) result = true;
            this.acgTempActorName = this.acgActor.getAcgRoutTempCharacter().name;
        };
        if(this.acgTempActorIndex !== this.acgActor.getAcgRoutTempCharacter().index) {
            if(!result) result = true;
            this.acgTempActorIndex = this.acgActor.getAcgRoutTempCharacter().index;
        };
        if(this.acgTempActorKeep !== this.acgActor.getAcgRoutTempCharacter().keep) {
            if(!result) result = true;
            this.acgTempActorKeep = this.acgActor.getAcgRoutTempCharacter().keep;
        };
        if(this.acgActor.getAcgActorEroRpgSet().hp) {
            if(this.acgHpRate !== this.acgActor.hpRate()) {
                if(!result) result = true;
                this.acgHpRate = this.acgActor.hpRate();
            };
        };
        if(this.acgActor.getAcgActorEroRpgSet().dHp) {
            var dhp = 100;
            var dressId = Ayatam.ERORPGKIT.GlobalSettings.DressSlot;
            var dress = this.acgActor._equips[dressId]._itemId;
            if(Ayatam.ERORPGKIT.GlobalSettings.UseCostumeMode) {
                var costumeId = Ayatam.ERORPGKIT.GlobalSettings.CostumeSlot;
                var costume = this.acgActor._equips[costumeId]._itemId;
                if(costume !== 0) {
                    dress = costume;
                };
            };
            if(dress !== 0) {//装備していれば
                dhp = $dataArmors[dress].durability;
            }else{
                if(this.acgActor.useUnderwearDurabilityMode()) {
                    var underwearId = Ayatam.ERORPGKIT.GlobalSettings.UnderWearSlot;
                    var underwear = this.acgActor._equips[underwearId]._itemId;
                    if(underwear !== 0) {//装備していれば
                        dhp = $dataArmors[underwear].durability;
                    };
                };
            };
            if(this.acgDhpCheck !== dhp) {
                if(!result) result = true;
                this.acgDhpCheck = dhp;
            };
        };
        if(this.acgActor.getAcgActorEroRpgSet().wHp) {
            var wear = [this.acgActor.getActorDressWear(),this.acgActor.getActorUnderwearWear()];
            if(this.acgWear !== wear) {
                if(!result) result = true;
                this.acgWear = wear;
            };
        };
        if(this.acgCheckNoDetectionDir !== this.acgNoDetectionDir()) {
            if(!result) result = true;
            this.acgCheckNoDetectionDir = this.acgNoDetectionDir();
        };
    }else if(this._character instanceof Game_Follower){
        if(!Ayatam.ACG.GlobalSettings.functionFollowers) return result;
        if(this.acgActor === undefined) return result;
        if(this.acgActor !== this._character.actor()) {
            this.acgActor = this._character.actor();
        };
        if(!this.acgLoaded) {
            if(!result) result = true;
        };
        if(this.acgActor.getAcgBaseCharacter().name !== "") {
            if(this.acgDefaultCharacterName !== this.acgActor.getAcgBaseCharacter().name) {
                if(!result) result = true;
                this.acgDefaultCharacterName = this.acgActor.getAcgBaseCharacter().name;
            };
            if(this.acgDefaultCharacterIndex !== this.acgActor.getAcgBaseCharacter().index) {
                if(!result) result = true;
                this.acgDefaultCharacterIndex = this.acgActor.getAcgBaseCharacter().index;
            };
        };
        if(this.acgCheckLastInput !== Input.dir8) {
            if(Input.dir8 !== 0) this.acgLastInput = Input.dir8;
            this.acgCheckLastInput = Input.dir8;
        };
        if(this.acgActor.getAcgActorSet().wrg) {
            var followerMap = $gameTemp.isAcgFollowerDestinationValid(this._character._memberIndex);
            if(this.acgDashing !== this._character.isDashing()) {
                if(!result) result = true;
                this.acgDashing = this._character.isDashing();
            };
            if(this.acgFollowerGather !== $gamePlayer.followers().areGathering()) {
                if(!result) result = true;
                this.acgFollowerGather = $gamePlayer.followers().areGathering();
            };
            if(this.acgFollowerMapTouch !== followerMap) {
                if(!result) result = true;
                this.acgFollowerMapTouch = followerMap;
            };
        };
        if(this.acgActor.getAcgActorSet().dDir) {
            if(this.acgCheckDiagonal !== [1,3,7,9].includes(Input.dir8)) {
                if(!result) result = true;
                this.acgCheckDiagonal = [1,3,7,9].includes(Input.dir8);
            };
        };
        if(this.acgActor.getAcgActorSet().eq) {
            if(this.acgEquips !== this.acgActor._equips) {
                if(!result) result = true;
                this.acgEquips = this.acgActor._equips;
            };
        };
        if(this.acgActor.getAcgActorSet().state || this.acgActor.getAcgActorEroRpgSet().sperm) {
            if(this.acgStates !== this.acgActor._states) {
                if(!result) result = true;
                this.acgStates = this.acgActor._states;
            };
        };
        if(this.acgIsMoving !== this._character.isMoving()) {
            if(!result) result = true;
            this.acgIsMoving = this._character.isMoving()
        };
        if(this.acgEventRunning !== this.isEventRunning()) {
            if(!result) result = true;
            this.acgEventRunning = this.isEventRunning();
        };
        if(this.acgOptionTag !== this.acgActor.getAcgOptionTag()) {
            if(!result) result = true;
            this.acgOptionTag = this.acgActor.getAcgOptionTag();
        };
        if(this.acgCharaOncePlayed !== this._character.isPlayOnceFinished()) {
            this.acgActor.setPlayOnceFinished(this._character.isPlayOnceFinished());
            if(this.acgActor.getAcgAutoOptionTagEraser()) {
                if(this.acgActor.isPlayOnceFinished()) {
                    this.acgActor.checkAcgOptionTagLists();
                };
            };
            this.acgCharaOncePlayed = this._character.isPlayOnceFinished();
        };
        if(this.acgEventRooting !== this._character.isAcgEventRooting()) {
            if(!result) result = true;
            this.acgEventRooting = this._character.isAcgEventRooting();
        };
        if(this.acgEventTurning !== this._character.isAcgEventRootTurning()) {
            if(!result) result = true;
            this.acgEventTurning = this._character.isAcgEventRootTurning();
        };
        if(this.acgEventRunMode !== this._character.isAcgEventRunMode()) {
            if(!result) result = true;
            this.acgEventRunMode = this._character.isAcgEventRunMode();
        };
        if(this.acgEventEnded !== this._character.isAcgEventRootEnded()) {
            if(!result) result = true;
            this.acgEventEnded = this._character.isAcgEventRootEnded();
        };
        if(this.acgTempActorName !== this.acgActor.getAcgRoutTempCharacter().name) {
            if(!result) result = true;
            this.acgTempActorName = this.acgActor.getAcgRoutTempCharacter().name;
        };
        if(this.acgTempActorIndex !== this.acgActor.getAcgRoutTempCharacter().index) {
            if(!result) result = true;
            this.acgTempActorIndex = this.acgActor.getAcgRoutTempCharacter().index;
        };
        if(this.acgTempActorKeep !== this.acgActor.getAcgRoutTempCharacter().keep) {
            if(!result) result = true;
            this.acgTempActorKeep = this.acgActor.getAcgRoutTempCharacter().keep;
        };
        if(this.acgActor.getAcgActorEroRpgSet().hp) {
            if(this.acgHpRate !== this.acgActor.hpRate()) {
                if(!result) result = true;
                this.acgHpRate = this.acgActor.hpRate();
            };
        };
        if(this.acgActor.getAcgActorEroRpgSet().dHp) {
            var dhp = 100;
            var dressId = Ayatam.ERORPGKIT.GlobalSettings.DressSlot;
            var dress = this.acgActor._equips[dressId]._itemId;
            if(Ayatam.ERORPGKIT.GlobalSettings.UseCostumeMode) {
                var costumeId = Ayatam.ERORPGKIT.GlobalSettings.CostumeSlot;
                var costume = this.acgActor._equips[costumeId]._itemId;
                if(costume !== 0) {
                    dress = costume;
                };
            };
            if(dress !== 0) {//装備していれば
                dhp = $dataArmors[dress].durability;
            }else{
                if(this.acgActor.useUnderwearDurabilityMode()) {
                    var underwearId = Ayatam.ERORPGKIT.GlobalSettings.UnderWearSlot;
                    var underwear = this.acgActor._equips[underwearId]._itemId;
                    if(underwear !== 0) {//装備していれば
                        dhp = $dataArmors[underwear].durability;
                    };
                };
            };
            if(this.acgDhpCheck !== dhp) {
                if(!result) result = true;
                this.acgDhpCheck = dhp;
            };
        };
        if(this.acgActor.getAcgActorEroRpgSet().wHp) {
            var wear = [this.acgActor.getActorDressWear(),this.acgActor.getActorUnderwearWear()];
            if(this.acgWear !== wear) {
                if(!result) result = true;
                this.acgWear = wear;
            };
        };
        if(this.acgCheckNoDetectionDir !== this.acgNoDetectionDir()) {
            if(!result) result = true;
            this.acgCheckNoDetectionDir = this.acgNoDetectionDir();
        };
    };
    return result;
};

Sprite_Character.prototype.executeAcg = function() {
    if(this._character instanceof Game_Event) {
        if(!this._character.getAcgWrgCharacter().enableWrg) return;
    };
    if(this._character instanceof Game_Vehicle) return;
    if(this._character instanceof Game_Follower && !Ayatam.ACG.GlobalSettings.functionFollowers) return;
    if(!this._character.canEnableAcgCharacter()) return;
    if(this.acgDefaultCharacterName === "") return;
    if(!this.acgLoaded) this.acgLoaded = this.isEventRunning() ? false : true;
    this.getOptionTagConditions();
    if(this._character instanceof Game_Event) {//イベントの時
        if(this._character.isAcgEventRooting()) {//イベントルート中
            if(!this._character.isAcgEventRootTurning()) {//その場回転以外
                if(this._character.isAcgEventRunMode()) {//走りモード起動中
                    var base = Ayatam.ACG.getFitCharacter(this.acgDefaultCharacterName,[this.acgRun,this.acgOption]);
                }else{//歩きモード起動中
                    var base = Ayatam.ACG.getFitCharacter(this.acgDefaultCharacterName,[this.acgWalk,this.acgOption]);
                };
            }else{//その場回転中
                var base = Ayatam.ACG.getFitCharacter(this.acgDefaultCharacterName,[this.acgStand,this.acgOption]);
            };
            var characterName = base;
            var characterIndex = this.acgDefaultCharacterIndex;
            if(this._character.characterName() !== characterName) {
                this._character.setImage(characterName,characterIndex);
            };
        }else{//イベントルート終了時
            var moveRule = this._character.isMoving();
            this.updateAcgCharacterMovement(moveRule);
        };
    }else{//イベント以外のアクター属性の時
        if(this.acgActor === undefined) return;
        this.getAcgEquipConditions();
        this.getAcgStateConditions();
        this.getAcgRegionConditions();
        this.getAcgEroRpgConditions();
        if(this._character.isAcgEventRooting()) {//イベントルート中
            if(!this._character.isAcgEventRootTurning()) {//その場回転以外
                if(this._character.isAcgEventRunMode()) {//走りモード起動中
                    if(this.acgActor.getAcgRoutTempCharacter().name !== "") {//一時歩行グラ変更画像が存在する場合
                        if(this.acgActor.getAcgRoutTempCharacter().keep) {//差分機能を使用する場合
                            var base = Ayatam.ACG.getFitCharacter(this.acgActor.getAcgRoutTempCharacter().name,[this.acgHp,this.acgDhp,this.acgWhp,this.acgRun,this.acgRegion,this.acgState,this.acgSperm,this.acgOption]);
                        }else{//差分機能を使用しない場合
                            var base = String(this.acgActor.getAcgRoutTempCharacter().name);
                        };
                        var characterName = base;
                        var characterIndex = this.acgActor.getAcgRoutTempCharacter().index;
                    }else{//一時歩行グラ変更画像が存在しない場合
                        if(this.acgEquipMode) {
                            if(this.acgEquipLayers.length > 0) {
                                for(var i = 0; i < this.acgEquipLayers.length; ++i) {
                                    if(this.acgEquipLayers[i] !== "") {
                                        var charaName = Ayatam.ACG.getFitCharacter(this.acgEquipLayers[i],[this.acgHp,this.acgDhp,this.acgWhp,this.acgRun,this.acgRegion,this.acgState,this.acgSperm,this.acgOption]);
                                        this.setLayerBitmap(i+1,charaName);
                                    };
                                };
                            };
                        };
                        var base = Ayatam.ACG.getFitCharacter(this.acgDefaultCharacterName,[this.acgHp,this.acgDhp,this.acgWhp,this.acgRun,this.acgRegion,this.acgState,this.acgSperm,this.acgOption]);
                        var characterName = base;
                        var characterIndex = this.acgDefaultCharacterIndex;
                    };
                    if(this._character.characterName() !== characterName) {
                        this._character.setImage(characterName,characterIndex);
                    };
                }else{//歩きモード起動中
                    if(this.acgActor.getAcgRoutTempCharacter().name !== "") {//一時歩行グラ変更画像が存在する場合
                        if(this.acgActor.getAcgRoutTempCharacter().keep) {//差分機能を使用する場合
                            var base = Ayatam.ACG.getFitCharacter(this.acgActor.getAcgRoutTempCharacter().name,[this.acgHp,this.acgDhp,this.acgWhp,this.acgWalk,this.acgRegion,this.acgState,this.acgSperm,this.acgOption]);
                        }else{//差分機能を使用しない場合
                            var base = String(this.acgActor.getAcgRoutTempCharacter().name);
                        };
                        var characterName = base;
                        var characterIndex = this.acgActor.getAcgRoutTempCharacter().index;
                    }else{//一時歩行グラ変更画像が存在しない場合
                        if(this.acgEquipMode) {
                            if(this.acgEquipLayers.length > 0) {
                                for(var i = 0; i < this.acgEquipLayers.length; ++i) {
                                    if(this.acgEquipLayers[i] !== "") {
                                        var charaName = Ayatam.ACG.getFitCharacter(this.acgEquipLayers[i],[this.acgHp,this.acgDhp,this.acgWhp,this.acgWalk,this.acgRegion,this.acgState,this.acgSperm,this.acgOption]);
                                        this.setLayerBitmap(i+1,charaName);
                                    };
                                };
                            };
                        };
                        var base = Ayatam.ACG.getFitCharacter(this.acgDefaultCharacterName,[this.acgHp,this.acgDhp,this.acgWhp,this.acgWalk,this.acgRegion,this.acgState,this.acgSperm,this.acgOption]);
                        var characterName = base;
                        var characterIndex = this.acgDefaultCharacterIndex;
                    };
                    if(this._character.characterName() !== characterName) {
                        this._character.setImage(characterName,characterIndex);
                    };
                };
            }else{//その場回転中
                if(this.acgActor.getAcgRoutTempCharacter().name !== "") {//一時歩行グラ変更画像が存在する場合
                    if(this.acgActor.getAcgRoutTempCharacter().keep) {//差分機能を使用する場合
                        var base = Ayatam.ACG.getFitCharacter(this.acgActor.getAcgRoutTempCharacter().name,[this.acgHp,this.acgDhp,this.acgWhp,this.acgStand,this.acgRegion,this.acgState,this.acgSperm],this.acgOption);
                    }else{//差分機能を使用しない場合
                        var base = String(this.acgActor.getAcgRoutTempCharacter().name);
                    };
                    var characterName = base;
                    var characterIndex = this.acgActor.getAcgRoutTempCharacter().index;
                }else{//一時歩行グラ変更画像が存在しない場合
                    if(this.acgEquipMode) {
                        if(this.acgEquipLayers.length > 0) {
                            for(var i = 0; i < this.acgEquipLayers.length; ++i) {
                                if(this.acgEquipLayers[i] !== "") {
                                    var charaName = Ayatam.ACG.getFitCharacter(this.acgEquipLayers[i],[this.acgHp,this.acgDhp,this.acgWhp,this.acgStand,this.acgRegion,this.acgState,this.acgSperm],this.acgOption);
                                    this.setLayerBitmap(i+1,charaName);
                                };
                            };
                        };
                    };
                    var base = Ayatam.ACG.getFitCharacter(this.acgDefaultCharacterName,[this.acgHp,this.acgDhp,this.acgWhp,this.acgStand,this.acgRegion,this.acgState,this.acgSperm],this.acgOption);
                    var characterName = base;
                    var characterIndex = this.acgDefaultCharacterIndex;
                };
                if(this._character.characterName() !== characterName) {
                    this._character.setImage(characterName,characterIndex);
                };
            };
        }else{//通常歩行中
            var moveRule = false;
            if(this._character instanceof Game_Player) {
                if((!this.isEventRunning() || $gameTemp.isDestinationValid()) || ($gamePlayer.followers().areGathering() && this.isEventRunning()) || $gameTemp.isAcgFollowerDestinationValid(0)) {
                    moveRule = (Input.dir8 !== 0 && $gamePlayer.canPass($gamePlayer.x,$gamePlayer.y,$gamePlayer.direction()) && !this.acgNoDetectionDir()) || ($gameTemp.isDestinationValid() && $gamePlayer.canPass($gamePlayer.x,$gamePlayer.y,$gamePlayer.direction())) || $gameTemp.isAcgFollowerDestinationValid(0) || this._character.isMoving();
                };
            }else if(this._character instanceof Game_Follower) {
                if((!this.isEventRunning() || $gameTemp.isDestinationValid()) || ($gamePlayer.followers().areGathering() && this.isEventRunning()) || $gameTemp.isAcgFollowerDestinationValid(this._character._memberIndex)) {
                    if(Ayatam.ACG.GlobalSettings.pixelMovements) {
                        moveRule = this._character.isMoving();
                    }else{
                        moveRule = (Input.dir8 !== 0 && $gamePlayer.canPass($gamePlayer.x,$gamePlayer.y,$gamePlayer.direction()) && !this.acgNoDetectionDir()) || ($gameTemp.isDestinationValid() && $gamePlayer.canPass($gamePlayer.x,$gamePlayer.y,$gamePlayer.direction())) || $gameTemp.isAcgFollowerDestinationValid(this._character._memberIndex) || this._character.isMoving();
                    };
                };
            };
            this.updateAcgCharacterMovement(moveRule);
        };
    };
};

Sprite_Character.prototype.acgNoDetectionDir = function() {
    return false;
};

Sprite_Character.prototype.updateAcgCharacterMovement = function(moveRule) {
    if(this._character instanceof Game_Event) {//イベントの時
        if(moveRule) {//歩く/走る
            if(this._character.isAcgEventRunMode() || this._character.isDashing()) {//走る
                var base = Ayatam.ACG.getFitCharacter(this.acgDefaultCharacterName,[this.acgRun,this.acgRegion,this.acgOption]);
                var characterName = base;
                var characterIndex = this.acgDefaultCharacterIndex;
                if(this._character.characterName() !== characterName) {
                    this._character.setImage(characterName,characterIndex);
                };
            }else{//歩く
                var base = Ayatam.ACG.getFitCharacter(this.acgDefaultCharacterName,[this.acgWalk,this.acgRegion,this.acgOption]);
                var characterName = base;
                var characterIndex = this.acgDefaultCharacterIndex;
                if(this._character.characterName() !== characterName) {
                    this._character.setImage(characterName,characterIndex);
                };
            };
        }else{//待機中
            var base = Ayatam.ACG.getFitCharacter(this.acgDefaultCharacterName,[this.acgDiagonal,this.acgStand,this.acgRegion,this.acgOption]);
            var characterName = base;
            var characterIndex = this.acgDefaultCharacterIndex;
            if(this._character.characterName() !== characterName) {
                this._character.setImage(characterName,characterIndex);
            };
        };
    }else{//アクター・フォロワーの時
        if(moveRule) {//歩く/走る
            if(this._character.isDashing()) {//走る
                if([1,3,7,9].includes(Input.dir8)) {//斜め移動時
                    if(this.acgEquipMode) {
                        if(this.acgEquipLayers.length > 0) {
                            for(var i = 0; i < this.acgEquipLayers.length; ++i) {
                                if(this.acgEquipLayers[i] !== "") {
                                    var charaName = Ayatam.ACG.getFitCharacter(this.acgEquipLayers[i],[this.acgHp,this.acgDhp,this.acgWhp,this.acgDiagonal,this.acgRun,this.acgRegion,this.acgState,this.acgSperm,this.acgOption]);
                                    this.setLayerBitmap(i+1,charaName);
                                };
                            };
                        };
                    };
                    var base = Ayatam.ACG.getFitCharacter(this.acgDefaultCharacterName,[this.acgHp,this.acgDhp,this.acgWhp,this.acgDiagonal,this.acgRun,this.acgRegion,this.acgState,this.acgSperm,this.acgOption]);
                }else{//上下左右移動時
                    if(this.acgEquipMode) {
                        if(this.acgEquipLayers.length > 0) {
                            for(var i = 0; i < this.acgEquipLayers.length; ++i) {
                                if(this.acgEquipLayers[i] !== "") {
                                    var charaName = Ayatam.ACG.getFitCharacter(this.acgEquipLayers[i],[this.acgHp,this.acgDhp,this.acgWhp,this.acgRun,this.acgRegion,this.acgState,this.acgSperm,this.acgOption]);
                                    this.setLayerBitmap(i+1,charaName);
                                };
                            };
                        };
                    };
                    var base = Ayatam.ACG.getFitCharacter(this.acgDefaultCharacterName,[this.acgHp,this.acgDhp,this.acgWhp,this.acgRun,this.acgRegion,this.acgState,this.acgSperm,this.acgOption]);
                };
                var characterName = base;
                var characterIndex = this.acgDefaultCharacterIndex;
                if(this._character.characterName() !== characterName) {
                    this._character.setImage(characterName,characterIndex);
                };
            }else{//歩く
                if([1,3,7,9].includes(Input.dir8)) {//斜め移動時
                    if(this.acgEquipMode) {
                        if(this.acgEquipLayers.length > 0) {
                            for(var i = 0; i < this.acgEquipLayers.length; ++i) {
                                if(this.acgEquipLayers[i] !== "") {
                                    var charaName = Ayatam.ACG.getFitCharacter(this.acgEquipLayers[i],[this.acgHp,this.acgDhp,this.acgWhp,this.acgDiagonal,this.acgWalk,this.acgRegion,this.acgState,this.acgSperm,this.acgOption]);
                                    this.setLayerBitmap(i+1,charaName);
                                };
                            };
                        };
                    };
                    var base = Ayatam.ACG.getFitCharacter(this.acgDefaultCharacterName,[this.acgHp,this.acgDhp,this.acgWhp,this.acgDiagonal,this.acgWalk,this.acgRegion,this.acgState,this.acgSperm,this.acgOption]);
                }else{//上下左右移動時
                    if(this.acgEquipMode) {
                        if(this.acgEquipLayers.length > 0) {
                            for(var i = 0; i < this.acgEquipLayers.length; ++i) {
                                if(this.acgEquipLayers[i] !== "") {
                                    var charaName = Ayatam.ACG.getFitCharacter(this.acgEquipLayers[i],[this.acgHp,this.acgDhp,this.acgWhp,this.acgWalk,this.acgRegion,this.acgState,this.acgSperm,this.acgOption]);
                                    this.setLayerBitmap(i+1,charaName);
                                };
                            };
                        };
                    };
                    var base = Ayatam.ACG.getFitCharacter(this.acgDefaultCharacterName,[this.acgHp,this.acgDhp,this.acgWhp,this.acgWalk,this.acgRegion,this.acgState,this.acgSperm,this.acgOption]);
                };
                var characterName = base;
                var characterIndex = this.acgDefaultCharacterIndex;
                if(this._character.characterName() !== characterName) {
                    this._character.setImage(characterName,characterIndex);
                };
            };
        }else{//待機中
            if([1,3,7,9].includes(this.acgLastInput)) {//斜め移動時
                if(this.acgEquipMode) {
                    if(this.acgEquipLayers.length > 0) {
                        for(var i = 0; i < this.acgEquipLayers.length; ++i) {
                            if(this.acgEquipLayers[i] !== "") {
                                var charaName = Ayatam.ACG.getFitCharacter(this.acgEquipLayers[i],[this.acgHp,this.acgDhp,this.acgWhp,this.acgDiagonal,this.acgStand,this.acgRegion,this.acgState,this.acgSperm,this.acgOption]);
                                this.setLayerBitmap(i+1,charaName);
                            };
                        };
                    };
                };
                var base = Ayatam.ACG.getFitCharacter(this.acgDefaultCharacterName,[this.acgHp,this.acgDhp,this.acgWhp,this.acgDiagonal,this.acgStand,this.acgRegion,this.acgState,this.acgSperm,this.acgOption]);
            }else{//上下左右移動時
                if(this.acgEquipMode) {
                    if(this.acgEquipLayers.length > 0) {
                        for(var i = 0; i < this.acgEquipLayers.length; ++i) {
                            if(this.acgEquipLayers[i] !== "") {
                                var charaName = Ayatam.ACG.getFitCharacter(this.acgEquipLayers[i],[this.acgHp,this.acgDhp,this.acgWhp,this.acgStand,this.acgRegion,this.acgState,this.acgSperm,this.acgOption]);
                                this.setLayerBitmap(i+1,charaName);
                            };
                        };
                    };
                };
                var base = Ayatam.ACG.getFitCharacter(this.acgDefaultCharacterName,[this.acgHp,this.acgDhp,this.acgWhp,this.acgStand,this.acgRegion,this.acgState,this.acgSperm,this.acgOption]);
            };
            var characterName = base;
            var characterIndex = this.acgDefaultCharacterIndex;
            if(this._character.characterName() !== characterName) {
                this._character.setImage(characterName,characterIndex);
            };
        };
    };
};

Sprite_Character.prototype.getOptionTagConditions = function() {
    if(this._character instanceof Game_Player || this._character instanceof Game_Follower) {
        this.acgOption = this.acgActor.getAcgOptionTag() ? this.acgActor.getAcgOptionTag() : "";
    }else{
        this.acgOption = this._character.getAcgOptionTag() ? this._character.getAcgOptionTag() : "";
    };
};

Sprite_Character.prototype.getAcgEquipConditions = function() {
    this.acgEquipMode = false;
    if(this.acgEquipLayers === undefined) this.acgEquipLayers = [];
    if(this.acgCheckEquipLayers === undefined) this.acgCheckEquipLayers = [];
    if(!this.acgActor.getAcgActorSet().eq) return;
    if(Ayatam.ACG.GlobalSettings.equipPriority.length <= 0) return;
    for(var i = 0; i < Ayatam.ACG.GlobalSettings.equipPriority.length; ++i) {
        var equipType = Ayatam.ACG.GlobalSettings.equipPriority[i];
        var equipId = this.acgActor._equips[equipType]._itemId;
        this.resetLayerBitmap(i+1);
        if(equipId !== 0) {//装備中
            if(equipType === 0) {//武器
                if($dataWeapons[equipId].acgCharacterList.length > 0) {
                    if($dataWeapons[equipId].acgCharacterList[this.acgActor.actorId()] !== undefined) {
                        this.acgEquipLayers[i] = $dataWeapons[equipId].acgCharacterList[this.acgActor.actorId()].name;
                        this.acgEquipMode = true;
                    }else{
                        this.acgEquipLayers[i] = "";
                    };
                }else{
                    this.acgEquipLayers[i] = "";
                };
            }else{//防具
                if($dataArmors[equipId].acgCharacterList.length > 0) {
                    if($dataArmors[equipId].acgCharacterList[this.acgActor.actorId()] !== undefined) {
                        this.acgEquipLayers[i] = $dataArmors[equipId].acgCharacterList[this.acgActor.actorId()].name;
                        this.acgEquipMode = true;
                    }else{
                        this.acgEquipLayers[i] = "";
                    };
                }else{
                    this.acgEquipLayers[i] = "";
                };
            };
        }else{//未装備
            this.acgEquipLayers[i] = "";
        };
    };
};

Sprite_Character.prototype.getAcgStateConditions = function() {
    this.acgState = "";
    if(!this.acgActor.getAcgActorSet().state) return;
    if(this.acgActor.getAcgStateList().length <= 0) return;
    for(var i=0; i < this.acgActor.getAcgStateList().length; ++i) {
        if(this.acgActor.getAcgStateList()[i]) {
            if(this.acgActor.isStateAffected(this.acgActor.getAcgStateList()[i])) {
                this.acgState = String(Ayatam.ACG.GlobalSettings.stateName + this.acgActor.getAcgStateList()[i]);
                break;
            };
        };
    };
};

Sprite_Character.prototype.getAcgRegionConditions = function() {
    var regionId = this._character.regionId();
    this.acgRegion = "";
    this.acgRegionMode = false;
    if($gameParty.getAcgRegionList()[regionId] === undefined) return;
    this.acgRegion = $gameParty.getAcgRegionList()[regionId];
    this.acgRegionMode = true;
};

Sprite_Character.prototype.getAcgEroRpgConditions = function() {
    this.acgHp = "";
    this.acgDhp = "";
    this.acgWhp = "";
    this.acgSperm = "";
    if(!Imported.Ayatam_EroRpgKit) return;
    this.getAcgEroRpgHp();
    this.getAcgEroRpgDhp();
    this.getAcgEroRpgWhp();
    this.getAcgEroRpgSperm();
};

Sprite_Character.prototype.getAcgEroRpgHp = function() {
    if(!this.acgActor.getAcgActorEroRpgSet().hp) return;
    var hpName = Ayatam.ACG.GlobalSettings.hpName;
    var hpRate = this.acgActor.hpRate();
    Ayatam.ERORPGKIT.GlobalSettings.HpSplitAmount.forEach(hp => {
        var rate = hp / 100;
        if(hpRate <= rate) {
            this.acgHp = String(hpName + hp);
        };
    });
};

Sprite_Character.prototype.getAcgEroRpgDhp = function() {
    if(!this.acgActor.getAcgActorEroRpgSet().dHp) return;
    if(Ayatam.ACG.GlobalSettings.equipPriority.length <= 0) return;
    var dHpName = Ayatam.ACG.GlobalSettings.dHpName;
    for(var i=0; i < Ayatam.ACG.GlobalSettings.equipPriority.length; ++i) {
        if(Ayatam.ACG.GlobalSettings.equipPriority[i]) {
            var equipId = Ayatam.ACG.GlobalSettings.equipPriority[i];
            var armorId = this.acgActor._equips[equipId]._itemId;
            if(armorId !== 0) {//装備していれば
                if(equipId === Ayatam.ERORPGKIT.GlobalSettings.DressSlot) {
                    Ayatam.ERORPGKIT.GlobalSettings.DressDurabilityAmount.forEach(hp => {
                        if(hp) {
                            if($dataArmors[armorId].durability <= hp) {
                                this.acgDhp = String(dHpName + hp);
                            };
                        };
                    });
                }else if(equipId === Ayatam.ERORPGKIT.GlobalSettings.UnderWearSlot) {
                    Ayatam.ERORPGKIT.GlobalSettings.UnderWearDurabilityAmount.forEach(hp => {
                        if(hp) {
                            if($dataArmors[armorId].durability <= hp) {
                                this.acgDhp = String(dHpName + hp);
                            };
                        };
                    });
                }else if(equipId === Ayatam.ERORPGKIT.GlobalSettings.CostumeSlot) {
                    Ayatam.ERORPGKIT.GlobalSettings.DressDurabilityAmount.forEach(hp => {
                        if(hp) {
                            if($dataArmors[armorId].durability <= hp) {
                                this.acgDhp = String(dHpName + hp);
                            };
                        };
                    });
                };
                break;
            };
        };
    };
};

Sprite_Character.prototype.getAcgEroRpgWhp = function() {
    if(!this.acgActor.getAcgActorEroRpgSet().wHp) return;
    if(Ayatam.ACG.GlobalSettings.equipPriority.length <= 0) return;
    var wHpName = Ayatam.ACG.GlobalSettings.wHpName;
    var dressId = Ayatam.ERORPGKIT.GlobalSettings.DressSlot;
    var dress = this.acgActor._equips[dressId]._itemId;
    if(Ayatam.ERORPGKIT.GlobalSettings.UseCostumeMode) {
        var costumeId = Ayatam.ERORPGKIT.GlobalSettings.CostumeSlot;
        var costume = this.acgActor._equips[costumeId]._itemId;
        if(costume !== 0) {
            dress = costume;
        }; 
    };
    if(dress !== 0) {//装備していれば
        Ayatam.ERORPGKIT.GlobalSettings.DressWearAmount.forEach(wearHp => {
            if(wearHp) {
                if(this.acgActor.getActorDressWear() <= wearHp) {
                    this.acgWhp = String(wHpName + wearHp);
                };
            };
        });
    };
    if(this.acgActor.useUnderwearWearMode()) {
        var dressId = Ayatam.ERORPGKIT.GlobalSettings.DressSlot;
        var underwearId = Ayatam.ERORPGKIT.GlobalSettings.UnderWearSlot;
        var dress = this.acgActor._equips[dressId]._itemId;
        var underwear = this.acgActor._equips[underwearId]._itemId;
        if(Ayatam.ERORPGKIT.GlobalSettings.UseCostumeMode) {
            var costumeId = Ayatam.ERORPGKIT.GlobalSettings.CostumeSlot;
            var costume = this.acgActor._equips[costumeId]._itemId;
            if(costume !== 0) {
                dress = costume;
            }; 
        };
        if(dress === 0 && underwear !== 0) {//装備していれば
            Ayatam.ERORPGKIT.GlobalSettings.UnderWearWearAmount.forEach(wearHp => {
                if(wearHp) {
                    if(this.acgActor.getActorUnderwearWear() <= wearHp) {
                        this.acgWhp = String(wHpName + wearHp);
                    };
                };
            });
        };
    };
};

Sprite_Character.prototype.getAcgEroRpgSperm = function() {
    if(!this.acgActor.getAcgActorEroRpgSet().sperm) return;
    if(!Ayatam.ERORPGKIT.GlobalSettings.SpermLayer.UseSpermLayer) return;
    var spermName = Ayatam.ACG.GlobalSettings.spermName;
    var spermState = Ayatam.ERORPGKIT.GlobalSettings.SpermLayer.SpermStateId;
    if(this.acgActor.isStateAffected(spermState)) {
        this.acgSperm = String(spermName);
    };
};
//=============================================================================
// Window_Base.drawCharacter - 歩行グラフィック拡張のセットアップ
//=============================================================================
var _Ayatam_Acg_Window_Base_prototype_drawCharacter = Window_Base.prototype.drawCharacter;
Window_Base.prototype.drawCharacter = function(characterName, characterIndex, x, y) {
    var loadAcg = false;
    if(Ayatam.ACG.GlobalSettings.useCharacterFunctions) {
        if(Ayatam.ACG.GlobalSettings.functionSw > 0) {
            if($gameSwithes.value(Ayatam.ACG.GlobalSettings.functionSw)) {
                loadAcg = true;
            };
        }else{
            loadAcg = true;
        };
    };
    if(loadAcg) {
        var bitmap = ImageManager.loadCharacter(characterName);
        var big = ImageManager.isBigCharacter(characterName);
        var getAnimation = 3;
        var idle = 1;
        if(characterName.includes(this.getAcgAnimationName())) {
            getAnimation = characterName.match(eval('/' + this.getAcgAnimationName() + '(.*)/i'));
            if(getAnimation !== null) {
                getAnimation = getAnimation[1].match(/^(\d+)/i)[1];
                getAnimation = Number(getAnimation);
            }else{
                getAnimation = 3;
            };
            idle = getAnimation === 3 ? 1 : 0;
        };
        var pw = bitmap.width / (big ? getAnimation : getAnimation * 4);
        var ph = bitmap.height / (big ? 4 : 8);
        var n = characterIndex;
        var sx = ((n % 4 * 3 + 1) * idle) * pw;
        var sy = (Math.floor(n / 4) * 4) * ph;
        this.contents.blt(bitmap, sx, sy, pw, ph, x - pw / 2, y - ph);
    }else{
        _Ayatam_Acg_Window_Base_prototype_drawCharacter.call(this,characterName,characterIndex,x,y);
    };
};

Window_Base.prototype.getAcgAnimationName = function() {
    return Ayatam.ACG.GlobalSettings.animationName;
};

var _Ayatam_Acg_Window_Base_prototype_drawActorCharacter = Window_Base.prototype.drawActorCharacter;
Window_Base.prototype.drawActorCharacter = function(actor, x, y) {
    var loadAcg = false;
    if(Ayatam.ACG.GlobalSettings.useCharacterFunctions) {
        if(Ayatam.ACG.GlobalSettings.functionSw > 0) {
            if($gameSwithes.value(Ayatam.ACG.GlobalSettings.functionSw)) {
                loadAcg = true;
            };
        }else{
            loadAcg = true;
        };
    };
    if(loadAcg) {
        var charaName = actor.getAcgBaseCharacter().name;
        if(actor.getAcgActorSet().wrg) {
            charaName = Ayatam.ACG.getFitCharacter(charaName,[Ayatam.ACG.GlobalSettings.standName]);
        }else{
            charaName = Ayatam.ACG.getFitCharacter(charaName,[""]);
        };
        this.drawCharacter(charaName,actor.getAcgBaseCharacter().index, x, y);
    }else{
        _Ayatam_Acg_Window_Base_prototype_drawActorCharacter.call(this,actor,x,y);
    };
};
//=============================================================================
// Window_SavefileList.drawPartyCharacters - 歩行グラフィック拡張のセットアップ
//=============================================================================
var _Ayatam_Acg_Window_SavefileList_prototype_drawPartyCharacters = Window_SavefileList.prototype.drawPartyCharacters;
Window_SavefileList.prototype.drawPartyCharacters = function(info, x, y) {
    if(info.acgCharacters) {
        if(Ayatam.ACG.GlobalSettings.functionFollowers) {
            for(var i = 0; i < info.acgCharacters.length; i++) {
                var chara = info.acgCharacters[i];
                var charaName = chara[0];
                if(charaName) {
                    if(chara[2].wrg) {
                        charaName = Ayatam.ACG.getFitCharacter(charaName,[Ayatam.ACG.GlobalSettings.standName]);
                    }else{
                        charaName = Ayatam.ACG.getFitCharacter(charaName,[""]);
                    };
                    this.drawCharacter(charaName, chara[1], x + i * 48, y);
                }else{
                    var data = info.characters[i];
                    this.drawCharacter(data[0], data[1], x + i * 48, y);
                };
            };
        }else{
            for(var i = 0; i < 1; i++) {
                var chara = info.acgCharacters[i];
                var charaName = chara[0];
                if(charaName) {
                    if(chara[2].wrg) {
                        charaName = Ayatam.ACG.getFitCharacter(charaName,[Ayatam.ACG.GlobalSettings.standName]);
                    }else{
                        charaName = Ayatam.ACG.getFitCharacter(charaName,[""]);
                    };
                    this.drawCharacter(charaName, chara[1], x + i * 48, y);
                }else{
                    var data = info.characters[i];
                    this.drawCharacter(data[0], data[1], x + i * 48, y);
                };
            };
            if (info.characters) {
                for (var i = 1; i < info.characters.length; i++) {
                    var data = info.characters[i];
                    this.drawCharacter(data[0], data[1], x + i * 48, y);
                }
            }
        };
    }else{
        _Ayatam_Acg_Window_SavefileList_prototype_drawPartyCharacters.call(this,info,x,y);
    };
};
//=============================================================================
// DataManager - 歩行グラフィック拡張のセットアップ
//=============================================================================
var _Ayatam_Acg_DataManager_extractSaveContents = DataManager.extractSaveContents;
DataManager.extractSaveContents = function(contents) {
    this.acgCheckNewContents(contents);
    _Ayatam_Acg_DataManager_extractSaveContents.call(this,contents);
    this.acgRestoreActors();
    this.acgRestoreFollowers();
};

DataManager.acgCheckNewContents = function(contents) {
    if(!contents.party.acgRegionList) {
        contents.party.createAcgRegionList();
    };
    if(!contents.player.acgAutoDashDuration) {
        contents.player.setupAcgAutoDashMode();
    };
    if(Ayatam.ACG.GlobalSettings.pixelMovements && !contents.player._acgPixelPos) {
        contents.player.initAcgPixelMovements();
    };
};

DataManager.acgRestoreActors = function() {
    $dataActors.forEach(function(actor) { if(actor) { if($gameActors.actor(actor.id)) { $gameActors.actor(actor.id).acgNoteLoaded = false; $gameActors.actor(actor.id).createAcgRoutSetup(); $gameActors.actor(actor.id).getAcgCharacterNote(); } } });
};

DataManager.acgRestoreFollowers = function() {
    $gamePlayer._followers.initialize();
    $gamePlayer._followers._data.forEach(follower => {
        if(follower) {
            follower.copyPosition($gamePlayer);
        };
    });
    $gamePlayer.refresh();
};

var _Ayatam_Acg_DataManager_makeSavefileInfo = DataManager.makeSavefileInfo;
DataManager.makeSavefileInfo = function() {
    var loadAcg = false;
    var acgInfo = _Ayatam_Acg_DataManager_makeSavefileInfo.call(this);
    if(Ayatam.ACG.GlobalSettings.useCharacterFunctions) {
        if(Ayatam.ACG.GlobalSettings.functionSw > 0) {
            if($gameSwithes.value(Ayatam.ACG.GlobalSettings.functionSw)) {
                loadAcg = true;
            };
        }else{
            loadAcg = true;
        };
    };
    if(loadAcg) {
        acgInfo.acgCharacters = $gameParty.battleMembers().map(function(actor) {
            return [actor.getAcgBaseCharacter().name,actor.getAcgBaseCharacter().index,actor.getAcgActorSet()];
        });
    };
    return acgInfo;
};
//=============================================================================
// プラグイン終了 - End of file
//=============================================================================